{"data":[{"name":"Home Content","type":7,"id":1,"data":[{"value":"white","id":4,"name":"Logo Color"},{"value":"\/\/brangerbriz.com\/featured\/emerge\/index.html?bg=dark","id":5,"name":"Header iframe URL"},{"value":"Emerge, 2016","id":6,"name":"Highlighted Project Name"},{"value":"https:\/\/brangerbriz.com\/portfolio\/kinect-portraits","id":7,"name":"Highlighted Project URL"},{"value":"we are a full­ service digital agency+lab made up of artists, strategists, educators \u0026\u0026 programmers bent on articulating contemporary culture. we produce award winning work for brands, agencies, and cultural institutions around the world.","id":1,"name":"We Are Blurb"},{"value":"web\u003Cbr\u003E\r\nmobile\u003Cbr\u003E\r\nexperiential\u003Cbr\u003E\r\nsocial\u003Cbr\u003E\r\nmarketing","id":2,"name":"Service List"},{"value":"fact is, contemporary culture \u0026\u0026 digital culture are now one \u0026\u0026 the same.  that is why everything we do is driven by new technologies. we translate insights into strategy, strategy into design \u0026\u0026 design into innovative multi​ -platform experiences​.","id":3,"name":"Contemp Culture Blurb"},{"value":"\u003Cp\u003Eunlike many \u0026ldquo;digital agencies\u0026rdquo; we have a dedicated research \u0026amp;\u0026amp; development lab which is a major part of our process on every project\u0026mdash;helping to ensure we produce work for clients that is cutting-edge + contributes to the broader digital landscape. the lab also creates experimental work that provides context + perspective on the misunderstood aspects of the digital ecosystem. if you\u0026rsquo;re interested in diving a little deeper,\u0026nbsp;\u003Ca href=\u0022http:\/\/labs.brangerbriz.com\/\u0022\u003Echeck out our r\u0026amp;\u0026amp;d lab page.\u003C\/a\u003E\u003C\/p\u003E\r\n","id":50,"name":"RAD Blurb"}]},{"name":"Blog List","type":4,"id":5,"data":[],"child_component":[{"name":"Blog List","type":4,"id":55,"data":[{"value":"[\u0022machine learning\u0022,\u0022AI\u0022,\u0022algorithms\u0022]","id":177,"name":"Tags"},{"value":"","id":170,"name":"Social Media Thumbnail"},{"value":"perspective-on-creative-ai","id":43,"name":"slug"},{"value":"Perspective on \u0022Creative\u0022 AI","id":33,"name":"Post Title"},{"value":"by Nick Briz","id":41,"name":"written by"},{"value":"1","id":34,"name":"Published"},{"value":"10\/05\/2017","id":35,"name":"Create on"},{"value":"10\/05\/2017","id":37,"name":"Post Start"},{"value":"","id":38,"name":"Post End"},{"value":"The sampler opened the door to entirely new musical genres. It was a new meta-instrument which could become any other instrument. The sampler, and the sampling techniques which preceded it, introduced new forms of auditory collage we\u0027d never heard before. And we think a similar door has just been opened.","id":39,"name":"Summary"},{"value":"\u003Cbb-p\u003E\r\n\t\t\t\tAt Branger_Briz we\u0027ve been working on Machine Learning projects as far back as 2014 with one of our long time clients \u003Ca href=\u0022https:\/\/www.sportsmanias.com\/\u0022 target=\u0022_blank\u0022\u003ESportsmanias\u003C\/a\u003E. But it wasn\u0027t until more recently that we\u0027ve devoted much of our research and development efforts to \u003Ca href=\u0022http:\/\/brangerbriz.com\/blog\/machine-learning-a-journey-towards-general-purpose-algorithms\/\u0022\u003Eexploring the latest in the field of Artificial Intelligence\u003C\/a\u003E. Much of this R\u0026amp;D has already found it\u0027s way into a couple of our commercial projects, for example the \u003Ca href=\u0022https:\/\/www.engadget.com\/2017\/07\/06\/muse-bizarre-music-video-ai-found-footage\/\u0022 target=\u0022_blank\u0022\u003EAI software pipeline\u003C\/a\u003E we produced for the band Muse which auto-generated daily \u003Ca href=\u0022http:\/\/ai.muse.mu\/\u0022 target=\u0022_blank\u0022\u003Esupercut remixes\u003C\/a\u003E for the band\u0027s latest single \u003Ci\u003EDig Down\u003C\/i\u003E. We are now working on two interactive installations on for the Miami Children\u0027s Museum which feature a set of custom trained Machine Learning \u0022style-transfer\u0022 models.\r\n\t\t\t\u003C\/bb-p\u003E\r\n\r\n\t\t\t\u003Cbb-p\u003E\r\n\t\t\t\tThroughout our time researching technical progress in the field we\u0027ve also paid close attention to the way the general public has perceived these developments. The way AI is discussed in social and mainstream media at times sells the technology short and other times expects it to perform miracles. Both reactions are understandable, these technologies move at such a fast pace that it causes many to overlook some serious advancements as well as assume anything and everything is possible. But what concerns us more than mis-calibrated expectations is the anthropomorphization of these technologies. We call the field Artificial \u0022Intelligence\u0022, we refer to the latest designs of deeply nested linear-algebra functions artificial \u0022neural networks\u0022, we call the process of using data to adjust the internal parameters of these functions \u0022learning\u0022 and we refer to the final arrangement of values a \u0022trained\u0022 model. While these are all useful metaphors, they can have the negative side-effect of leading us to believe that this math is a conscious being. When these algorithms can be leveraged to generate new data (images, music, texts) we mistakenly ask, \u0022is the AI being creative?\u0022\r\n\t\t\t\u003C\/bb-p\u003E\r\n\r\n\t\t\t\u003Cbb-quote\u003E\r\n\t\t\t\tAI is \u0022creative\u0022 in the same way an assembly line robot does \u0022labor\u0022. These are tools designed for specific tasks, they are not sentient beings exerting mental effort.\r\n\t\t\t\u003C\/bb-quote\u003E\r\n\r\n\t\t\t\u003Cbb-p\u003E\r\n\t\t\t\tIn January we published a \u003Ca href=\u0022http:\/\/brangerbriz.com\/blog\/using-machine-learning-to-create-new-melodies\/\u0022\u003Eblog post\u003C\/a\u003E sharing some of our developments creating artificial neural networks which can produce new pieces of music. Work like this has lead others to ask the question, \u0022if the AI produces music does it deserve the copyright?\u0022, \u0022what will happen to musicians when they\u0027re replaced by these creative machines?\u0022 Though understandable, these questions are misinformed. I recently spoke at \u003Ca href=\u0022https:\/\/copycamp.pl\/en\/info\/what\/\u0022 target=\u0022_blank\u0022\u003ECopy Camp\u003C\/a\u003E, an amazing conference in Warsaw Poland devoted to discussing the role copyright and intellectual property laws play in our society as well as how best to improve them. I shared some of the music AI research we\u0027ve been doing, and more importantly, the perspective we\u0027re approaching this conversation from.\r\n\t\t\t\u003C\/bb-p\u003E\r\n\r\n\t\t\t\u003Cbb-p\u003E\r\n\t\t\t\tThe question, \u0022if the AI creates a work, does the AI deserve the copyright?\u0022 was raised in a couple of presentations, our response is: of course not. AI is \u0022creative\u0022 in the same way an assembly line robot does \u0022labor\u0022. These are tools designed for specific tasks, they are not sentient beings exerting mental effort, no matter how well that mechanical arm welds or how well the algorithm arranges musical notes.\r\n\t\t\t\t\u003Cbb-quote\u003E\r\n\t\t\t\t\thow might these new AI tools change the way musicians make music?\r\n\t\t\t\t\u003C\/bb-quote\u003E\r\n\t\t\t\tThe notion that these musical algorithms will one day replace human musicians is hyperbolic and uninteresting to us. A better question might be, \u0022how might these new AI tools change the way musicians make music?\u0022\r\n\t\t\t\u003C\/bb-p\u003E\r\n\r\n\t\t\t\u003Cbb-p\u003E\r\n\t\t\t\tThis is the question driving our current research. We think these new tools have the possibility to change the way musicians make music in the same way the sampler did. The sampler opened the door to entirely new musical genres. It was a new meta-instrument which could become any other instrument. The sampler, and the sampling techniques which preceded it, introduced new forms of auditory collage we\u0027d never heard before. And we think a similar door has just been opened. Below is an excerpt from my presentation which introduces our vision.\r\n\t\t\t\u003C\/bb-p\u003E\r\n\r\n\t\t\t\u003Cbb-div\u003E\r\n\t\t\t\t\u003Ciframe src=\u0022https:\/\/player.vimeo.com\/video\/236856853\u0022 width=\u0022640\u0022 height=\u0022360\u0022 frameborder=\u00220\u0022 webkitallowfullscreen mozallowfullscreen allowfullscreen\u003E\u003C\/iframe\u003E\r\n\t\t\t\u003C\/bb-div\u003E","id":40,"name":"Description"},{"value":"https:\/\/twitter.com\/branger_briz\/status\/916419419382960128","id":169,"name":"Tweet Link"}]},{"name":"Blog List","type":4,"id":69,"data":[{"value":"\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/439a027f8890d5cd92ee575d4c4285c7","id":170,"name":"Social Media Thumbnail"},{"value":"exploring-our-surrounding-wifi-landscape","id":43,"name":"slug"},{"value":"Exploring our surrounding WiFi landscape","id":33,"name":"Post Title"},{"value":"Nick Briz","id":41,"name":"written by"},{"value":"1","id":34,"name":"Published"},{"value":"01\/29\/2018","id":35,"name":"Create on"},{"value":"01\/29\/2018","id":37,"name":"Post Start"},{"value":"","id":38,"name":"Post End"},{"value":"Ever wonder how your phone is able to automatically connect to your home WiFi as soon as you walk through the door? Of course you haven’t, but you should, because as with so many of our tech decisions, this seemingly banal detail is yet another example of a trade-off between privacy and convenience. We led a group of California residents on a \u0022WiFi safari\u0022, exploring the otherwise invisible data surrounding us and discussing all the implications. ","id":39,"name":"Summary"},{"value":"\u003Cbb-media fullwidth=\u0022true\u0022\u003E \r\n\u003Cimg src=\u0022https:\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/231261b023ee97ad1de506ecef5d0631\u0022 \/\u003E\r\n\u003C\/bb-media\u003E\r\n\r\n\u003Cbb-p\u003E\r\n    Ever wonder how your phone is able to automatically connect to your home WiFi as soon as you walk through the door? Of course you haven’t, but you should, because it turns out this auto-connection is made possible by the fact that your phone is carelessly emitting messages, known as probe requests, in an attempt to connect to your home network everywhere you go. I say carelessly because, while they are convenient, these probe requests expose personal information about your previously connected WiFi networks which can be used to track your physical movements through a given area, determine the physical locations of where you might live, work and play and even bait your phone into getting hacked by connecting to a malicious network.\r\n\u003C\/bb-p\u003E\r\n\r\n\u003Cbb-quote credit=\u0022Chris O\u0027Neal in the VCReporter\u0022\u003Ea pair of technology researchers visited Thousand Oaks to demonstrate just how inundated we are by wireless signals, and explored the potential downside to being so open.\u003C\/bb-quote\u003E\r\n\r\n\u003Cbb-p\u003E\r\n    At Branger_Briz we’re driven to help people understand how technology works, so they can best decide how to use it rather than be used by it. It so happens that passively listening for and collecting these probe requests is a technique regularly deployed in different ways by hotels, government agencies, universities, shopping centers and other businesses. This is why we created \u003Ca href=\u0022http:\/\/probekit.brangerbriz.com\/\u0022 target=\u0022_blank\u0022\u003EProbe Kit\u003C\/a\u003E, a generative art installation which illustrates this technique by rendering the devices of museum visitors as digital butterflies along with the personal information they’re broadcasting into the air as they walk by.\r\n\u003C\/bb-p\u003E\r\n\r\n\u003Cbb-media\u003E \r\n\u003Cimg src=\u0022https:\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/42562837d1fd81043b58b916a8d1d5a3\u0022 \/\u003E\r\n\u003C\/bb-media\u003E\r\n\r\n\u003Cbb-p\u003E\r\n    Last weekend we attended the opening of \u003Ca href=\u0022http:\/\/cmato.org\/strings-data-and-the-self\/\u0022 target=\u0022_blank\u0022\u003EStrings: Data and the Self\u003C\/a\u003E, a New Media Art exhibition curated by Joel Kuennen and Riccardo Zagorodnev at the California Museum of Art Thousand Oaks (CMATO) that runs until April 15 of this year. We were thrilled to be showing Probe Kit alongside some of our favorite New Media artists, Heather Dewey-Hagborg, Jennifer Chan, Shawne Michaelain Holloway and Amanda Turner Pohan.\r\n\u003C\/bb-p\u003E\r\n\r\n\u003Cbb-media\u003E \r\n\u003Cimg src=\u0022https:\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/47becbd8016a5fed5a559ef03c1b5ab6\u0022 \/\u003E\r\n\u003C\/bb-media\u003E\r\n\r\n\u003Cbb-p\u003E\r\n    As part of the exhibition we lead a group from the Greater Los Angeles area on a \u003Ca href=\u0022https:\/\/www.vcreporter.com\/2018\/01\/into-the-e-wild-wifi-safari-explores-vulnerability-privacy-of-personal-devices-in-thousand-oaks\/\u0022 target=\u0022_blank\u0022\u003E\u0022Wifi Data Safari\u0022\u003C\/a\u003E in Thousand Oaks. The safari was aimed at providing context for the Probe Kit installation as well as offering insight into our research based studio practice. We developed custom software that participants could access on their phones by connecting to a portable network which was constantly scanning our surroundings for WiFi activity. We discovered and discussed all manner of interesting digital activity floating around us as electromagnetic waves oscillating at frequencies lower than those of visible light. \r\n\u003C\/bb-p\u003E\r\n\r\n\u003Cbb-p\u003E\r\n    As we walked through a park in front of City Hall we learned that the park was full of routers produced by the same manufacturer, some of which provided municipal WiFi to the park, others exclusively for city employees. There we were able to identify the devices of two residents we spotted in the park making use of the free WiFi. We explored shopping malls where we investigated the network setups of different businesses. We learned that some networks were installed only to provide customers with WiFi while others served to connect Raspberry Pi’s and tracking beacons likely set up to monitor their customers activity in the store. \r\n\u003C\/bb-p\u003E\r\n\r\n\u003Cbb-media\u003E \r\n\u003Cimg src=\u0022https:\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/6915dd53a8f5993a66b21f5ac13bf031\u0022 \/\u003E\r\n\u003C\/bb-media\u003E\r\n\r\n\u003Cbb-media\u003E \r\n\u003Cimg src=\u0022https:\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/22a73d5967ad4628b37b6da7096529f3\u0022 \/\u003E\r\n\u003C\/bb-media\u003E\r\n\r\n\u003Cbb-media\u003E \r\n\u003Cimg src=\u0022https:\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/958eff4f05daae665932b3e00c5061aa\u0022 \/\u003E\r\n\u003C\/bb-media\u003E\r\n\r\n\u003Cbb-p\u003E\r\nAt the end of the workshop we explored the data we had gathered throughout our journey and demonstrated how the probe requests we collected from pedestrians could be used to construct a map of their previously connected networks. We also showed how these probe requests could be used to hack someone’s connection to the Internet.  We ended with a discussion about the different measures you can take to protect yourself from this sort of exploitation. The most important of these being the very simple act of switching WiFi off when you’re not actively trying to connect to a specific network. \r\n\u003C\/bb-p\u003E\r\n\r\n\u003Cbb-quote\u003EOur goal with this excursion is to help people \u0022see\u0022 the data floating all around them so that they can understand what\u0027s at stake.\u003C\/bb-quote\u003E\r\n\r\n\u003Cbb-p\u003E\r\n    Our goal with this excursion is to help people \u0022see\u0022 the data floating all around them so that they can understand what\u0027s at stake. It would be ideal if we didn’t need to worry about such exploitation, but we realize that only by bringing awareness to privacy issues like this will we ever see change. No one is going to call their congressperson asking them to pressure manufacturers to update their devices, nor will anyone demand that Android devices implement better MAC Address randomization if they don\u0027t know what a MAC Address is and why that matters. \r\n\u003C\/bb-p\u003E\r\n\r\n\u003Cbb-p\u003E\r\n    Do you know what a MAC Address is? \u003Ca href=\u0022https:\/\/brangerbriz.com\/blog\/notes-from-our-wifi-data-safari\u0022\u003EIn a follow up blog post\u003C\/a\u003E we’ll discuss the technical information covered during the WiFi Data Safari in-depth and share the open source software we developed for it. \r\n\u003C\/bb-p\u003E\r\n","id":40,"name":"Description"},{"value":"https:\/\/twitter.com\/branger_briz\/status\/958071432700973058","id":169,"name":"Tweet Link"},{"value":"","id":177,"name":"Tags"}]},{"name":"Blog List","type":4,"id":31,"data":[{"value":"\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/0d6052d5b67ed4cf043752f110f3e66e","id":170,"name":"Social Media Thumbnail"},{"value":"machine-learning-a-journey-towards-general-purpose-algorithms","id":43,"name":"slug"},{"value":"Machine Learning: A Journey Towards General-Purpose Algorithms","id":33,"name":"Post Title"},{"value":"BY BRANNON DORSEY","id":41,"name":"written by"},{"value":"1","id":34,"name":"Published"},{"value":"01\/16\/2017","id":35,"name":"Create on"},{"value":"","id":37,"name":"Post Start"},{"value":"","id":38,"name":"Post End"},{"value":"Something radical is happening right now with Artificial Intelligence. It appears that we may now be on the verge of an unprecedented paradigm shift in how we think about and employ computers. For decades, we\u0026rsquo;ve been writing programs in the form of line-by-line instructions. We are now beginning to move away from these limitations, instead teaching machines to learn on their own.\r\n","id":39,"name":"Summary"},{"value":"\u003Cbb-p\u003E Something radical is happening right now with Artificial Intelligence. It appears that we may now be on the verge of an unprecedented paradigm shift in how we think about and employ computers. For decades, we\u0026rsquo;ve been writing programs in the form of line-by-line instructions. We are now beginning to move away from these limitations, instead teaching machines to learn on their own. \u003C\/bb-p\u003E\r\n\u003Cbb-p\u003E This shift is largely happening in a field known as Machine Learning, and here at Branger_Briz, we are excited to be a part of this radical moment in human discovery. Over the coming weeks and months, we will be reading research papers, experimenting with state-of-the-art algorithms and code implementations, and participating in shaping this new wave of Artificial Intelligence research through a lense of creative production. As excited as we are about the present and upcoming Machine Learning revolution, we also \u003Cbb-quote\u003E Machines are beginning to see, hear, and understand the world around them in ways and volumes that humans simply can\u0026rsquo;t \u003C\/bb-quote\u003E believe that the radical disruption that it may bring has the potential to further a dangerously widening digital literacy divide. We intend to combat this divide by sharing the research and projects that we create in a way that is democratized and accessible. This blog post is an introduction to the current state of Machine Learning and our engagements with it. More posts on the implications of an AI overhaul will soon follow. \u003C\/bb-p\u003E \u003Cbb-p\u003E Recent advances in the field of Machine Learning, specifically in the field of Deep Learning, have continued to achieve human (and superhuman) performance at the most complex of tasks at an increasingly accelerating rate. Since the advent of the modern electronic computing machine during the early 20th century, we\u0026rsquo;ve seen the growth and application of computers into nearly every domain of human life. In nearly 75 years, we\u0026rsquo;ve transformed the state-of-the-art electronic computer from a specialized institutional instrument into a general-purpose handheld device that over two billion \u003Cbb-note info=\u0027\u003Ca href=\u0022https:\/\/www.statista.com\/statistics\/330695\/number-of-smartphone-users-worldwide\/\u0022 target=\u0022_blank\u0022\u003E\r\n\t\t\t\t\t\t\t\tAn expected 2.1 billion people\r\n\t\t\t\t\t\t\t   \u003C\/a\u003E own smartphones in 2016. \r\n\t\t\t\t\t\t\t   \u003Ca href=\u0022https:\/\/techcrunch.com\/2015\/06\/02\/6-1b-smartphone-users-globally-by-2020-overtaking-basic-fixed-phone-subscriptions\/\u0022 target=\u0022_blank\u0022\u003E\r\n\t\t\t\t\t\t\t\tSome sources \r\n\t\t\t\t\t\t\t   \u003C\/a\u003E claim this number may rise to as much as 6.1 billion by 2020.\u0027\u003E\u003C\/bb-note\u003E of the world\u0026rsquo;s population carry on their person at all times. With perhaps humanity\u0026rsquo;s greatest collaborative achievement we\u0026rsquo;ve created a global communications network for these devices to instantaneously communicate with each other, and on top of this network, us with one another. By linking nearly half \u003Cbb-note info=\u0027An \u003Ca href=\u0022http:\/\/www.itu.int\/net\/pressoffice\/press_releases\/2015\/17.aspx#.WFmrIdH7m1J\u0022 target=\u0022_blank\u0022\u003EITU 2015 report\u003C\/a\u003E suggests that 3.2 billion people worldwide have internet access, up from a mere 738 million in 2000.\u0027\u003E\u003C\/bb-note\u003E of the World\u0026rsquo;s population the Internet has amplified and extended the human voice. \u003C\/bb-p\u003E \u003Cbb-media caption\u003E \u003Cimg alt=\u0022Glen Beck and Betty Holberton programming the ENIAC computer in Philadelphia, Pennsylvania (1940s\/1950s). Source: Wikimedia Commons\u0022 src=\u0022http:\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/07d5b15ee9e81c4354896825818a0eb2\u0022 \/\u003E \u003C\/bb-media\u003E \u003Cbb-p\u003E Decades of achievement in this regard have been built on top of centuries of scientific research to bring us to this contemporary technological epoch. Nonetheless, the programming of the machines that drive today\u0026#39;s world has remained, for the most part, fundamentally unchanged from the rule-based heuristic approaches of writing hand-authored software from the years of punch cards and room-sized computers. Until recently. \u003C\/bb-p\u003E \u003Cbb-quote\u003ENeural networks are becoming increasingly able to synthesize sequential patterns like text, speech, and even music.\u003C\/bb-quote\u003E \u003Cbb-p\u003E Machine Learning, is a type of AI focused specifically on developing algorithms and systems that allow machines to learn rather than being explicitly told how to function via a set of programmed instructions. While the field has been around since the mid-1960\u0026rsquo;s, its true potential is only now beginning to be fully exploited. \u003Cbb-note info=\u0027Many believe that recent advancements in parallel compute power (specifically GPUs), as well as the overwhelming amount of data that has been generated as a result of widespread internet access and usage, can help explain the recent success of Deep Learning.\u0027\u003E\u003C\/bb-note\u003E In the past 3 years specifically, we\u0026rsquo;ve seen a series of scientific breakthroughs in the use of Deep Learning \u0026mdash; a branch of Machine Learning that uses multiple stacked layers of processing units, often called artificial neural networks (ANN) \u003Cbb-note info=\u0027These units, to the disdain of many in the scientific community, are often referred to as neurons in an ANN. Deep Learning is loosely inspired by some of the cognitive processes that occur in the brains of humans and other animals. The analogy compares the information abstraction potential of processing units and weight multipliers in an ANN with the neurons and synapses in the brain of an animal. Many cognitive scientists reject this comparison because it represents an oversimplification of two disparate and poorly understood systems.\u0027\u003E\u003C\/bb-note\u003E, to form increasingly abstract representations of information and understanding. These neural networks are now solving problems that were expected to be decades away if solvable at all. \u003C\/bb-p\u003E \u003Cbb-p\u003E What makes this rise in Deep Learning so exciting is that it represents a shift away from rule-based programming, a tedious process whereby human programmers provide explicit instructions to be carried out by a machine, and instead towards a sort of general-purpose algorithm, the neural networks. Let that sink in for a second\u0026hellip; Traditionally, if a programmer wanted to implement a face detection algorithm for automatic shutter release built into the proprietary firmware of a digital camera, they would have to spend months researching state-of-the-art computer vision and object detection algorithms, or at least consult a specialist in the field. The programmer would then implement the formulas that they have learned through that process in code. If that same programmer were then asked to implement speech recognition for that same camera so that images could be captured via voice commands, they would need to repeat the tedious process of acquiring adequate understanding of proven algorithms in the domain of audio processing and computational linguistics. With Machine Learning, given enough quality example data, the same neural network algorithm, or at least a suite of similar network models, can be trained to solve both face detection and speech recognition problems. Moreover, the programmer need not know anything about applied research in either domain so long as they can train the neural network on enough photos with tagged faces and examples of people saying the desired voice command. \u003C\/bb-p\u003E \u003Cbb-quote\u003EWith Machine Learning, the same algorithm can be trained to solve both face detection and speech recognition problems.\u003C\/bb-quote\u003E \u003Cbb-p\u003E Through recent advancements in Deep Learning, machines are beginning to see, hear, and understand the world around them in ways and volumes that humans simply can\u0026rsquo;t. Innovations in Convolutional Neural Networks (CNNs) have seen widespread use in batch processing the billions of images that are uploaded to social networks, extracting information that allows them to identify people and contextualize their surroundings to build up a profile of the people that use their services \u003Cbb-note info=\u0027What they do with this information is largely unknown due to the proprietary nature of these large companies, however, it can be assumed that this information is sold to advertisers as well as used extensively in internal research.\u0027\u003E\u003C\/bb-note\u003E. Self-driving cars use video processed through CNNs to make driving decisions in real-time, directly affecting the lives of their passengers as well as others on the road. \u003C\/bb-p\u003E \u003Cbb-media caption\u003E \u003Cimg alt=\u0022Using CNNs, autonomous vehicles can automatically identify pedestrians and objects via image segmentation. Source: Cityscapes dataset project\u0022 src=\u0022http:\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/09145cb36780248452f10faa6bafd833\u0022 style=\u0022height:393px; width:700px\u0022 \/\u003E \u003C\/bb-media\u003E\u003Cbr \/\u003E\r\n \u003Cbr \/\u003E\r\n \u003Cbb-p\u003E Researchers have applied CNNs along with Reinforcement Learning (RL) \u003Cbb-note info=\u0027Reinforcement Learning is a type of unsupervised machine learning where an AI, or agent, learns to interact with an environment, say a game, entirely through trial and error.\u0027\u003E\u003C\/bb-note\u003E to create a general purpose video game Artificial Intelligence model that performs at or exceeds human level in 49 Atari games using only screen pixels as input to the network, a feat that has been heralded by many as a great step towards Artificial General Intelligence (AGI), the holy grail of strong AI \u003Cbb-note info=\u0027Strong AI is a term used to indicate Artificial General Intelligence, a yet unachieved level of machine intelligence that would be capable of, at least, human-level intelligence in all problem domains, and likely far more. Strong AI is in contrast to Weak AI, or \u0022applied AI\u0022, which is a category that includes all artificially intelligent systems we have at present, including neural networks.\u0027\u003E\u003C\/bb-note\u003E. Recent implementations of Recurrent Neural Networks (RNNs), particularly those using Long Short Term Memory (LSTM) processing units as \u0026quot;neurons\u0026quot; are becoming increasingly able to synthesize sequential patterns like text, speech, and even music. Towards this end, perhaps one of the most promising advancements in Machine Learning over the past few years are Generative Adversarial Networks (GANs). GANs, are sophisticated generative models that are able to generate stunningly accurate synthesized images of objects, people, and places among other things. Research into GANs is very new and the results are already overwhelmingly promising. \u003C\/bb-p\u003E \u003Cbb-media caption\u003E \u003Cimg alt=\u0022Example of five bird images generated by a GAN using text descriptions only. Source: https:\/\/arxiv.org\/pdf\/1612.03242v1.pdf\u0022 src=\u0022http:\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/6096b5e9989c32527de6e1f6e1ac4263\u0022 \/\u003E \u003C\/bb-media\u003E \u003Cbb-p\u003E \u003Cimg src=\u0022http:\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/0c8c07be75220944ee4406225c2fe1c1\u0022 \/\u003E At Branger_Briz, We\u0026rsquo;ve already begun experimenting with some of the most interesting findings of the past year and will soon share our findings in detail on this blog. So far, we\u0026rsquo;ve explored using Machine Learning to auto-generate electronic circuit board schematics, employ new image-to-image translation techniques to video resulting in mapping the structure and gestures of recorded footage of one person to the body of another, and most recently, infer depth-information from monocular two-dimensional images. And we are just getting started. All of this research will soon be expounded and shared in full here on this blog and will be increasingly present in the projects that we produce. We are excited to be taking this next step and are glad to have you along for the ride. More soon! \u003C\/bb-p\u003E \u003Cbb-media caption\u003E \u003Cimg alt=\u0022A generated circuit board schematic from our initial experiments using Machine Learning to create .sch files.\u0022 src=\u0022http:\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/3a648518b7cd0be146b454076ff0c81f\u0022 \/\u003E \u003C\/bb-media\u003E","id":40,"name":"Description"},{"value":"","id":169,"name":"Tweet Link"},{"value":"[\u0022machine learning\u0022,\u0022AI\u0022,\u0022algorithms\u0022]","id":177,"name":"Tags"}]},{"name":"Blog List","type":4,"id":32,"data":[{"value":"\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/0d6052d5b67ed4cf043752f110f3e66e","id":170,"name":"Social Media Thumbnail"},{"value":"using-machine-learning-to-create-new-melodies","id":43,"name":"slug"},{"value":"Using Machine Learning to Create New Melodies","id":33,"name":"Post Title"},{"value":"BY BRANNON DORSEY","id":41,"name":"written by"},{"value":"1","id":34,"name":"Published"},{"value":"05\/10\/2017","id":35,"name":"Create on"},{"value":"05\/10\/2017","id":37,"name":"Post Start"},{"value":"","id":38,"name":"Post End"},{"value":"Music is storytelling. Melodies are memories. We create them from the musical experiences, conscious and unconscious, that we are exposed to throughout our lifetimes. Passed down through time in a kind of oral tradition, the music that we make today carries with it embeddings of the culture and people of times long past.\r\n","id":39,"name":"Summary"},{"value":"\u003Cbb-p\u003E Music is storytelling. Melodies are memories. We create them from the musical experiences, conscious and unconscious, that we are exposed to throughout our lifetimes. Passed down through time in a kind of oral tradition, the music that we make today carries with it embeddings of the culture and people of times long past. Musical motifs are not the product of an individual artist, but rather a reinterpretation of the musical ideas that have been presented to them, for them to reinterpret and pass along to others. In this way, writing music can be thought of as less of a process of authorship and instead a practice of remix. \u003C\/bb-p\u003E\r\n \r\n \u003Cbb-quote\u003EWe\u0026rsquo;ve been working with algorithms that can learn from hundreds of thousands of past songs, and use this learned knowledge to synthesize new music\u003C\/bb-quote\u003E\r\n \r\n \u003Cbb-p\u003E At Branger_Briz, we\u0026rsquo;ve recently been experimenting with these ideas of remix and new ways of approaching authorship through the lens of machine learning using memory networks. We\u0026rsquo;ve been working with algorithms that can learn from hundreds of thousands of past songs, and use this learned knowledge to synthesize new music. Inspired by recent works in the field of machine learning, especially projects like \u003Ca href=\u0022https:\/\/magenta.tensorflow.org\/\u0022 target=\u0022_blank\u0022\u003EMagenta\u003C\/a\u003E that seek to include the involvement of artists and musicians, we\u0026rsquo;ve created our first algorithm that can learn to create music by example. You can listen to a short sample from it below.\u003C\/bb-p\u003E\r\n \r\n \u003Cbb-div\u003E\r\n\t\u003Caudio controls\u003E\r\n\t\t  \u003Csource src=\u0022http:\/\/cms.brangerbriz.com\/img\/assetsFile\/files\/19903a30302683247fd7bd7df8bdbda5\u0022 type=\u0022audio\/mpeg\u0022\u003E\r\n\t\t  \u003Csource src=\u0022http:\/\/cms.brangerbriz.com\/img\/assetsFile\/files\/b0589984716e95428d575f4eb0b136a4\u0022 type=\u0022audio\/wav\u0022\u003E\r\n\t\t  Your browser does not support audio.\r\n\t\u003C\/audio\u003E \r\n\u003C\/bb-div\u003E\r\n\r\n\u003Cbb-p\u003E\r\n\u003Cbb-quote\u003EWe\u0026#39;ve created a tool that others can use and learn from\u003C\/bb-quote\u003E \u003Ca href=\u0022https:\/\/github.com\/brangerbriz\/midi-rnn\u0022 target=\u0022_blank\u0022\u003EMidi-rnn\u003C\/a\u003E is a tool we\u0026rsquo;ve created that allows you to generate monophonic melodies with machine learning using a basic LSTM RNN, a model architecture designed to work with sequences. Inspired by the Magenta project\u0026rsquo;s \u003Ca href=\u0022https:\/\/magenta.tensorflow.org\/blog\/2016\/06\/10\/recurrent-neural-network-generation-tutorial\/\u0022 target=\u0022_blank\u0022\u003Efirst model\u003C\/a\u003E, we decided to create midi-rnn from scratch using \u003Ca href=\u0022https:\/\/keras.io\/\u0022 target=\u0022_blank\u0022\u003EKeras\u003C\/a\u003E, with the goal of having a baseline music-generation model to compare the rest of our ongoing research against. Going through these motions has been incredibly helpful for us as we explore the landscapes of computer music, machine learning, and scientific computing in general. Additionally, we\u0026rsquo;ve now created a tool that others can use and learn from.\u003C\/bb-p\u003E\r\n \r\n \u003Cbb-p\u003E Of the many machine learning techniques that could be applied to music generation with MIDI, midi-rnn approaches the task in a relatively simple and naive way.\u003Cbb-note info=\u0022Midi-rnn is just a starting point. We\u0027ve already begun developing more powerful models that we hope to share soon.\u0022\u003E\u003C\/bb-note\u003E Like much of the research and prior work that precedes it, midi-rnn excels at learning to (re)produce succinct melodic bits that are of interest, but fails to create music with overarching or consistent long-form structure.\u003C\/bb-p\u003E\r\n \r\n \u003Cbb-p\u003E Midi-rnn is an implementation of a Recurrent Neural Network (RNN) that uses Long-Short Term Memory (LSTM) units. RNNs architectures have been proven to work very well at learning to model sequential data. Their popularity and use has risen greatly since Andrej Karpathy\u0026rsquo;s blog post entitled \u0026quot;\u003Ca href=\u0022https:\/\/karpathy.github.io\/2015\/05\/21\/rnn-effectiveness\/\u0022 target=\u0022_blank\u0022\u003EThe Unreasonable Effectiveness of Recurrent Neural Networks\u003C\/a\u003E\u0026quot; in the summer of 2015. In this post, Karpathy provides source code for a model he titles \u003Ca href=\u0022https:\/\/github.com\/karpathy\/char-rnn\u0022 target=\u0022_blank\u0022\u003Echar-rnn\u003C\/a\u003E, which learns to represent text at a character-level by example. Midi-rnn is an almost identical model\/algorithm to char-rnn, only it uses MIDI data as input and output instead of text characters.\u003C\/bb-p\u003E\r\n \u003Cbr\u003E\u003Cbr\u003E\r\n \u003Cbb-media\u003E \r\n \u003Cimg src=\u0022http:\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/6b6553c22d7175638cb0c314908a3743\u0022 \/\u003E\r\n \u003C\/bb-media\u003E\r\n \r\n \u003Cbb-p\u003E At a high level, our machine learning pipeline can be thought of as process that takes a folder of MIDI files, trains an RNN model using those MIDI, and then later uses that model to generate an arbitrary number of new MIDI files.\u003C\/bb-p\u003E\r\n \r\n \u003Cbb-p\u003E The section that follows is a somewhat technical breakdown of how Midi-rnn works. If you would prefer to get started using midi-rnn right away, feel free to \u003Ca href=\u0022#using-midi-rnn\u0022\u003Ejump down\u003C\/a\u003E to the instructions section. We\u0026#39;ve also included some \u003Ca href=\u0022#midi-rnn-example-melodies\u0022\u003Eexample melodies\u003C\/a\u003E that we generated using midi-rnn at the bottom of this post.\u003C\/bb-p\u003E\r\n \r\n \u003Cbb-h2\u003E Midi-rnn Algorithm Breakdown\u003C\/bb-h2\u003E\r\n \r\n \u003Cbb-p\u003E Midi-rnn works like this: You take a folder of MIDI songs that you would like to use to train your model. For each MIDI song, midi-rnn filters out all non-monophonic tracks and discards them. It then breaks down the remaining tracks into a series of fixed-width windows that represent the song as sections of note events of 16th-note durations, including rests. Each window, \u003Ccode\u003EX\u003C\/code\u003E, contains \u003Ccode\u003En\u003C\/code\u003E such events where \u003Ccode\u003En\u003C\/code\u003E is the window size. The below image uses a window size of 10 (\u003Ccode\u003En = 10\u003C\/code\u003E). Each collection of events \u003Ccode\u003EX\u003C\/code\u003E is paired with the value of the event at \u003Ccode\u003En + 1\u003C\/code\u003E, which we call \u003Ccode\u003Ey\u003C\/code\u003E. The value of \u003Ccode\u003Ey\u003C\/code\u003E is the note that follows the fixed-width note sequence \u003Ccode\u003EX\u003C\/code\u003E in the MIDI track. We slide our window across each of our MIDI tracks collecting \u003Ccode\u003EX, y\u003C\/code\u003E pairs to create our data set.\u003Cbb-note info=\u0022This is a similar process to prepairing a dataset for an \u003Ca href=\u0027https:\/\/en.wikipedia.org\/wiki\/N-gram\u0027 target=\u0027_blank\u0027\u003En-gram\u003C\/a\u003E model in the domain of natural language processing and computational linguistics.\u0022\u003E\u003C\/bb-note\u003E Each \u003Ccode\u003Ey\u003C\/code\u003E is used as our training label for the sequence of notes \u003Ccode\u003EX\u003C\/code\u003E in our \u003Ca href=\u0022https:\/\/en.wikipedia.org\/wiki\/Supervised_learning\u0022 target=\u0022_blank\u0022\u003Esupervised learning task\u003C\/a\u003E.\u003Cbb-note info=\u0022Although it may not seem obvious at first, this task is supervised independent of wether or not a human was involved in the labeling of the dataset. Using a sliding window to collect note event data from MIDI files is an effect way to have the data label itself.\u0022\u003E\u003C\/bb-note\u003E\u003C\/bb-p\u003E\r\n \r\n \u003Cbb-media caption\u003E\u003Cimg alt=\u0022We create a dataset of one-hot encoded X, y pairs by moving a fixed-length sliding window across a collection of MIDI files.\u0022 src=\u0022http:\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/d7137f62cbeafcdc550298d39ed6c585\u0022 \/\u003E\u003C\/bb-media\u003E\r\n \u003Cbr\u003E\u003Cbr\u003E\r\n \u003Cbb-p\u003E MIDI is a standard representation for recording and storing information about musical events. It symbolizes all (Western) musical notes C-2 - G8, as one of 128 values (0-127). In order to use this data as input to midi-rnn, we transform each note from this integer format into an encoding known as \u0026quot;one-hot\u0026quot; encoding before feeding it into our model for training. One-hot encoding represents categorical data as a binary representation with a \u0026quot;bit-depth\u0026quot; equal to the number of classes, in our case 129, where all bit values are set to zero except for the index of the category being represented by the encoding, which is set to one. Representing data in this way ensures that our model doesn\u0026rsquo;t mistakenly learn that the arbitrarily assigned magnitude of a MIDI note value carries meaning. MIDI note 120 in is not greater than MIDI note 20, both are used simply categorical labels.\u003C\/bb-p\u003E\r\n \r\n \u003Cbb-p\u003E Before we train our model we must first split our collection of one-hot encoded \u003Ccode\u003EX, y\u003C\/code\u003E pairs into two groups, the training set and the validation set. The training set is used to train our model, while the validation data is held out and used to evaluate our model\u0026rsquo;s performance on data that it has never seen before.\u003Cbb-note info=\u0022Many machine learning pipelines necessitate that the data is split into three groups: train\/validate\/test. For simplicity, we\u0027ve abbreviated this split to two groups. You can think of validate\/test as synonymous in our example, but in practice it is better to use a three way split.\u0022\u003E\u003C\/bb-note\u003E We use our training data to update and continually improve our model, however, when we show our model the validation data, we do not update the model. Instead, we simply see how well it performs at predicting the next note in each sequence from our validation set to better understand how well the model is learning to generalize the patterns that it is extracting from the training data. How much data you hold out for validation depends on the size and quality of your training data, but an 80%\/20% training\/validation is generally a good split to start with.\u003C\/bb-p\u003E\r\n \r\n \u003Cbb-p\u003E Our RNN is a network made up one input layer with \u003Ccode\u003Elength(X) * length(X1)\u003C\/code\u003E units (neurons), one or more hidden layers with an arbitrary number of units, and one output layer with \u003Ccode\u003Elength(X1)\u003C\/code\u003E units. \u003Ccode\u003Elength(X)\u003C\/code\u003E is the value of our window size (\u003Ccode\u003En\u003C\/code\u003E), say 10, which is the number of previous notes we will feed into our model at each timestep in order to predict the next note. \u003Ccode\u003Elength(X1)\u003C\/code\u003E is the number of categorical classes we are representing, or the \u0026quot;bit-depth\u0026quot; of our one-hot encoding, which is 129 in our case (0-127 + 1 for rest events).\u003C\/bb-p\u003E\r\n \u003Cbb-p\u003E Our model is trained by iteratively feeding it input data \u003Ccode\u003EX\u003C\/code\u003E and computing the result of the output layer through a process of matrix multiplications, summations, and non-linear activation functions.\u003Cbb-note info=\u0022For brevity, we will not expound on this here. You can learn more about the standard feed-forward neural network \u003Ca href=\u0027http:\/\/www.deeplearningbook.org\/contents\/mlp.html\u0027 target=\u0027_blank\u0027\u003Ehere.\u003C\/a\u003E\u0022\u003E\u003C\/bb-note\u003E We pass the values of the output layer over a softmax function \u003Cbb-note info=\u0022The \u003Ca href=\u0027https:\/\/en.wikipedia.org\/wiki\/Softmax_function\u0027 target=\u0027_blank\u0027\u003Esoftmax function\u003C\/a\u003E squashes \u003Ccode\u003Ek\u003C\/code\u003E real-valued numbers to the range (0, 1) where the sum of \u003Ccode\u003Esoftmax(k) = 1\u003C\/code\u003E.\u0022\u003E\u003C\/bb-note\u003E resulting in a probability distribution that gives us the likelihood of each categorical class (0-128) being the next event in the event sequence that was provided as input \u003Ccode\u003EX\u003C\/code\u003E. Because we have labels \u003Ccode\u003Ey\u003C\/code\u003E, we know what the true next event value is, so we can compare our model\u0026rsquo;s prediction with the true event category from our MIDI sequence. Because we have a probability distribution as output, we can quantify how correct\/incorrect our model\u0026rsquo;s prediction is at each training step, and update our model to minimize our prediction error. In practice we feed our model batches of multiple \u003Ccode\u003EX, y\u003C\/code\u003E training pairs before updating it by backpropagating the sum of our error across the batch through the network. This method of optimization is called Mini-batch Stochastic Gradient Descent (SGD). SGD, and its many variants, are the optimization algorithms used for most modern deep processes.\u003C\/bb-p\u003E\r\n \r\n \u003Cbb-p\u003E \u003Cbb-quote\u003EOnce we\u0026rsquo;ve trained our model we freeze it and use it to generate new melodies\u003C\/bb-quote\u003E Once we\u0026rsquo;ve trained our model by iteratively applying our training process until our error values stop decreasing, we freeze our model and use it to generate new melodies! During generation, we can\u0026rsquo;t use existing values for all inputs \u003Ccode\u003EX\u003C\/code\u003E, because the song we are creating doesn\u0026rsquo;t exist yet. We solve this using a clever method that incorporates the output of the model from one timestep as a component as part of the input to the next timestep. We begin generation by feeding our model a single window \u003Ccode\u003EX\u003C\/code\u003E from an existing piece of music. This initial input is called the seed, or sometimes prime, and it is used to get our sequence generation process started. The first note event category predicted as the output of the first step of our model during generation is added to the input sequence \u003Ccode\u003EX\u003C\/code\u003E, and the first note event category in \u0026lt;\u003Ccode\u003EX\u003C\/code\u003E is removed. Given a window size of 10, the first 9 notes now belong to our seed, and the most recent note was generated by our model. This \u0026lt;\u003Ccode\u003EX\u003C\/code\u003E sequence is now fed back into the model for time step two, after which the first value in the input sequence \u003Ccode\u003EX\u003C\/code\u003E is removed and the predicted note is appended to \u003Ccode\u003EX\u003C\/code\u003E like last time. After 10 steps, our input sequence \u003Ccode\u003EX\u003C\/code\u003E is comprised entirely of note event categories generated by our model. The model can now run indefinitely using its own note event predictions as the input sequence to generate new melodies in this way.\u003C\/bb-p\u003E\r\n \r\n \u003Cbb-h2 id=\u0022using-midi-run\u0022\u003EUsing Midi-rnn\u003C\/bb-h2\u003E\r\n \r\n \u003Cbb-p\u003E You can use midi-rnn to generate your own new melodies! The following content assumes basic understanding of command line\/terminal usage and a MacOS or linux operating system. For more information about installing and using midi-rnn see the \u003Ca href=\u0022https:\/\/github.com\/brangerbriz\/midi-rnn\u0022 target=\u0022_blank\u0022\u003EGitHub repository\u003C\/a\u003E.\u003C\/bb-p\u003E\r\n \r\n \u003Cbb-code language=\u0022bash\u0022\u003E \r\n # open a terminal and clone the midi-rnn repo \r\n git clone https:\/\/github.com\/brannondorsey\/midi-rnn.git \r\n\r\n # navigate into the cloned directory \r\ncd midi-rnn \r\n\r\n # Install the dependencies. You may need to prepend sudo to \r\n # this command if you get an error \r\npip install requirements.txt\r\n \u003C\/bb-code\u003E\r\n \r\n \u003Cbb-p\u003EOnce you\u0026rsquo;ve installed midi-rnn and its necessary dependencies you can train a model using the sample midi tracks included with the repository.\u003C\/bb-p\u003E\r\n \u003Cbb-code language=\u0022bash\u0022\u003E \r\n python train.py --data_dir data\/midi\r\n \u003C\/bb-code\u003E\r\n \u003Cbb-p\u003E After a brief moment, you should see continuous output that looks like this:\u003C\/bb-p\u003E\r\n \u003Cbb-code language=\u0022bash\u0022\u003E \r\n 1\/154000 (epoch 0), train_loss = 3.759, time\/batch = 0.117 2\/154000 (epoch 0), train_loss = 3.203, time\/batch = 0.118 3\/154000 (epoch 0), train_loss = 3.000, time\/batch = 0.115 4\/154000 (epoch 0), train_loss = 2.951, time\/batch = 0.116 5\/154000 (epoch 0), train_loss = 2.892, time\/batch = 0.118 6\/154000 (epoch 0), train_loss = 2.876, time\/batch = 0.118 7\/154000 (epoch 0), train_loss = 2.836, time\/batch = 0.118 8\/154000 (epoch 0), train_loss = 2.859, time\/batch = 0.117 9\/154000 (epoch 0), train_loss = 2.829, time\/batch = 0.117\r\n \u003C\/bb-code\u003E\r\n \u003Cbb-p\u003E You can use \u003Ca href=\u0022https:\/\/www.tensorflow.org\/get_started\/summaries_and_tensorboard\u0022 target=\u0022_blank\u0022\u003ETensorboard\u003C\/a\u003E to view your training error over time. In another terminal opened to the midi-rnn directory run the following:\u003C\/bb-p\u003E\r\n \u003Cbb-code language=\u0022bash\u0022\u003E \r\n tensorboard --logdir experiments\/\r\n \u003C\/bb-code\u003E\r\n \u003Cbb-p\u003E Navigate your web browser to \u003Ca href=\u0022http:\/\/localhost:6006\u0022 target=\u0022_blank\u0022\u003Ehttp:\/\/localhost:6006\u003C\/a\u003E to view your models training error in real time. Once you see that it has converged, or plateaued, your model likely won\u0026rsquo;t improve and can actually get worse (this is called overfitting). You can stop the training pressing CTRL+C from the terminal window that is running the training process. You are now ready to generate new MIDI tracks using \u003Ccode\u003Esample.py\u003C\/code\u003E.\u003C\/bb-p\u003E\r\n \r\n \t\t\t\u003Cbb-code language=\u0022bash\u0022\u003E\r\npython sample.py --data_dir data\/midi --experiment_dir experiments\/01\r\n\t\t\t\u003C\/bb-code\u003E\r\n\r\n\t\t\t\u003Cbb-p\u003E\r\n\t\t\t\tBy default, this creates 10 MIDI files using and saves them to to \u003Ccode\u003Eexperiments\/01\/generated\u003C\/code\u003E.\r\n\t\t\t\u003C\/bb-p\u003E\r\n\r\n\t\t\t\u003Cbb-p\u003E\r\n\t\t\t\tOnce you’ve gone through the motions of training your model on the stock midi files, head over to the midi-rnn project \u003Ca href=\u0022https:\/\/github.com\/brangerbriz\/midi-rnn\u0022 target=\u0022_blank\u0022\u003EREADME\u003C\/a\u003E for more info about supported command-line arguments and custom training parameters. \u003Cbb-note info=\u0022I recently gave a \u003Ca href=\u0027https:\/\/github.com\/brannondorsey\/ml4music-workshop\u0027 target=\u0027_blank\u0027\u003E\u003Ci\u003EMachine Learning for Music\u003C\/i\u003E workshop\u003C\/a\u003E at the School of the Art Institute of Chicago. If you found this interesting, you may also want to check out the materials from that workshop. We cover midi-rnn, plus lyric generation with char-rnn and raw audio generation with WaveNet.\u0022\u003E\u003C\/bb-note\u003E\r\n\t\t\t\u003C\/bb-p\u003E\r\n\r\n\t\t\t\u003Cbb-h2 id=\u0022midi-rnn-example-melodies\u0022\u003EMidi-rnn Example Melodies\u003C\/bb-h2\u003E\r\n\r\n\t\t\t\u003Cbb-p\u003E\r\n\t\t\t\tBelow you will find some select audio snippets that we pulled from melodies generated using midi-rnn. All files were trained using the same ~100 MIDI files from the Lakh MIDI Dataset.\r\n\t\t\t\u003C\/bb-p\u003E\r\n\r\n\t\t\t\u003Cbb-div\u003E\r\n\t\t\t\t\u003Caudio controls\u003E\r\n\t\t\t\t\t  \u003Csource src=\u0022http:\/\/cms.brangerbriz.com\/img\/assetsFile\/files\/d801d3c4d9991eedc477b95a3e4beba7\u0022 type=\u0022audio\/mpeg\u0022\u003E\r\n\t\t\t\t\t  \u003Csource src=\u0022http:\/\/cms.brangerbriz.com\/img\/assetsFile\/files\/d09ac95ac6bcab03e860d0e1b337e4a9\u0022 type=\u0022audio\/wav\u0022\u003E\r\n\t\t\t\t\t  Your browser does not support audio.\r\n\t\t\t\t\u003C\/audio\u003E \r\n\t\t\t\t\u003Caudio controls\u003E\r\n\t\t\t\t\t  \u003Csource src=\u0022http:\/\/cms.brangerbriz.com\/img\/assetsFile\/files\/63c78e6fe6489f73d6dc1ed8336c00b0\u0022 type=\u0022audio\/mpeg\u0022\u003E\r\n\t\t\t\t\t  \u003Csource src=\u0022http:\/\/cms.brangerbriz.com\/img\/assetsFile\/files\/d772319a7eccd9efb041514d5d64ab56\u0022 type=\u0022audio\/wav\u0022\u003E\r\n\t\t\t\t\t  Your browser does not support audio.\r\n\t\t\t\t\u003C\/audio\u003E \r\n\t\t\t\t\u003Caudio controls\u003E\r\n\t\t\t\t\t  \u003Csource src=\u0022http:\/\/cms.brangerbriz.com\/img\/assetsFile\/files\/1e8080fbf77b8ed59cc43ed831e7a5da\u0022 type=\u0022audio\/mpeg\u0022\u003E\r\n\t\t\t\t\t  \u003Csource src=\u0022http:\/\/cms.brangerbriz.com\/img\/assetsFile\/files\/c621bb7700996342ec7096e51c1204c4\u0022 type=\u0022audio\/wav\u0022\u003E\r\n\t\t\t\t\t  Your browser does not support audio.\r\n\t\t\t\t\u003C\/audio\u003E \r\n\t\t\t\t\u003Caudio controls\u003E\r\n\t\t\t\t\t  \u003Csource src=\u0022http:\/\/cms.brangerbriz.com\/img\/assetsFile\/files\/4e36e27a98511e042bfac5f2de8d0025\u0022 type=\u0022audio\/mpeg\u0022\u003E\r\n\t\t\t\t\t  \u003Csource src=\u0022http:\/\/cms.brangerbriz.com\/img\/assetsFile\/files\/9576f702d8a178059d484a2bc12c7c3c\u0022 type=\u0022audio\/wav\u0022\u003E\r\n\t\t\t\t\t  Your browser does not support audio.\r\n\t\t\t\t\u003C\/audio\u003E \r\n\t\t\t\t\u003Caudio controls\u003E\r\n\t\t\t\t\t  \u003Csource src=\u0022http:\/\/cms.brangerbriz.com\/img\/assetsFile\/files\/ca9d8bc5641e86f175d1e46b27868d49\u0022 type=\u0022audio\/mpeg\u0022\u003E\r\n\t\t\t\t\t  \u003Csource src=\u0022http:\/\/cms.brangerbriz.com\/img\/assetsFile\/files\/5957158212b31f2928e75b56718a13a9\u0022 type=\u0022audio\/wav\u0022\u003E\r\n\t\t\t\t\t  Your browser does not support audio.\r\n\t\t\t\t\u003C\/audio\u003E \r\n\t\t\t\t\t\u003Caudio controls\u003E\r\n\t\t\t\t\t  \u003Csource src=\u0022http:\/\/cms.brangerbriz.com\/img\/assetsFile\/files\/bfad7cef0d49f97649b40cadae78a870\u0022 type=\u0022audio\/mpeg\u0022\u003E\r\n\t\t\t\t\t  \u003Csource src=\u0022http:\/\/cms.brangerbriz.com\/img\/assetsFile\/files\/7a2c755f332e0a72d3f1f7e5c78b9f1e\u0022 type=\u0022audio\/wav\u0022\u003E\r\n\t\t\t\t\t  Your browser does not support audio.\r\n\t\t\t\t\u003C\/audio\u003E \r\n\t\t\t\t\u003Caudio controls\u003E\r\n\t\t\t\t\t  \u003Csource src=\u0022http:\/\/cms.brangerbriz.com\/img\/assetsFile\/files\/df821e727392c713166fa8ab5851430b\u0022 type=\u0022audio\/mpeg\u0022\u003E\r\n\t\t\t\t\t  \u003Csource src=\u0022http:\/\/cms.brangerbriz.com\/img\/assetsFile\/files\/6b9a24b387d62c7490836387429af735\u0022 type=\u0022audio\/wav\u0022\u003E\r\n\t\t\t\t\t  Your browser does not support audio.\r\n\t\t\t\t\u003C\/audio\u003E  \r\n\t\t\t\t\t\u003Caudio controls\u003E\r\n\t\t\t\t\t  \u003Csource src=\u0022http:\/\/cms.brangerbriz.com\/img\/assetsFile\/files\/afb27d6980eb6538ea90e11df4fe5969\u0022 type=\u0022audio\/mpeg\u0022\u003E\r\n\t\t\t\t\t  \u003Csource src=\u0022http:\/\/cms.brangerbriz.com\/img\/assetsFile\/files\/f003211d7223185478c7f185ffe71cd1\u0022 type=\u0022audio\/wav\u0022\u003E\r\n\t\t\t\t\t  Your browser does not support audio.\r\n\t\t\t\t\u003C\/audio\u003E \r\n\t\t\t\t\u003Caudio controls\u003E\r\n\t\t\t\t\t  \u003Csource src=\u0022http:\/\/cms.brangerbriz.com\/img\/assetsFile\/files\/d3cf088e43dfea39e22c9b1fec15724e\u0022 type=\u0022audio\/mpeg\u0022\u003E\r\n\t\t\t\t\t  \u003Csource src=\u0022http:\/\/cms.brangerbriz.com\/img\/assetsFile\/files\/cabacfd312e0392ce351ffc581e779f8\u0022 type=\u0022audio\/wav\u0022\u003E\r\n\t\t\t\t\t  Your browser does not support audio.\r\n\t\t\t\t\u003C\/audio\u003E \r\n\t\t\t\u003C\/bb-div\u003E\r\n ","id":40,"name":"Description"},{"value":"https:\/\/twitter.com\/branger_briz\/status\/864816133706321922","id":169,"name":"Tweet Link"},{"value":"[\u0022machine learning\u0022,\u0022AI\u0022,\u0022algorithms\u0022]","id":177,"name":"Tags"}]},{"name":"Blog List","type":4,"id":70,"data":[{"value":"[\u0022privacy\u0022,\u0022hacking\u0022,\u0022data visualization\u0022]","id":177,"name":"Tags"},{"value":"\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/439a027f8890d5cd92ee575d4c4285c7","id":170,"name":"Social Media Thumbnail"},{"value":"notes-from-our-wifi-data-safari","id":43,"name":"slug"},{"value":"Notes From Our WiFi Data Safari","id":33,"name":"Post Title"},{"value":"Brannon Dorsey","id":41,"name":"written by"},{"value":"1","id":34,"name":"Published"},{"value":"01\/30\/2018","id":35,"name":"Create on"},{"value":"01\/30\/2018","id":37,"name":"Post Start"},{"value":"","id":38,"name":"Post End"},{"value":"The Branger_Briz lab recently presented a workshop at the California Museum of Art Thousand Oaks. The goal was to educate a small group about WiFi data collection practices in the wild and offer a window into our research based studio practice. This post serves as a reference for the material that we covered during the workshop so that anyone can follow along from home.","id":39,"name":"Summary"},{"value":"\u003Cbb-p\u003E\r\nIn our \u003Ca href=\u0022https:\/\/brangerbriz.com\/blog\/exploring-our-surrounding-wifi-landscape\u0022\u003Elast blog post\u003C\/a\u003E we shared some documentation from a recent workshop we gave at the California Museum of Art Thousand Oaks. The workshop was a part of a larger art show, \r\n\u003Ci\u003E\u003Ca href=\u0022http:\/\/cmato.org\/strings-data-and-the-self\u0022 target=\u0022_blank\u0022\u003EStrings: Data and the Self\u003C\/a\u003E\u003C\/i\u003E, where we showed our \r\n\u003Ci\u003E\u003Ca href=\u0022http:\/\/probekit.brangerbriz.com\/\u0022 target=\u0022_blank\u0022\u003EProbe Kit\u003C\/a\u003E\u003C\/i\u003E installation. The installation monitors WiFi packets that are emitted from phones and wireless devices in the area illustrating the kinds of information that can be anonymously collected without their owner’s knowledge. The workshop elaborated on these ideas, educating a small group about WiFi data collection practices in the wild. For participants of the workshop, this post serves as a reference for the material that we covered during the workshop. For those of you who wandered here from the far reaches of the Internet, welcome. We hope that you will learn something while you are here, even if you couldn’t make it to the first iteration of the  workshop.\r\n\u003C\/bb-p\u003E\r\n\r\n\u003Cbb-p\u003E\r\nDuring the workshop, participants were lead through an urban environment spotting and collecting wireless signals from nearby personal devices as they traveled. Using \u003Ca href=\u0022https:\/\/github.com\/brangerbriz\/wifi-data-safari\u0022 target=\u0022_blank\u0022\u003Ecustom software\u003C\/a\u003E, they accessed personally identifiable data from strangers and performed targeted network attacks against volunteers, in an attempt to better understand the privacy concerns and exploitation tactics associated with WiFi. Throughout the workshop, we had conversations about information privacy and security, the shortcomings of the WiFi protocol, and the ways that companies, governments, and other malicious actors use personal wireless data.\r\n\u003C\/bb-p\u003E\r\n\r\n\u003Cbb-h2\u003EThe Internet Landscape\u003C\/bb-h2\u003E\r\n\u003Cbb-p\u003E\r\nThe Internet is a complex network of networks, linked together through industrial communications infrastructure. Many players are involved, from router and device manufacturers to Internet Service Provider (ISP), Tier 1 networks, Internet Exchange Points (IXP), trans-oceanic fiber optic cables, and international standards committees. Lots of machines talking to machines and people talking to people. Surprising to some, most of the Internet is connected by fiber optics and copper cable. It’s usually only the last stretch from your home router or a cell tower to your portable device that occurs over WiFi, a wireless radio frequency protocol that occupies the 2.4 GHz and 5 GHz frequency bands of electromagnetic spectrum (alongside other commercial devices like your microwave and garage door openers). It’s this protocol that we focused on  particularly during the workshop. \r\n\u003C\/bb-p\u003E\r\n\r\n\u003Cbb-quote\u003E\r\n[WiFi] was introduced without the security considerations and requirements that are necessary over twenty years later, when everyone walks around with a wireless device on their person.\r\n\u003C\/bb-quote\u003E\r\n\r\n\u003Cbb-p\u003E\r\nThe 802.11 WiFi standard was introduced in 1997, before anyone had a phone that could connect to the Internet. As such, the specification was introduced without the security considerations and requirements that are necessary over twenty years later, when everyone walks around with a wireless device on their person.\r\n\u003C\/bb-p\u003E\r\n\r\n\u003Cbb-media\u003E\r\n\u003Ca href=\u0022https:\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/e89d1194b6ecb7cb92f77bf1e27f763b\u0022 target=\u0022_blank\u0022\u003E\r\n\u003Cimg src=\u0022https:\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/e89d1194b6ecb7cb92f77bf1e27f763b\u0022\u003E\r\n\u003C\/a\u003E\r\n\u003Cdiv id=\u0022caption\u0022 style=\u0022margin-left: 0px;\u0022\u003E\r\nUnited States Electromagnetic Frequency Allocations\r\n\u003C\/div\u003E\r\n\u003C\/bb-media\u003E\r\n\r\n\u003Cbb-h2\u003EProbe Requests and Beacon Frames\u003C\/bb-h2\u003E\r\n\u003Cbb-p\u003E\r\nEver wonder how it is that your phone auto-connects to your home WiFi network automatically without you having to explicitly authenticate your device each time? This occurs through a series of network packet exchanges between your wireless device and your home router, or access point (AP). Specifically, it leverages the use of two related 802.11 packet types, probe requests sent from your device and beacon frames sent from your access point. Probe requests are small packets of information that are emitted from a wireless device when it isn’t connected to an access point. They include two useful pieces of information, 1) the SSID, or network name, of the access point it has previously connected to and 2) the MAC address of the probing device, a unique identifier that can be used as a device fingerprint. Many devices that have WiFi enabled, but aren’t connected to a network, are constantly emitting probe requests hoping that their router will hear them and initialize an auto-connection. That’s useful if you happen to have just entered your home from work, but as we will see, it’s also identifiable information that’s openly projected from your device when you are out and about, nowhere near the router your device is attempting to connect to. In this way, WiFi devices are often constantly advertising your personal network history wherever you go, leaving a fingerprint in the WiFi radio ether for others to pick up and use.\r\n\u003C\/bb-p\u003E\r\n\u003Cbb-p\u003E\r\nBeacon frames serve a similar purpose to probe requests in that they exist to facilitate the authentication of devices to access points. Beacon frames contain the same useful bits of information as probes, only they are sent from access points that are advertising their existence to nearby devices. As soon as your phone sees a beacon frame emitted from the “My Home WiFi” access point, it will initialize a connection to the router. While this is helpful in the genuine case where your device auto connects to a known network, it also makes it trivial for an attacker to force a connection from your device to a malicious network by simply naming their network the same as your home network. This makes probe requests and beacon frames a lethal combination. One advertises the name of previously connected networks at all times, while the other can be used to auto-connect devices knowing only the names of previously connected networks.\r\n\u003C\/bb-p\u003E\r\n\r\n\u003Cbb-h2\u003EAccessing Network Data\u003C\/bb-h2\u003E\r\n\u003Cbb-p\u003E\r\nNow that you’ve learned that the network devices around you regularly broadcast probe requests, you might be wondering how you would go about accessing that data. You’re privy to seeing a list of network names on your phone or laptop (populated by the beacon frames) when you are looking to connect to a new network, but you likely haven’t ever been able to access the other packets of data hidden from normal view. You can’t see activity from other people’s devices using that familiar network drop down and you certainly can’t get list of other people’s connection histories. Instead, your operating system filters out this data, exposing only the information necessary for you to connect to a WiFi network.\r\n\u003C\/bb-p\u003E\r\n\u003Cbb-p\u003E\r\nWell, it turns out that many consumer WiFi cards support a special behavior called monitor mode that effectively removes this filter. Monitor mode allows your computer to passively eavesdrop on the unencrypted radio packets broadcasted nearby independent of the intended sender and receiver. Unlike a wired connection, wireless broadcast can’t be easily directed to a single device. It’s exactly what it sounds like, messages are broadly cast to all devices.\r\n\u003C\/bb-p\u003E\r\n\u003Cbb-p\u003E\r\n\u003Ca href=\u0022https:\/\/www.aircrack-ng.org\/\u0022 target=\u0022_blank\u0022\u003EAircrack-ng\u003C\/a\u003E is a standard suite of networking tools that allow you to inspect and interface with WiFi data in this unfiltered manner. We’ve built custom software that sits on top of these tools and exposes the activity of probing devices and beaconing access points. During the workshop, we use this software to visualize wireless activity that is normally hidden from view.\r\n\u003C\/bb-p\u003E\r\n\r\n\u003Cbb-media\u003E\r\n\u003Cimg src=\u0022https:\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/1d49bb2fab2eece9e95522c44bad8031\u0022\u003E\r\n\u003Cdiv id=\u0022caption\u0022 style=\u0022margin-left: 0px;\u0022\u003E\r\nScreenshot of the data safari software used in the workshop\r\n\u003C\/div\u003E\r\n\u003C\/bb-media\u003E\r\n\r\n\u003Cbb-h2\u003EWhat’s to See?\u003C\/bb-h2\u003E\r\n\u003Cbb-p\u003E\r\nAll WiFi network transmissions include a media access control number, or MAC address, that identifies which device sent the radio packet. MAC addresses are unique numbers assigned to a network interface by the manufacturer. They act as a sort of device fingerprint which can be used to identify the device, and in the case when you can tie a MAC address to the device owner, the presence of nearby human. Information about the manufacturer of the device is also embedded in a portion of the MAC address, making it trivial to identify if it belongs to an Apple iPhone or a Samsung Android phone. Other indicators can also be derived from intercepted packets, like signal strength and timestamps. When monitoring WiFi traffic, it’s not unlikely that packets with a strong signal strength are close by. Those loudly broadcast packets you keep receiving from an Apple device might just be coming from that fellow sitting next to you who is robotically thumbing through his iPhone.\r\n\u003C\/bb-p\u003E\r\n\u003Cbb-p\u003E\r\nOnce you’ve identified which devices belong to which humans you can start to gather more information about their owners. By collecting and grouping probe requests and cross referencing their network names with other datasets, some of which are publicly available, you can begin to draw conclusions about where the device owner may live, work, and play.\r\n\u003C\/bb-p\u003E\r\n\r\n\u003Cbb-h2\u003EWar Driving and Geographic Network Datasets\u003C\/bb-h2\u003E\r\n\u003Cbb-p\u003E\r\nWar driving is the process of geo-tagging beacon frames from wireless access points in an attempt to understand where in the world they are physically located. By collecting data in this fashion, large datasets can be amassed and used to identify where the networks a device is probing for exist in the real world. In fact, Google street view cars have been \u003Ca href=\u0022https:\/\/www.wired.com\/2012\/05\/google-wifi-fcc-investigation\/\u0022 target=\u0022_blank\u0022\u003Ereported\u003C\/a\u003E to be constantly war driving, creating collection of geo-tagged networks to use in their location services. By using cars, and even their user’s \u003Ca href=\u0022http:\/\/samy.pl\/androidmap\/\u0022 target=\u0022_blank\u0022\u003Eandroid devices\u003C\/a\u003E as they go about their daily life, Google can create complex maps of beaconing networks that can be used later to improve on GPS estimates, or identify where you are located even when you have GPS location turned off.\r\n\u003C\/bb-p\u003E\r\n\r\n\u003Cbb-media\u003E\r\n\u003Cimg src=\u0022https:\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/4b3e7926ec53e0f60395902928237e95\u0022 alt=\u0022WiGLE.net War driving data from Chicago, IL. Each point represents a WiFi network.\u0022\u003E\r\n\u003C\/bb-media\u003E\r\n\r\n\u003Cbb-p\u003E\r\nThe practice of war driving is often associated with amateur network collection. The \u003Ca href=\u0022https:\/\/wigle.net\/\u0022 target=\u0022_blank\u0022\u003EWiGLE website\u003C\/a\u003E is a crowdsourced war driving dataset that is available for public use. For this workshop, we downloaded WiGLE data from the Los Angeles area in order to offer a map view feature to workshop participants. Probe requests that are collected during the data safari can be queried against this dataset to provide information about where the device owner may spend their time.\r\n\u003C\/bb-p\u003E\r\n\r\n\u003Cbb-h2\u003ETracking People’s Physical Movements\u003C\/bb-h2\u003E\r\n\u003Cbb-p\u003E\r\nWe now know that the passive collection of seemingly banal personal information can result in the 1) identification of human presence and 2) potential reconstruction of past physical location by using a single WiFi card, which supports monitor mode. With multiple WiFi cards positioned throughout a defined area it’s also possible to track the movements of individuals carrying mobile devices. This is a regularly deployed technique by many institutions including shopping centers, hotels, government agencies, universities and small businesses.\u003Cbb-note info=\u0027Low cost \u003Ca href=\u0022https:\/\/arstechnica.com\/information-technology\/2013\/08\/diy-stalker-boxes-spy-on-wi-fi-users-cheaply-and-with-maximum-creep-value\/\u0022 target=\u0022_blank\u0022\u003Esensors\u003C\/a\u003E for this sort of tracking are available to businesses of any size, there are even ways to leverage existing or cheap \u003Ca href=\u0022http:\/\/digitalcommons.calpoly.edu\/cgi\/viewcontent.cgi?article=1050\u0026context=cscsp\u0022 target=\u0022_blank\u0022\u003Econsumer WiFi cards\u003C\/a\u003E to do the same. All of this is possible for under $100\u0027\u003E\u003C\/bb-note\u003E One \u003Ca href=\u0022https:\/\/arstechnica.com\/information-technology\/2013\/08\/no-this-isnt-a-scene-from-minority-report-this-trash-can-is-stalking-you\/\u0022 target=\u0022blank\u0022\u003Enotable example\u003C\/a\u003E was the London based marketing firm Renew which offers WiFi tracking services it describes as “Internet cookies in the real world”. Within a single week Renew was able to track 4 million devices throughout the city by placing sensors in public trash cans. It’s difficult to discern how many institutions deploy such tracking techniques as the act of listening to probe requests is “passive” and can not be detected, but given the interest in such data and the fact that such tools are readily available we suspect it’s very common.\r\n\u003C\/bb-p\u003E\r\n\r\n\u003Cbb-h2\u003EHoneypot \u0026 Evil Twin Networks\u003C\/bb-h2\u003E\r\n\u003Cbb-p\u003E\r\nIn addition to the mass data collection and tracking mentioned above, probe requests can also be exploited to execute more malicious network attacks. Because networks are often configured to auto-connect to known networks, an attacker can easily create ad-hoc networks with SSIDs that match those a targeted device is probing for. By forcing a connection in this way an attacker can exploit vulnerabilities in software running on the device to record, intercept, or alter the user’s Internet activity, or perform a phishing attack to steal the user’s account credentials.\r\n\u003C\/bb-p\u003E\r\n\u003Cbb-p\u003E\r\nInternet service providers have been known to exploit this SSID auto-connection feature in the wild. Comcast’s XFINITY routers automatically create two networks, one to serve the customer who purchased the router, and the second to serve the rest of their customers. This second network beacons with the SSID “xfinitywifi” to lure probing customers to auto-connect. This prompts a captive portal on the user’s device with a form to login to their Comcast account and piggy back of the router owner’s Internet connection to surf the net.\r\n\u003C\/bb-p\u003E\r\n\r\n\u003Cbb-h2\u003EWhat’s to Be Done?\u003C\/bb-h2\u003E\r\n\u003Cbb-p\u003E\r\nThe picture we paint of the WiFi protocol is fairly bleak. The aging WiFi standard was introduced at a time when the networked landscape was very different than it is now, and yet we continue to expect it to “securely” connect the devices we rely so heavily on today. Though probe requests and beacon frames likely aren’t going anywhere soon, there are a few measures that can be taken to protect yourself from data collection and targeted attacks against your devices. The most effective protection is to turn your device’s WiFi off while in-transit or whenever you aren’t connected to a familiar network. Doing so will keep your device from constantly sending probe requests and make it inaccessible to attackers.\r\n\u003C\/bb-p\u003E\r\n\r\n\u003Cbb-quote\u003E\r\nThe most effective protection is to turn your device’s WiFi off while in-transit or whenever you aren’t connected to a familiar network.\r\n\u003C\/bb-quote\u003E\r\n\r\n\u003Cbb-p\u003E\r\nAnother privacy mechanism that is starting to be more regularly adopted by device manufacturers and operating system developers is MAC randomization. This approach broadcasts probe requests with a random MAC address, making it difficult to detect the presence of an identifiable MAC fingerprint or to tie multiple probed SSIDs to the same device. More devices are using this method today than we found them to be two years ago, but this approach still \u003Ca href=\u0022https:\/\/papers.mathyvanhoef.com\/asiaccs2016.pdf\u0022 target=\u0022_blank\u0022\u003Eisn’t without its shortcomings\u003C\/a\u003E. Devices that use MAC randomization for probe requests still authenticate to access points using their true MAC address, making the use of honeypot access points an effective method to identify the true MAC addresses.\r\n\u003C\/bb-p\u003E","id":40,"name":"Description"},{"value":"https:\/\/twitter.com\/branger_briz\/status\/959516041750761472","id":169,"name":"Tweet Link"}]},{"name":"Blog List","type":4,"id":73,"data":[{"value":"\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/0d6052d5b67ed4cf043752f110f3e66e","id":170,"name":"Social Media Thumbnail"},{"value":"lessons-learned-over-two-decades-of-developing-startups","id":43,"name":"slug"},{"value":"Developing Startups: Lessons Learned Over Two Decades","id":33,"name":"Post Title"},{"value":"by Paul Briz","id":41,"name":"written by"},{"value":"1","id":34,"name":"Published"},{"value":"04\/19\/2018","id":35,"name":"Create on"},{"value":"04\/19\/2018","id":37,"name":"Post Start"},{"value":"","id":38,"name":"Post End"},{"value":"Points of interest for startups in the digital arena, from a development partner’s point of view. We’ve worked with digital startups since the Dot-com era and would like to share some of our learnings. ","id":39,"name":"Summary"},{"value":"\u003Cbb-p\u003EThe first startup I worked with was back in 2000. After months of planning and designing, the founder had several promising meetings with potential investors setup in late 2000, early 2001. If you know your web history you already know what happened. The \u003Ca href=\u0022https:\/\/en.wikipedia.org\/wiki\/Dot-com_bubble\u0022 target=\u0027_blank\u0027\u003EDot-com bubble\u003C\/a\u003E popped during the funding efforts and .COMs instantly became radioactive. The project never saw the light of day.\u003C\/bb-p\u003E\r\n\u003Cbb-p\u003E\r\nIt was our first introduction to the tech startup world! Since then we’ve worked with many startups and experienced all sorts of scenarios. We’ve seen great ideas that didn’t make it due to lack of funding, lack of commitment, and bad management; Startups that were purchased before launching; And of course startups that have made it and are still up and running after years. \r\n\u003C\/bb-p\u003E\r\n\u003Cbb-p\u003ESportsmanias \u003Cbb-note info=\u0022download \u003Ca href=\u0027https:\/\/itunes.apple.com\/us\/app\/sportsmanias-emojis-fantasy\/id588722840?mt=8\u0027 target=\u0027_blank\u0027\u003EiOS app\u003C\/a\u003E \u003Cbr\u003E download \u003Ca href=\u0027https:\/\/play.google.com\/store\/apps\/details?id=com.antediem.sportsmanias\u0026hl=en\u0027 target=\u0027_blank\u0027\u003Egoogle app\u003C\/a\u003E\u0022 \u003E\u003C\/bb-note\u003E is one our current partners since their \u003Ca href=\u0022https:\/\/www.forbes.com\/sites\/darrenheitner\/2013\/08\/15\/platform-connecting-die-hard-sports-fans-with-local-beat-writers-receives-1-million-investment\/#719129933aed\u0022 target=\u0022_blank\u0022\u003Einception in 2012\u003C\/a\u003E. They’ve secured \u003Ca href=\u0022https:\/\/www.forbes.com\/sites\/darrenheitner\/2014\/07\/25\/miami-based-sportsmanias-scores-3-5-million-in-series-a-funding\/#4c8a63784d0f\u0022 target=\u0022_blank\u0022\u003E$4 million in funding\u003C\/a\u003E as a sports breaking news platform and in the quest for viable monetization have successfully leveraged their sports partnerships and existing audience to pivot into a \u003Ca href=\u0022https:\/\/www.si.com\/tech-media\/2016\/09\/14\/sportsmanias-nfl-players-association-realtime-emojis\u0022 target=\u0022_blank\u0022\u003Eanimated sports emoji keyboard\u003C\/a\u003E.\u003C\/bb-p\u003E\r\n\u003Cbb-p\u003E\r\nBranger_Briz is an interactive agency with experience working with startups in the digital arena as well as general online platform design and development. This post comes from our perspective, in other words, from a development partner’s point of view.  These are some of the topics we think early stage startups should take note of.\r\n\u003C\/bb-p\u003E\r\n\r\n\u003Cbb-h2\u003EPartners\u003C\/bb-h2\u003E\r\n\u003Cbb-p\u003E\r\nNeedless to say, partner selection is a very important part of the early stages of a startup. You’ll need partners that you can lean on for advice not only when you’re trying to rollout technical features, but also for when you need creative problem solving for how to improve UX, optimize user flows, reduce infrastructure costs, etc. \u003C\/bb-p\u003E\r\n\u003Cbb-p\u003E\r\nFor this to happen you need to communicate with your partners and talk about your short, medium, and long term goals. This not only helps with buy-in but also minimizes wasted time due to short term planning and development that doesn’t fall inline with long term goals. Not to mention that it helps partners better understand business decisions made along the way that could otherwise cause \u003Ca href=\u0022https:\/\/en.wikipedia.org\/wiki\/Business-IT_alignment\u0022 target=\u0022_blank\u0022\u003Ealignment issues\u003C\/a\u003E.\u003C\/bb-p\u003E\r\n\u003Cbb-h2\u003E\r\nDistilling your Core Value Proposition\r\n\u003C\/bb-h2\u003E\r\n\u003Cbb-p\u003E\r\nOne thing that we’ve seen time and time again are startups approaching us with a great idea, then getting lost in the bells and whistles. The concept of the MVP (Minimum Viable Product) should always be in the forefront of startup’s collective minds. We’re big believers in the idea of focusing on a core feature-set that will allow your startup to stand apart from the competition. Then after that space is won, start adding features based on learnings. \u003C\/bb-p\u003E\r\n\u003Cbb-p\u003E\r\nThis is important for several reasons, not least of which is the fact that all startups have a limited runway. The proof of concept has to be developed as soon as possible and as lean as possible. Not only so you can quickly position yourself for additional funding, but also because many features added at early stages are based on our best guesses, our gut feelings, and often times they can be off or flat out wrong. This ends up leading to lost time and money that could have gone towards something much more valuable.\u003C\/bb-p\u003E\r\n\u003Cbb-p\u003E\r\nInstagram launched in 2010 and made it easier than flickr or facebook to take photos, add filters and post. That was the core value that made them explode. They didn’t add hashtags until 2011 (4 months after launch).  Live filters, tilt-shift, and high res didn’t appear until September 2011 (12 months after launch). Video sharing in June 2013, and Stories in 2016\u003Cbb-note info=\u0022from \u003Ca href=\u0027https:\/\/en.wikipedia.org\/wiki\/Timeline_of_Instagram\u0027 target=\u0027_blank\u0027\u003Ewikipedia\u003C\/a\u003E\u0022\u003E\u003C\/bb-note\u003E.\u003C\/bb-p\u003E\r\n\u003Cbb-h2\u003E \r\nValidated Learning: Build - Measure - Learn Cycle\u003C\/bb-h2\u003E\r\n\u003Cbb-p\u003E\r\nPlatforms evolve with the market and with user needs, it’s impossible to have everything coming out of the gate. However intense the initial development period, the hard work begins after launch. We’ve actually had aspiring startups approach us and ask us for how long they should expect to have to keep investing in platform development. Our answer is shocking to some, you never stop developing your platform!\r\n\u003C\/bb-p\u003E\r\n\r\n\u003Cbb-p\u003E\r\nInnovation is a process. Seldom does the great idea just reveal itself in final form. It often starts with copying, combining, experimenting and transforming. Running a tech startup, when done correctly is a continuous Build-Measure-Learn loop. \u003Cbb-note info=\u0022posited by Eric Ries’ book \u003Ca href=\u0027 http:\/\/theleanstartup.com\/\u0027 target=\u0027_blank\u0027\u003E\u0027The Lean Startup\u0027\u003C\/a\u003E\u0022\/\u003E\u003C\/bb-p\u003E\r\n\u003Cbb-media\u003E\u003Cimg src=\u0022https:\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/94289cef078b6360967279fa1255eba7\u0022 style=\u0022width: 55%; margin-left: auto; margin-right: auto; display: block;\u0022 \u003E\u003C\/bb-media\u003E\r\n\r\n\u003Cbb-h3\u003E\u003Ca style=\u0022color:#e40477;text-decoration:none;\u0022 href=\u0022https:\/\/brangerbriz.com\/blog\/lessons-learned-over-two-decades-of-developing-startups-build-part2\u0022\u003E\r\nPart 2: Build\u003C\/a\u003E\u003C\/bb-h3\u003E\r\n\r\n\u003Cbb-p\u003E\r\nThe Build phase involves developing products\/functionality as quickly and inexpensively as possible. \u003Ca href=\u0022https:\/\/brangerbriz.com\/blog\/lessons-learned-over-two-decades-of-developing-startups-build-part2\u0022\u003EIn this section\u003C\/a\u003E we review iterative development, code base management, preparing for scalability, security and compliance and considering human resources constraints.\r\n\u003C\/bb-p\u003E\r\n\r\n\u003Cbr\u003E\r\n\u003Cbb-h3\u003E\u003Ca style=\u0022color:#e40477;text-decoration:none;\u0022 href=\u0022https:\/\/brangerbriz.com\/blog\/lessons-learned-over-two-decades-of-developing-startups-measure-part3\u0022\u003E\r\nPart 3: Measure\u003C\/a\u003E\u003C\/bb-h3\u003E\r\n\u003Cbb-p\u003E\r\nThe Measure phase involves measuring how customers respond to your product. \u003Ca href=\u0022https:\/\/brangerbriz.com\/blog\/lessons-learned-over-two-decades-of-developing-startups-measure-part3\u0022\u003EIn this section\u003C\/a\u003E we review analytical tools, split testing, server data analysis, and knowing your user.\r\n\u003C\/bb-p\u003E\r\n\r\n\u003Cbr\u003E\r\n\u003Cbb-h3\u003E\u003Ca style=\u0022color:#e40477;text-decoration:none;\u0022 href=\u0022https:\/\/brangerbriz.com\/blog\/lessons-learned-over-two-decades-of-developing-startups-learn-part4\u0022\u003E\r\nPart 4: Learn\u003C\/a\u003E\u003C\/bb-h3\u003E\r\n\u003Cbb-p\u003EThe Learn phase involves using data to make informed decisions. \u003Ca href=\u0022https:\/\/brangerbriz.com\/blog\/lessons-learned-over-two-decades-of-developing-startups-learn-part4\u0022\u003E In this section\u003C\/a\u003E we review the importance of quantitative data, qualitative data, and competitive review.\r\n\u003C\/bb-p\u003E\r\n\r\n\u003Cbb-h2\u003E\r\nIn Conclusion\u003C\/bb-h2\u003E\r\n\u003Cbb-p\u003E\r\nThese are just a few of the bigger picture items you should be looking at as a early stage startup. At first glance it may seem technically inclined but we strongly believe that as a founder of a tech startup you should eventually become intimately aware of each of these topics. \u003C\/bb-p\u003E\r\n\u003Cbb-p\u003E\r\nAnd of course, if you need any help getting there please feel free to reach out to \u003Ca href=\u0022mailto:us@brangerbriz.com\u0022\u003Eus@brangerbriz.com\u003C\/a\u003E \r\n\u003C\/bb-p\u003E","id":40,"name":"Description"},{"value":"https:\/\/twitter.com\/branger_briz\/status\/989164002348535809","id":169,"name":"Tweet Link"},{"value":"[\u0022startups\u0022]","id":177,"name":"Tags"}]},{"name":"Blog List","type":4,"id":74,"data":[{"value":"[\u0022startups\u0022]","id":177,"name":"Tags"},{"value":"\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/0d6052d5b67ed4cf043752f110f3e66e","id":170,"name":"Social Media Thumbnail"},{"value":"lessons-learned-over-two-decades-of-developing-startups-build-part2","id":43,"name":"slug"},{"value":"Developing Startups Part 2: Build","id":33,"name":"Post Title"},{"value":"by Paul Briz","id":41,"name":"written by"},{"value":"1","id":34,"name":"Published"},{"value":"04\/19\/2018","id":35,"name":"Create on"},{"value":"04\/19\/2018","id":37,"name":"Post Start"},{"value":"","id":38,"name":"Post End"},{"value":"Part 2 of a 4 part series “Lessons Learned Over Two Decades of Developing Startups”. In this section we review the Build phase, including iterative development, code base management, preparing for scalability, security and compliance and considering human resources constraints.","id":39,"name":"Summary"},{"value":"\u003Cbb-p\u003E\u003Ci\u003EThis post is part 2 of a 4 part series “Developing Startups: Lessons Learned Over Two Decades”. If you’d like to read it from the start, you can \u003Ca href=\u0022https:\/\/brangerbriz.com\/blog\/lessons-learned-over-two-decades-of-developing-startups\u0022 \u003Ejump to the first post here\u003C\/a\u003E. \r\n\u003C\/i\u003E\u003C\/bb-p\u003E\r\n\u003Chr style=\u0022display: block; margin-left: auto; margin-right: auto; margin-top: 20px;border-style: inset; border-width: 1px; width:400px;\u0022\u003E\r\n\u003Cbb-p\u003E\r\nThe first iteration of this is the initial process of designing, building, and launching your product. After launch you move to Measure, then Learn and end up at Build again as you enter your 2nd iteration and so on into infinity. The idea is that you are always taking your learnings and improving on the product as you go.\u003C\/bb-p\u003E\r\n\u003Cbb-h2\u003E\r\nManaging the Work with Iterative Development \u003C\/bb-h2\u003E\r\n\u003Cbb-p\u003E\r\nWe’re not dogmatic about SCRUM, but we do think it’s a great tool. Besides the general benefit of instilling a procedural discipline to your development process, there are a few simple benefits that to us, sell the point:\u003C\/bb-p\u003E\r\n\r\n\u003Cbb-h3\u003E\r\nIterative Sprints\u003C\/bb-h3\u003E\r\n\u003Cbb-p\u003E\r\n\u003Cbb-media\u003E\u003Cimg src=\u0022https:\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/937258d28e68fe0d08f284e212b1cc95\u0022 style=\u0022margin-top:-30px;\u0022 \u003E\u003C\/bb-media\u003E\r\nIterative Sprints are incredibly helpful in that they force the development team into two week (normally) planning of deliverables.  Features are broken up and prioritized in order to have a “usable” product at the end of every sprint. This way features can be used, learned from, and improved upon throughout development.  Before SCRUM we would work on completing an entire module then have to go back and make changes after the fact as we noticed usability issues.\r\n\r\n \u003C\/bb-p\u003E\r\n\r\n\u003Cbr\u003E\u003Cbr\u003E\r\n\u003Cbb-h3\u003EEpics, Stories and Tasks\u003C\/bb-h3\u003E\r\n\u003Cbb-p\u003E\r\nThe breaking up functionality into epics, stories and tasks not only guides the team into thinking through every element of the work that has to go into a feature but also allows for easier, more accurate estimating of these features. It feels like a lot of work up front but in the end it provides a much clearer path, and saves time.\u003C\/bb-p\u003E\r\n\u003Cbb-h3\u003E\r\nMinimum Viable Product\u003C\/bb-h3\u003E\r\n\u003Cbb-quote credit=\u0022Eric Ries\u0022\u003E\r\n“the minimum viable product is that version of a new product which allows a team to collect the maximum amount of validated learning about customers with the least effort.”\u003C\/bb-quote\u003E\r\n\u003Cbb-p\u003E\r\nThe focus on prioritizing an MVP (Minimum Viable Product) is perfectly inline with the needs of the startup. As mentioned earlier, it’s impossible to do everything correctly on first attempt. Focusing on an MVP lets you learn from the product as you are developing it in order to increase the chances of having the best possible feature by the time you finish.\u003C\/bb-p\u003E\r\n\u003Cbb-h3\u003EOther Benefits\u003C\/bb-h3\u003E\r\n\u003Cbb-p\u003E\r\nIn this section we’ve focused some of the main benefits of SCRUM that are, in our opinion, irrefutable benefits to the average startup. However, there are many other concepts\/tools in the SCRUM framework that are of great benefit: Daily standups, Sprint reviews and retrospectives, Product and Sprint Backlogs, the concept of Product Owners, the definition of Done. If you’re not already using SCRUM we encourage looking into it. \u003Ca href=\u0022http:\/\/www.scrumguides.org\/docs\/scrumguide\/v2017\/2017-Scrum-Guide-US.pdf#zoom=100\u0022 target=\u0022_blank\u0022 \u003EFor more information\u003C\/a\u003E.\u003C\/bb-p\u003E\r\n\u003Cbb-h2\u003E\r\nA Healthy Code Base\u003C\/bb-h2\u003E\r\n\u003Cbb-h3\u003E\r\nAllowing Time for Refactoring\u003C\/bb-h3\u003E\r\n\u003Cbb-p\u003E\r\nThe pressure to push out a complete platform often results in \u003Ca href=\u0022https:\/\/www.techopedia.com\/definition\/27913\/technical-debt\u0022 target=\u0022_blank\u0022\u003Ecode debt\u003C\/a\u003E. This is completely normal. Speed is prioritized over proper system design and structuring. It is extremely important to allow for \u003Ca href=\u0022https:\/\/en.wikipedia.org\/wiki\/Code_refactoring\u0022 target=\u0022_blank\u0022\u003Ecode refactoring\u003C\/a\u003E. This is the process of restructuring existing computer code without changing its external behavior, in order to reduce complexity, improve readability, and improve source code maintainability and extensibility. It’s easy to dismiss this as abstract technical theory but its consequences are very real and could cost much time and money in the not-so-distant future when you’re trying to modify your platform. Just like a building, a platform is only as strong as its foundation. \u003C\/bb-p\u003E\r\n\u003Cbb-p\u003E\r\nThis idea is also important during the lifetime of a platform. There is a concept called Software Entropy\u003Cbb-note info=\u0022Jacobson, Ivar; Christerson, Magnus; Jonsson, Patrik; Övergaard, Gunnar (1992), Object-Oriented Software Engineering: A Use Case Driven Approach, ACM Press. Addison–Wesley, pp. 69–70, ISBN 0-201-54435-0  ,a href=\u0027https:\/\/en.wikipedia.org\/wiki\/Software_entropy\u0027 target=\u0027_blank\u0027\u003Ewiki\u003C\/a\u003E\u0022\u003E\u003C\/bb-note\u003E, which states that as a system is modified, its disorder, or entropy, tends to increase. With every change and modification, if active measures (code refactoring) are not taken to correct this issue, you’ll end up with what we affectionately refer to as \u003Ca href=\u0022https:\/\/en.wikipedia.org\/wiki\/Spaghetti_code\u0022 target=\u0022_blank\u0022\u003ESpaghetti Code\u003C\/a\u003E.\u003C\/bb-p\u003E\r\n\u003Cbb-p\u003E\r\nI also want to quickly mention testing. It deserves an entire blog post but for now I’ll leave you with a few things you should dig a little deeper into. If you get anything from this post you should realize that a platform is constantly changing and evolving. Throughout the process of refactoring (as well as throughout the Build-Measure-Learn cycle) you should create test plans to help organize your testing. A Critical Test plan, for example, defines scope, approach, resources and schedule of test activities and can help you organize your regression testing. \u003C\/bb-p\u003E\r\n\u003Cbb-h3\u003E\r\nChoosing the Right Technology\u003C\/bb-h3\u003E\r\n\u003Cbb-p\u003E\r\nDevelopment languages and frameworks are tricky. Everywhere you look you’ll find another article or blog post talking about what the next big thing is and what’s on its way out.  You’re going to find fanatics and haters on all sides of this topic. The truth is that you’ll have to consider the Pros and Cons of your specifics. Many times it comes down to what the development team is most comfortable with. Beware trends and be aware of the trajectory of any language\/framework you select. You want it to be a mature framework, feature rich, and have an active community. In regards to databases, you have to consider whether a relational or non-relational database makes most sense and based on that, select the best fit. \u003C\/bb-p\u003E\r\n\u003Cbb-p\u003E\r\nOpen Source is our preference and makes sense for most startups. Although you should always be aware of the licensing details of your selected open source tools. Just because something is open source doesn’t mean you’re given the right to use it as you wish.\r\n\u003C\/bb-p\u003E\r\n\u003Cbb-h3\u003E\r\nVersion Control\u003C\/bb-h3\u003E\r\n\u003Cbb-p\u003E\r\nWhen you own an online startup, all you own besides leased infrastructure and your \u003Ca href=\u0022https:\/\/www.investopedia.com\/terms\/g\/goodwill.asp\u0022 target=\u0022_blank\u0022\u003Egoodwill\u003C\/a\u003E (hopefully) is your source code. It’s important that you maintain it carefully. How do you do that? Use a source code repository. GitHub, Bitbucket, LaunchPad, SourceForge, GitLab, take your pick. The important thing is that you are able to maintain your code on the cloud, easily share and collaborate between multiple team members, review code, identify and fix conflicts, and track the state of your code at any point in time. \u003C\/bb-p\u003E\r\n\u003Cbb-h3\u003E\r\nDocumentation\u003C\/bb-h3\u003E\r\n\u003Cbb-p\u003E\r\nDocumentation is another important and often overlooked part of software development. It helps keep track of the latest state of the code, allows for easier maintenance and knowledge transfer. Additionally, documentation is often required by investors as part of their \u003Ca href=\u0022https:\/\/www.itduediligenceguide.com\/it-due-diligence-source-code-review\/\u0022 target=\u0022_blank\u0022\u003Edue diligence\u003C\/a\u003E.\u003C\/bb-p\u003E\r\n\u003Cbb-p\u003E\r\nDocumentation doesn’t have to be as difficult as you might imagine. There are many tools that help create quick documentation from source comments. Besides this type of in-code documentation though, you should document process flows. This goes a long way to shorten the learning curve for new dev team members.\u003C\/bb-p\u003E\r\n\u003Cbb-h2\u003E\r\nPreparing for Scalability\u003C\/bb-h2\u003E\r\n\u003Cbb-p\u003E\r\nA platform is not either scalable or non-scalable. There are many components of a system that can create a bottleneck and cause a system to not scale properly under different circumstances.\r\n\u003C\/bb-p\u003E\r\n\u003Cbb-p\u003E\r\nComplex queries, data classification algorithm processing times, data refinement processing times, etc  There’s a lot to be considered but here are a few precautions that should be taken in order to deal with certain bottle necks:\r\n\u003Cul\u003E\r\n\u003Cli\u003EDatabase clustering\u003C\/li\u003E\r\n\u003Cli\u003ELoad balancing web servers\u003C\/li\u003E\r\n\u003Cli\u003ECaching content\u003C\/li\u003E\r\n\u003Cli\u003ERapid Server provisioning (more about this below)\u003C\/li\u003E\r\n\u003Cli\u003EAutoscaling \u003C\/li\u003E\r\n\u003C\/ul\u003E\r\nWhen appropriate, consider the possibility of using existing infrastructures vs the need for building an infrastructure. For example, serving videos from you server vs using youtube. This would of course depend on the service you’re providing and whether the infrastructure in question is providing part of the core value or a secondary value.\r\n\u003C\/bb-p\u003E\r\n\u003Cbb-h3\u003E\r\nCloud Based Development\u003C\/bb-h3\u003E\r\n\u003Cbb-p\u003E\r\nJust 10 years ago preparing for infrastructure growth or rapid scaling was a time consuming and expensive undertaking. New servers, routers, load balancers, etc, would have to be procured in anticipation of growth or traffic spikes. Today with services like AWS, that’s not the case. The same server procurement can be done in hours, and if planned for correctly, in minutes.\u003C\/bb-p\u003E\r\n\u003Cbb-p\u003E\r\nDue to incremental billing models cloud computing services like AWS allow you to put spin servers up and down at peak hours, or during spikes while billing you for only the minutes used. \u003C\/bb-p\u003E\r\n\u003Cbb-p\u003E\r\nBesides the incredible scalability benefit and flexibility, cloud computing allows for faster and less expensive disaster recovery and increased security. \u003C\/bb-p\u003E\r\n\u003Cbb-h2\u003E\r\nSecurity and Threat Modeling\u003C\/bb-h2\u003E\r\n\u003Cbb-p\u003E\r\nWhat do Under Armour, FedEx, Uber, Pizza Hut, Deloitte and Equifax have in common? They were all victims of \u003Ca href=\u0022https:\/\/www.techworld.com\/security\/uks-most-infamous-data-breaches-3604586\/\u0022 target+\u0022_blank\u0022\u003Esecurity breaches\u003C\/a\u003E since the beginning of 2017. Security lapses can be a great liability and, specially for a startup, can lead to an unrecoverable reputation issue. \r\n\u003C\/bb-p\u003E\r\n\u003Cbb-p\u003E\r\nThreat Modeling is a process designed to define security objectives, identify relevant threats, and develop plans to help mitigate the risks. This \u003Ca href=\u0022https:\/\/www.owasp.org\/index.php\/Threat_Risk_Modeling\u0022 target=\u0022_blank\u0022\u003Epost\u003C\/a\u003E does a great job of walking through the steps of Threat Risk Modelling.\r\n\u003C\/bb-p\u003E\r\n\u003Cbb-p\u003E\r\nTaken from the referenced post, to give you an idea of the sorts of security issues you should be thinking about, these are some starting points to defining security objectives:\r\n\r\n\u003Cul\u003E\r\n\u003Cli\u003E\u003Cb\u003EIdentity\u003C\/b\u003E: Does the application protect user identity from abuse? Are there adequate controls in place to ensure evidence of identity (as required for many banking applications?)\u003C\/li\u003E\r\n\u003Cli\u003E\u003Cb\u003EFinancial\u003C\/b\u003E: Assess the level of risk the organization is prepared to absorb in remediation, as a potential financial loss. For example, forum software may have a lower estimated financial risk than an Internet banking application.\u003C\/li\u003E\r\n\u003Cli\u003E\r\n\u003Cb\u003EReputation\u003C\/b\u003E: Quantify or estimate of the loss of reputation derived from the application being misused or successfully attacked.\u003C\/li\u003E\r\n\u003Cli\u003E\r\n\u003Cb\u003EPrivacy and Regulatory\u003C\/b\u003E: To what extent will the application have to protect user data? Forum software by its nature is public, but a tax preparation application is subject to tax regulations and privacy legislation requirements in most countries.  \u003C\/li\u003E\r\n\u003Cli\u003E\r\n\u003Cb\u003EAvailability Guarantees\u003C\/b\u003E: Is the application required to be available per a Service Level Agreement (SLA) or similar guarantee? Is it a nationally protected infrastructure? To what level will the application have to be available? High availability techniques are significantly more expensive, so applying the correct controls up front will save a great deal of time, resources, and money.\u003C\/li\u003E\r\n\u003C\/ul\u003E\r\n\r\nAnd as with everything, this is not just a pre-launch concern. You have to make sure to keep up with the ever changing landscape. For example, if your startup has an international user base does it comply with \u003Ca href=\u0022https:\/\/en.wikipedia.org\/wiki\/General_Data_Protection_Regulation\u0022 target=\u0022_blank\u0022\u003EGDPR\u003C\/a\u003E (which becomes enforceable on May 25, 2018)?\r\n\u003C\/bb-p\u003E\r\n\u003Cbb-h2\u003E\r\nDealing with Human Resource Constraints\u003C\/bb-h2\u003E\r\n\u003Cbb-p\u003E\r\nWhen building, its important to make a realistic assessment of the sustainability of certain tasks based on Human Resources constraints. \u003C\/bb-p\u003E\r\n\u003Cbb-p\u003E\r\nCustomer support platforms, manual curation, data classification, and blog post creation are a few example of the sort of thing that require constant upkeep. Some of these things can be handled with technology: Chatbots to help take some of the load off of support, crowd-sourcing for certain types of curation, ML (Machine Learning) for data classification. But some things still need humans (\u003Ca href=\u0022https:\/\/www.technologyreview.com\/s\/603465\/the-relentless-pace-of-automation\/\u0022 target=\u0022_blank\u0022\u003Efor the time being\u003C\/a\u003E). \u003C\/bb-p\u003E\r\n\u003Cbb-p\u003E\r\nIt’s arguably better not to have a feature than to have one that can’t be maintained and risks the erosion of user trust.\r\n\u003C\/bb-p\u003E\r\n\u003Cbb-p\u003E\r\n\u003Cdiv style=\u0022width:50%; float:left;height:100px;\u0022\u003E\u003Cbb-h3\u003EPart 1:\u003C\/bb-h3\u003E \u003Ca href=\u0022https:\/\/brangerbriz.com\/blog\/lessons-learned-over-two-decades-of-developing-startups\u0022\u003E\u003C Introduction\u003C\/a\u003E\u003C\/div\u003E\r\n\u003Cdiv style=\u0022width:50%; float:right;  text-align:right;height:100px;\u0022\u003E\u003Cbb-h3\u003EPart 3: \u003C\/bb-h3\u003E\u003Ca href=\u0022https:\/\/brangerbriz.com\/blog\/lessons-learned-over-two-decades-of-developing-startups-measure-part3\u0022\u003EMeasure \u003E\u003C\/a\u003E \u003C\/div\u003E\r\n\u003C\/bb-p\u003E\r\n\r\n","id":40,"name":"Description"},{"value":"https:\/\/twitter.com\/branger_briz\/status\/989164002348535809","id":169,"name":"Tweet Link"}]},{"name":"Blog List","type":4,"id":75,"data":[{"value":"[\u0022startups\u0022]","id":177,"name":"Tags"},{"value":"\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/0d6052d5b67ed4cf043752f110f3e66e","id":170,"name":"Social Media Thumbnail"},{"value":"lessons-learned-over-two-decades-of-developing-startups-measure-part3","id":43,"name":"slug"},{"value":"Developing Startups Part 3: Measure","id":33,"name":"Post Title"},{"value":"by Paul Briz","id":41,"name":"written by"},{"value":"1","id":34,"name":"Published"},{"value":"04\/19\/2018","id":35,"name":"Create on"},{"value":"04\/19\/2018","id":37,"name":"Post Start"},{"value":"","id":38,"name":"Post End"},{"value":"Part 3 of a 4 part series “Lessons Learned Over Two Decades of Developing Startups”. In this section we review the Measuring stage of the process and the use of analytical tools, split testing, server data analysis.","id":39,"name":"Summary"},{"value":"\u003Cbb-p\u003E\u003Ci\u003EThis post is part 3 of a 4 part series “Developing Startups: Lessons Learned Over Two Decades”. If you’d like to read it from the start, you can \u003Ca href=\u0022https:\/\/brangerbriz.com\/blog\/lessons-learned-over-two-decades-of-developing-startups\u0022 \u003Ejump to the first post here\u003C\/a\u003E. \r\n\u003C\/i\u003E\u003C\/bb-p\u003E\r\n\u003Chr style=\u0022display: block; margin-left: auto; margin-right: auto; margin-top: 20px;border-style: inset; border-width: 1px; width:400px;\u0022\u003E\r\n\u003Cbb-p\u003E\r\nMeasure how customers respond to your product\/service. This is where analytics come in handy. \u003C\/bb-p\u003E\r\n\u003Cbb-h2\u003E\r\nAnalytical Tools\u003C\/bb-h2\u003E\r\n\u003Cbb-p\u003E\r\nAnalytics are a requirement for any startup. They help you analyse user behavior, allowing you to make informed decisions in regards to improvements to application flow and functionality. They are also an invaluable marketing tool, and necessary for reporting growth to investors and stakeholders.\u003C\/bb-p\u003E\r\n\u003Cbb-p\u003E\r\nWhen you’re first starting Google Analytics is the way to go. Free and packed with features, it’s a staple not only for startups but pretty much for all sites. Basic page tracking can be used straight out of the box but should be configured for event tracking and and ecommerce tracking if your startup has a cart.\u003C\/bb-p\u003E\r\n\u003Cbb-p\u003E\r\nFor mobile apps you should use GA and at least Crashlytics for crash reporting (also free). With so many different mobile OS and so many different sets of hardware, it’s impossible to be able to catch or even recreate many bugs that your user will be experiencing. This is were Crashlytics comes in. It’s a life saver.\u003C\/bb-p\u003E\r\n\u003Cbb-p\u003E\r\nIt’s always important, through the life of a platform, to have good analytics. But as a startup you should take advantage of all the free tools that exist and let your analytics grow with you. Here’s a diagram that shows a stage by stage overview of an analytics growth plan.\u003C\/bb-p\u003E\r\n \r\n\u003Cbb-media caption width=\u002230%\u0022\u003E\r\n\u003Cimg src=\u0022https:\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/a4166ff1a25c8a7fa7a7aea8417750d6\u0022 alt=\u0022Based on https:\/\/thinkgrowth.org\/the-startup-founders-guide-to-analytics-1d2176f20ac1\u0022 \/\u003E\r\n\r\n\u003C\/bb-media\u003E\r\n\u003Cbb-p\u003E\r\nWithin your analytics there are many things you should be looking at. Here are a few:\r\n\u003Cul\u003E\r\n\u003Cli\u003E\u003Cb\u003EFunnel Analysis\u003C\/b\u003E - Whether you’re selling products or trying to increase membership there is usually a goal or set of goals that you want to achieve in regards to user interaction. With these goals in mind you can set up funnels in Google Analytics to help visualize your user flow. This helps find drop off points along the funnel that can tell you where users exit desired path. Now that you can pinpoint problem areas you can start start planning solutions.\u003C\/li\u003E\r\n\u003Cli\u003E\u003Cb\u003ECohort Analysis\u003C\/b\u003E - A cohort is a segment (group) of users based on a date. For example, if you’re looking at acquisition date cohorts by user retention, your analysing the user retention of users acquired on a certain date. Acquisition date cohorts by revenue per user means you’re looking at how much revenue was created over a period of time by a group of users acquired on a certain date. \u003Ca href=\u0022http:\/\/cutroni.com\/blog\/2015\/02\/06\/using-cohort-report\/\u0022 target=\u0022_blank\u0022\u003EHere’s a good post\u003C\/a\u003E that helps you understand Google Analytics cohort report. \u003C\/li\u003E\r\n\u003C\/ul\u003E\r\n\u003C\/bb-p\u003E\r\n\u003Cbb-h2\u003E\r\nSplit (or A\/B) Testing \u003C\/bb-h2\u003E\r\n\u003Cbb-p\u003E\r\nThis is a great tool for gathering information on user preferred functionality. Forgive me for making this point again, but you’ll be surprised by how often you’re gut can be off in regards to expected user functionality. A\/B Testing\u003Cbb-note info=\u0022\u003Ca href=\u0027https:\/\/support.google.com\/optimize\/answer\/6211938?hl=en\u0026ref_topic=6197696\u0027 target=\u0027_blank\u0027\u003E Google optimize\u003C\/a\u003E has free A\/B, Multivariate and Redirect testing tools. \u0022 \u003E\u003C\/bb-note\u003E lets you settle the question quantitatively. \r\n\u003C\/bb-p\u003E\r\n\u003Cbb-h2\u003E\r\nServer\/Error Log Data Analysis\u003C\/bb-h2\u003E\r\n\u003Cbb-p\u003E\r\nThis has less to do with measuring user response and more to do with measuring infrastructure response to users. Both when a system is launched and later when it’s being maintained and improved upon, the infrastructure has to be carefully monitored\u003Cbb-note info=\u0022We use a great open source tool called \u003Ca href=\u0027https:\/\/www.nagios.org\/\u0027 target=\u0027_blank\u0027\u003ENagios\u003C\/a\u003E.  \u0022\u003E\u003C\/bb-note\u003E in order to be able to preemptively address issues where possible.\r\n\u003C\/bb-p\u003E\r\n\r\n\u003Cbb-p\u003E\r\n\u003Cdiv style=\u0022width:50%; float:left;height:100px;\u0022\u003E\u003Cbb-h3\u003EPart 2:\u003C\/bb-h3\u003E \u003Ca href=\u0022https:\/\/brangerbriz.com\/blog\/lessons-learned-over-two-decades-of-developing-startups-build-part2\u0022\u003E\u003C Build\u003C\/a\u003E\u003C\/div\u003E\r\n\u003Cdiv style=\u0022width:50%; float:right;  text-align:right;height:100px;\u0022\u003E\u003Cbb-h3\u003EPart 4: \u003C\/bb-h3\u003E\u003Ca href=\u0022https:\/\/brangerbriz.com\/blog\/lessons-learned-over-two-decades-of-developing-startups-learn-part4\u0022\u003ELearn \u003E\u003C\/a\u003E \u003C\/div\u003E\r\n\u003C\/bb-p\u003E\r\n","id":40,"name":"Description"},{"value":"https:\/\/twitter.com\/branger_briz\/status\/989164002348535809","id":169,"name":"Tweet Link"}]},{"name":"Blog List","type":4,"id":76,"data":[{"value":"[\u0022startups\u0022]","id":177,"name":"Tags"},{"value":"\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/0d6052d5b67ed4cf043752f110f3e66e","id":170,"name":"Social Media Thumbnail"},{"value":"lessons-learned-over-two-decades-of-developing-startups-learn-part4","id":43,"name":"slug"},{"value":"Developing Startups Part 4: Learn","id":33,"name":"Post Title"},{"value":"by Paul Briz","id":41,"name":"written by"},{"value":"1","id":34,"name":"Published"},{"value":"04\/19\/2018","id":35,"name":"Create on"},{"value":"04\/19\/2018","id":37,"name":"Post Start"},{"value":"","id":38,"name":"Post End"},{"value":"Part 4 of a 4 part series “Lessons Learned Over Two Decades of Developing Startups”. In this section we review the the importance of learning from quantitative data, qualitative data, and competitive review.","id":39,"name":"Summary"},{"value":"\u003Cbb-p\u003E\u003Ci\u003EThis post is part 4 of a 4 part series “Developing Startups: Lessons Learned Over Two Decades”. If you’d like to read it from the start, you can \u003Ca href=\u0022https:\/\/brangerbriz.com\/blog\/lessons-learned-over-two-decades-of-developing-startups\u0022 \u003Ejump to the first post here\u003C\/a\u003E. \r\n\u003C\/i\u003E\u003C\/bb-p\u003E\r\n\u003Chr style=\u0022display: block; margin-left: auto; margin-right: auto; margin-top: 20px;border-style: inset; border-width: 1px; width:400px;\u0022\u003E\r\n\u003Cbb-p\u003E\r\nIn order to make informed decisions, you need:\r\n\u003Cul\u003E\r\n\u003Cli\u003E\u003Cb\u003EQuantitative data\u003C\/b\u003E - we’ve already covered the importance of quantitatively learning from user behaviors observed via analytics\u003C\/li\u003E\r\n\u003Cli\u003E\u003Cb\u003EQualitative data\u003C\/b\u003E - getting direct feedback from users can provide invaluable data regarding motivations behind user behavior. This is an important topic that we go over in a little more depth below.\u003C\/li\u003E\r\n\u003Cli\u003E\u003Cb\u003ECompetitive review\u003C\/b\u003E - you must constantly survey the competitive market. It’s not just about other products\/services overlapping with yours. You have to be aware of cultural changes that affect how users expect to interact with their platforms.\u003C\/li\u003E\r\n\u003C\/ul\u003E\r\n\u003C\/bb-p\u003E\r\n\u003Cbb-h2\u003E\r\nKnow Your User \u003C\/bb-h2\u003E\r\n\u003Cbb-p\u003E\r\nI’m assuming I don’t have to convince anyone that they should define their target audience. If you do need convincing, \u003Ca href=\u0022https:\/\/www.startups.co\/articles\/defining-target-market-think-small\u0022 target=\u0022_blank\u0022\u003Eread this\u003C\/a\u003E. Defining your target audience, like with everything else, starts with a gut feeling, then moves to research, exercises like \u003Ca href=\u0022https:\/\/www.inc.com\/molly-reynolds\/how-to-create-customer-personas-that-brealife-into-your-marketing.html\u0022 target=\u0022_blank\u0022\u003Ecreating customer personas\u003C\/a\u003E, defining your \u003Ca href=\u0022https:\/\/www.powerreviews.com\/wp-content\/uploads\/2016\/06\/Path-to-Purchase-Whitepaper061716.pdf\u0022 target=\u0022_blank\u0022\u003Econsumer journeys\u003C\/a\u003E, then conversations, interviews, polls, etc. However you do it, don’t skip over this process. It provides focus, sharpens your UX\/UI, and provides a frame of reference by which you can qualify your decisions and get your investors and team on board. On the flipside, not understanding your users habits, likes and culture, you stand to lose a lot of time and money creating features and ultimately a product, they won’t use.\u003C\/bb-p\u003E\r\n\u003Cbb-p\u003E\r\nOnce the platform is launched is when the real work starts. Many times a platform is created with one target in mind only to find out that they missed the mark. This could happen even if you had your target figured out perfectly. The market changes so quickly that user habits can change in a matter of months. But this doesn’t have to be a problem as long as you stay on top of current trends and you learn from your users and adjust accordingly. You’re platform is your best tool for doing this.\u003C\/bb-p\u003E\r\n\u003Cbb-h3\u003E\r\nUser Feedback\u003C\/bb-h3\u003E\r\n\u003Cbb-p\u003E\r\nOnce you’ve launched, the simplest way to get the insights into your users is to ask them. Feedback forms and reviews should be built into the platform as a sincere effort to learn from your users. Yes it’s scary to open the doors to direct criticism, but if you’re not willing to receive and process your startup’s faults, you’re setting yourself up for failure.\u003C\/bb-p\u003E\r\n\u003Cbb-h3\u003E\r\nSupport Ticketing Platforms\u003C\/bb-h3\u003E\r\n\u003Cbb-p\u003E\r\nThe next step in your evolution through Zen and the art of platform maintenance is the implementation of a customer support platform. This steps up your game, letting your users know that not only are you listening but that you’re acting on their concerns. And if done correctly it also lets you start building a knowledge base which can allow future support seekers to looks through previous user’s concerns and questions.\u003C\/bb-p\u003E\r\n\u003Cbb-p\u003E\r\nOne thing to keep in mind is that if you’re going to take this approach you must have the (human) resources in place to review and do triage. You don’t want requests falling into the black hole of customer service, but you also don’t want all your requests to pass unfiltered to the dev team. Your support team should let users know that they are being attended to while also protecting the development team from an onslaught of requests. A properly setup support process can result in a more loyal user base.  It’s a powerful tool. \u003C\/bb-p\u003E\r\n\u003Cbb-p\u003E\r\nThere are many 3rd party services that can be incorporated into your support flow without having to invest in building your own system. Zendesk, Freshdesk, Zoho desk, and HappyFox are a few.\u003C\/bb-p\u003E\r\n\u003Cbb-h2\u003EValidated Learning\u003C\/bb-h2\u003E\r\n\u003Cbb-p\u003E\r\nThis Build-Measure-Learn cycle is the process by which Validated Learning occurs. Validated Learning is exactly what it sounds like, learning that has been validated by data. The Lean Startup methodology specifically emphasizes frequent experiments on actual users to generate the data and validate your hypothesis. \u003C\/bb-p\u003E\r\n\u003Cbb-p\u003E\r\nThe \u003Ci\u003ELearn\u003C\/i\u003E phase of the cycle is where you take your data, feedback and learnings and generate ideas and new hypotheses in order to \u003Ci\u003Ebuild\u003C\/i\u003E or modify (experimental) functionality and begin the process over again.\u003C\/bb-p\u003E\r\n\r\n\r\n\u003Cbb-p\u003E\r\n\u003Cdiv style=\u0022width:50%; float:left;height:100px;\u0022\u003E\u003Cbb-h3\u003EPart 3:\u003C\/bb-h3\u003E \u003Ca href=\u0022https:\/\/brangerbriz.com\/blog\/lessons-learned-over-two-decades-of-developing-startups-measure-part3\u0022\u003E\u003C Measure\u003C\/a\u003E\u003C\/div\u003E\r\n\u003Cdiv style=\u0022width:50%; float:right;  text-align:right;height:100px;\u0022\u003E\u003C\/div\u003E\r\n\u003C\/bb-p\u003E","id":40,"name":"Description"},{"value":"https:\/\/twitter.com\/branger_briz\/status\/989164002348535809","id":169,"name":"Tweet Link"}]}]},{"name":"Featured Tag List","type":7,"id":7,"data":[],"child_component":[{"name":"Featured Tag List","type":7,"id":20,"data":[{"value":"Web Site","id":51,"name":"Tag"}]},{"name":"Featured Tag List","type":7,"id":22,"data":[{"value":"Experiential","id":51,"name":"Tag"}]},{"name":"Featured Tag List","type":7,"id":19,"data":[{"value":"Interactive","id":51,"name":"Tag"}]},{"name":"Featured Tag List","type":7,"id":21,"data":[{"value":"Mobile","id":51,"name":"Tag"}]},{"name":"Featured Tag List","type":7,"id":25,"data":[{"value":"CMS","id":51,"name":"Tag"}]},{"name":"Featured Tag List","type":7,"id":18,"data":[{"value":"Generative","id":51,"name":"Tag"}]},{"name":"Featured Tag List","type":7,"id":23,"data":[{"value":"WebGL","id":51,"name":"Tag"}]},{"name":"Featured Tag List","type":7,"id":27,"data":[{"value":"Machine Learning","id":51,"name":"Tag"}]},{"name":"Featured Tag List","type":7,"id":79,"data":[{"value":"Blockchain","id":51,"name":"Tag"}]}]},{"name":"Portfolio List","type":4,"id":2,"data":[],"child_component":[{"name":"Portfolio List","type":4,"id":29,"data":[{"value":"\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/c46c7d72f703369cafa74fffe59b322b","id":171,"name":"Social Media Thumbnail"},{"value":"\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/3d76dcfa3630b2011e3d6c3bfa37bac6","id":16,"name":"Header Image"},{"value":"sportsmanias","id":48,"name":"slug"},{"value":"Case Study","id":17,"name":"Post Type"},{"value":"SportsManias","id":8,"name":"Post Title"},{"value":"sports news startup platform","id":46,"name":"Post Sub Title"},{"value":" 2012 - current","id":20,"name":"year"},{"value":" http:\/\/sportsmanias.com\/","id":21,"name":"url"},{"value":" Web Dev, iOS + Android Dev,Design\/UX consultation, Infrastructure design + dev + maintenance","id":22,"name":"services"},{"value":" CLIO Short List 2017, Gold Addy Award (District)","id":23,"name":"recognition"},{"value":"2-3 million monthly views","id":24,"name":"results"},{"value":"","id":47,"name":"clients"},{"value":"1","id":9,"name":"Published"},{"value":"1","id":45,"name":"Feature on Home"},{"value":"06\/25\/2017","id":10,"name":"Created on"},{"value":"","id":12,"name":"Post Start"},{"value":"","id":13,"name":"Post End"},{"value":"SportsManias is a sports news aggregation platform that consists of multiple fronts including native iOS and Android mobile apps, an iOS animated emoji keyboard, and a desktop website.\r\n","id":14,"name":"Summary"},{"value":"\u003Cbb-p\u003E SportsManias is a sports news aggregation platform that consists of multiple fronts including native iOS and Android mobile apps, an iOS animated emoji keyboard, and a desktop website. \u003C\/bb-p\u003E\r\n\u003Cbb-p\u003E Back in 2011 SportsManias came to us with an idea. That was the start of a long partnership that continues today. We architected and developed the front-end, backend and infrastructure of what has become one of our more gratifying endeavors. \u003C\/bb-p\u003E\r\n\u003Cbb-quote credit=\u0022Aymara del Aguila, Co-founder\u0022\u003E \u0026quot;SportsManias has been recognized as a pioneering digital sports media company, largely due to the sophistication and reliability of the technology built by Branger Briz.\u0026quot; \u003C\/bb-quote\u003E \r\n\u003Cbb-p\u003E The systems integrates the twitter feed API, Youtube API, as well as 3rd party sports statistics integration, google knowledge base integration all running on a non relational database (MongoDB) and the CakePHP framework. it also pushes hundreds of thousands of push notifications daily, based on the specific teams followed by users. SportsManias currently handles roughly 500,000 users and 3.7 million sessions\/ month in the mobile app and over 900,000 users and 1 million session\/month on desktop. \u003C\/bb-p\u003E \r\n\u003Cbb-h2\u003EInfrastructure Design\u003C\/bb-h2\u003E\r\n\u003Cbb-h3\u003E Big Data \u003C\/bb-h3\u003E\r\n\u003Cbb-p\u003EDue to the huge amount of real time data that needed to be processed, we used Big Data techniques to handle the challenges of data capture, storage, analysis, data curation and querying. We process roughly 600 - 1200 tweets per minute, approximately 1 million per day. Since old news is no news, velocity is essential. The system processes a tweet in 30 - 600 milliseconds, during which time we receive the tweet, assign it to a team, follow its links in order to pull out the final article and\/or any videos and images, and finally serve it up to all relevant users. \u003C\/bb-p\u003E \r\n\u003Cbb-p\u003E In order to achieve this we use the latest in Non-relational databases (MongoDB) in combination with the use of Cloud Computing (AWS) for ease of scaling, performance, and flexibility. In addition the application of a Machine Learning classification algorithm (patented by SportsManias) and run through GPU computing, was used to guarantee quality topical content.\u003C\/bb-p\u003E \r\n\u003Cbb-h3\u003E Auto Scaling \u003C\/bb-h3\u003E\r\n\u003Cbb-p\u003EScalability is an important topic when designing website infrastructure for a startup. Thanks to the popularization of Cloud Computing over the last decade servers can be spun up in a matter of seconds and potentially setup in minutes. With SportsManias we\u0026#39;ve designed an auto-scaling architecture on AWS (Amazon Web Services) that increases the number of web servers, push notification servers and adds to the database cluster based on traffic volume among other parameters. This allows for the site to maintain only the minimum necessary server resources in order to handle sudden peaks while not breaking the bank during low traffic periods. \u003C\/bb-p\u003E \u003Cbb-media style=\u0022width: 550px;\u0022\u003E\u003Cimg src=\u0022https:\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/ee56dce93434cfca70bf7e5643ebbba0\u0022 \/\u003E \u003C\/bb-media\u003E\r\n\u003Cbb-h3\u003EDistributed Processing \u003C\/bb-h3\u003E\r\n\u003Cbb-p\u003EIn order to reduce system wide latency, processes are queued across different workers and run in parallel. \r\n\u003C\/bb-p\u003E","id":15,"name":"Post Content"},{"value":"[\u0022web site\u0022,\u0022mobile\u0022,\u0022web dev\u0022,\u0022app dev\u0022,\u0022aws\u0022,\u0022scalable architecture\u0022,\u0022php\u0022,\u0022social media\u0022,\u0022machine learning\u0022,\u0022cms\u0022,\u0022maintenance\u0022]","id":176,"name":"Tags"}]},{"name":"Portfolio List","type":4,"id":30,"data":[{"value":"\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/cdb74c531a8759af632aa6e6202f581b","id":171,"name":"Social Media Thumbnail"},{"value":"","id":16,"name":"Header Image"},{"value":"nike_cap_customizer","id":48,"name":"slug"},{"value":"Case Study","id":17,"name":"Post Type"},{"value":"Nike Cap Customizer","id":8,"name":"Post Title"},{"value":"3D product customizer","id":46,"name":"Post Sub Title"},{"value":" 2016 - current","id":20,"name":"year"},{"value":" http:\/\/nike.teamheadwear.com","id":21,"name":"url"},{"value":" Web Dev, Design\/UX consultation, 3D modeling, Maintenance","id":22,"name":"services"},{"value":" Silver Addy Award","id":23,"name":"recognition"},{"value":"","id":24,"name":"results"},{"value":" Paramount Apparel","id":47,"name":"clients"},{"value":"1","id":9,"name":"Published"},{"value":"0","id":45,"name":"Feature on Home"},{"value":"06\/25\/2017","id":10,"name":"Created on"},{"value":"","id":12,"name":"Post Start"},{"value":"","id":13,"name":"Post End"},{"value":"The Cap Customizer on Nike Team HeadWear allows you to create and order your own custom caps without leaving anything to your imagination.\r\n","id":14,"name":"Summary"},{"value":"\u003Cbb-p\u003EThe Cap Customizer on Nike Team HeadWear allows you to create and order your own custom caps without leaving anything to your imagination. Users are able to select a cap model and graphically customize color, fabric, clasps, eyelets, and upload and place your own logos and text. The user is able to see everything in place before placing the order. \u003C\/bb-p\u003E\r\n \u003Cbb-media style=\u0022width: 700px;\u0022\u003E\r\n\t\u003Cvideo width=\u0022700\u0022 height=\u0022400\u0022 autoplay loop \u003E\r\n\t\t\u003Csource src=\u0022http:\/\/cms.brangerbriz.com\/img\/assetsFile\/files\/2d40100a3362288a4508a45e68400cf5\u0022 type=\u0022video\/mp4\u0022\u003E\r\n\t\t\tYour browser does not support the video tag.\r\n\t\u003C\/video\u003E\r\n\u003C\/bb-media\u003E\r\n\u003Cbb-p\u003E We created the 3D customizer using \u003Ca href=\u0022https:\/\/threejs.org\/\u0022 target=\u0022_blank\u0022\u003Ethree.js\u003C\/a\u003E and \u003Ca href=\u0022https:\/\/en.wikipedia.org\/wiki\/WebGL\u0022 target=\u0022_blank\u0022\u003EwebGL\u003C\/a\u003E built on top of WordPress and integrated with the WooCommerce shopping cart. Thanks to html5 and three.js we\u0026#39;re now able to handle 3D in browser, something that was previously exclusively the domain of the proprietary plugins such as Flash or Silverlight. \u003C\/bb-p\u003E \r\n\u003Cbb-p\u003E The system was built to integrate into a multi-step sales workflow and allowing for variable pricing of the products based on customized selections. \u003C\/bb-p\u003E\r\n ","id":15,"name":"Post Content"},{"value":"[\u0022web site\u0022,\u0022webGL\u0022,\u0022web dev\u0022,\u0022php\u0022,\u0022threejs\u0022,\u0022cms\u0022,\u0022maintenance\u0022]","id":176,"name":"Tags"}]},{"name":"Portfolio List","type":4,"id":67,"data":[{"value":"[\u0022generative\u0022,\u0022interactive\u0022,\u0022web site\u0022,\u0022experiential\u0022,\u0022webGL\u0022,\u0022threejs\u0022,\u0022installation\u0022,\u00223D\u0022,\u0022play\u0022]","id":176,"name":"Tags"},{"value":"\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/73bad605d6a08a3628dbb219ffcb2dcb","id":171,"name":"Social Media Thumbnail"},{"value":"\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/a479d3c902d1d167ca93583aade6f9f3","id":16,"name":"Header Image"},{"value":"kinect-portraits","id":48,"name":"slug"},{"value":"1","id":9,"name":"Published"},{"value":"0","id":45,"name":"Feature on Home"},{"value":"","id":10,"name":"Created on"},{"value":"","id":12,"name":"Post Start"},{"value":"","id":13,"name":"Post End"},{"value":"Case Study","id":17,"name":"Post Type"},{"value":"Experimental 3D photo booth that captures stylized volumetric portraits and instantaneously uploads them to the net.","id":14,"name":"Summary"},{"value":"Kinect Portraits","id":8,"name":"Post Title"},{"value":"interactive kinect installation","id":46,"name":"Post Sub Title"},{"value":"\u003C!-- iframe won\u0027t show up until https is working on emerge.brangerbriz.com. \r\n\u003Ciframe noborder=\u0022\u0022 style=\u0022width:100%;padding:0\u0022 src=\u0022\/\/emerge.brangerbriz.com\/YPmb?frame=true\u0022 height=\u0022300\u0022\u003E\u003C\/iframe\u003E \r\n--\u003E\r\n\r\n\u003Cbb-h2\u003EThe Conference\u003C\/bb-h2\u003E\r\n\u003Cbb-p\u003E\r\nThe eMerge Americas conference partnered with Branger_Briz to create an experiential installation for their EXPO’s jumbotron highlighting one of the conference\u0027s central themes: “connect”, the networking opportunities that draw so many participants to the event. We wanted to make something that would fuse eMerge’s digital gradient aesthetic with the faces of the participants who attended the event.\r\n\u003C\/bb-p\u003E\r\n\r\n\u003Cbb-h2\u003EThe Installation\u003C\/bb-h2\u003E\r\n\r\n\u003Ciframe src=\u0022https:\/\/player.vimeo.com\/video\/170017534?color=ff0179\u0026amp;title=0\u0026amp;byline=0\u0026amp;portrait=0\u0022 webkitallowfullscreen=\u0022\u0022 mozallowfullscreen=\u0022\u0022 allowfullscreen=\u0022\u0022 width=\u0022640\u0022 height=\u0022360\u0022 frameborder=\u00220\u0022\u003E\u003C\/iframe\u003E\r\n\r\n\u003Cbb-p\u003E\r\nThe installation uses a Kinect depth sensor to create real-time 3D stylized portraits. Conference attendees dynamically shaped the aesthetic of their portraits through physical movement while being live streamed to six large screens hung in the Miami Beach Convention Center.  A number of agencies have started to deploy depth sensors in interactive pieces over the last handful of years but what sets this installation apart is its integration with the web. To our knowledge this project is the first of its kind to stream depth-data driven portraits directly to a web browser. Each participant\u0027s 3D snapshots are instantly uploaded to an interactive online gallery (\u003Ca href=\u0022http:\/\/emerge.brangerbriz.com\u0022 target=\u0022_blank\u0022\u003Eemerge.brangerbriz.com\u003C\/a\u003E) to be re-experienced and shared on social media.\r\n\u003C\/bb-p\u003E\r\n\r\n\u003Cbb-media fullwidth class=\u0022x-scope bb-media-1\u0022\u003E\r\n\u003Cimg src=\u0022https:\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/61a5809306531ce506b2e2aa8aefc0c8\u0022\u003E\r\n\u003C\/bb-media\u003E\r\n\r\n\u003Cbb-p\u003E\r\nSince its creation, the Kinect portraits installation has also appeared at the \u003Ca href=\u0022https:\/\/www.liveworx.com\u0022 target=\u0022_blank\u0022\u003ELiveWorx\u003C\/a\u003E \u002716 Internet of Things conference in Boston, MA as well as a \u003Ca href=\u0022http:\/\/www.manacontemporarychicago.com\/byob\/\u0022 target=\u0022_blank\u0022\u003EBring Your own Beamer (BYOB) event\u003C\/a\u003E in Chicago, IL.\r\n\u003C\/bb-p\u003E\r\n\r\n\r\n\r\n","id":15,"name":"Post Content"},{"value":"2016","id":20,"name":"year"},{"value":"http:\/\/emerge.brangerbriz.com","id":21,"name":"url"},{"value":"Concept Development, Design, Software Development, Installation","id":22,"name":"services"},{"value":"","id":23,"name":"recognition"},{"value":"","id":24,"name":"results"},{"value":"eMerge Americas","id":47,"name":"clients"}]},{"name":"Portfolio List","type":4,"id":63,"data":[{"value":"[\u0022interactive\u0022,\u0022experiential\u0022,\u0022installation\u0022,\u0022machine learning\u0022,\u0022museum\u0022]","id":176,"name":"Tags"},{"value":"\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/e0ad0dd90a27bc8f8185d7e03c7fd001","id":171,"name":"Social Media Thumbnail"},{"value":"\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/62e6cc62122bbb801143aa99fb6a621c","id":16,"name":"Header Image"},{"value":"masterpiece-me-miami-childrens-museum","id":48,"name":"slug"},{"value":"1","id":9,"name":"Published"},{"value":"1","id":45,"name":"Feature on Home"},{"value":"","id":10,"name":"Created on"},{"value":"","id":12,"name":"Post Start"},{"value":"","id":13,"name":"Post End"},{"value":"Case Study","id":17,"name":"Post Type"},{"value":"Photo booth and gallery that uses machine learning for real-time style transfer that allows children to apply six artistic “filters” to a live video of themselves.","id":14,"name":"Summary"},{"value":"Masterpiece Me","id":8,"name":"Post Title"},{"value":"AI style transfer photobooth","id":46,"name":"Post Sub Title"},{"value":"\u003Cbb-p\u003E\r\nThe Miami Children’s Museum approached us to create an interactive installation for their new exhibit All About Art. The exhibit focuses on teaching children about the elements of art, like color, form, line, shape, space, and texture, as well as expose visitors to broad movements and styles of art. Our team’s experience as artists ourselves informed the projects we proposed and made us perfect candidates to win the work. We were tasked with creating an installation that was engaging and educational, as well as offered the kids a chance to take a piece of their experience with the exhibit home with them.\r\n\u003C\/bb-p\u003E\r\n\u003Cbb-h2\u003EThe Experience\u003C\/bb-h2\u003E\r\n\u003Cbb-h3\u003EArtistic Style Transfer\u003C\/bb-h3\u003E\r\n\u003Cbb-p\u003E\r\n\u003Cimg src=\u0022https:\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/329008cbbcc42bfda62900ae35f6d64b\u0022 style=\u0022float:right;margin-bottom:50px;\u0022\u003EOur team has been closely following advancements in the field of machine learning and artificial intelligence. These techniques, applied to the domain of images, has seen great advancements in the last two years, especially in the task of artistic style transfer. This technique, only two years old, features the ability to separate artistic style from content, or subject matter. The ability to separating these semantic axis in images is an incredibly powerful technique, as it allows them to be manipulated independently. Artistic styles can be arbitrarily applied to photos to stylize them to look as if they were painted by Vincent Van Gogh, Pablo Picasso, or the early cave painters at Lascaux. \u003C\/bb-p\u003E\r\n\u003Cbb-media\u003E\r\n\u003Cimg src=\u0022https:\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/c54da9e16ed4e1ff52105778b98c60f2\u0022\u003E\r\n\u003C\/bb-media\u003E\r\n\u003Cbb-p\u003E\r\nThese techniques were a perfect fit for our contribution to the All About Art exhibit. We created a real-time style transfer photo booth and gallery that allows children to apply six artistic “filters” to a live video of themselves. These filters were algorithmically generated, or learned, from reference images of their corresponding styles: cubism, impressionism, pop art, mosaic, cave painting, and sketch. Kids can experiment with posing for different styles, and when they’re done, they can send themselves their stylized portraits via email. Photos that are taken are also added to the digital gallery wall in the exhibit and persist for a short while for others to see.\r\n\u003C\/bb-p\u003E\r\n\u003Cbb-media fullwidth\u003E\r\n\u003Cimg src=\u0022https:\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/5819a208b538c5655239aeeaeec2382b\u0022\u003E\r\n\u003C\/bb-media\u003E\r\n\r\n\u003Cbb-p\u003E\r\nIn addition to this work, we also created another installation in the same exhibit.\r\n\u003C\/bb-p\u003E\r\n\u003Cbb-p\u003E\r\nBranger_Briz would like to thank Leon Gatys, Alexander Ecker, Matthias Bethge, Justin Johnson, and Logan Enstrom for their open research in the domain of artistic style transfer.\r\n\u003C\/bb-p\u003E","id":15,"name":"Post Content"},{"value":"2017","id":20,"name":"year"},{"value":"","id":21,"name":"url"},{"value":"Concept Development, Design, Software Development, Installation","id":22,"name":"services"},{"value":"Regional Gold Addy Award","id":23,"name":"recognition"},{"value":"","id":24,"name":"results"},{"value":"Miami Children\u0027s Museum","id":47,"name":"clients"}]},{"name":"Portfolio List","type":4,"id":68,"data":[{"value":"[\u0022interactive\u0022,\u0022experiential\u0022,\u0022installation\u0022,\u00223D\u0022,\u0022play\u0022]","id":176,"name":"Tags"},{"value":"\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/39aa065540d3f57b60f1016656a0facf","id":171,"name":"Social Media Thumbnail"},{"value":"\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/c759335eb05d903386be5b68acf612f5","id":16,"name":"Header Image"},{"value":"sls-hotel","id":48,"name":"slug"},{"value":"1","id":9,"name":"Published"},{"value":"0","id":45,"name":"Feature on Home"},{"value":"12\/22\/2017","id":10,"name":"Created on"},{"value":"","id":12,"name":"Post Start"},{"value":"","id":13,"name":"Post End"},{"value":"Standard","id":17,"name":"Post Type"},{"value":"Monkey See, Monkey You is a large-scale interactive installation that provides a window into a fantastical world from the lobby of the SLS hotel. ","id":14,"name":"Summary"},{"value":"SLS Interactive Wall","id":8,"name":"Post Title"},{"value":"Monkey See, Monkey You","id":46,"name":"Post Sub Title"},{"value":"\r\n\u003C!--\r\n\u003Cbb-h2\u003EThe Installation\u003C\/bb-h2\u003E\r\n--\u003E\r\n\u003Cbb-p\u003E\r\n\u003Cbb-media\u003E\r\n\u003Ciframe src=\u0022https:\/\/player.vimeo.com\/video\/203242463?color=ff0179\u0026title=0\u0026byline=0\u0026portrait=0\u0022 width=\u0022640\u0022 height=\u0022360\u0022 frameborder=\u00220\u0022 webkitallowfullscreen mozallowfullscreen allowfullscreen\u003E\u003C\/iframe\u003E\r\n\u003C\/bb-media\u003E\r\n\u003Cimg src=\u0022https:\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/5958e85aea02242b7f9c393a2c5c60fa\u0022 style=\u0022float:right;width:40%;margin-right:0%;\u0022 \u003E\r\n\u003Ci\u003EMonkey See, Monkey\u003C\/i\u003E You is a large-scale interactive installation that provides a window into a fantastical world from the lobby of the SLS hotel. The piece draws inspiration from the company\u0027s logo, an elaborate etching of four monkeys climbing on a chandelier. We wanted to create an experience that leveraged the established branding of the client while introducing a fun and unique twist. At first glance, the hotel goer is confronted by a static painting-like scene of a lavishly decorated victorian room inhabited by statuesque monkeys frozen in human-like poses. However, the observant passerby will quickly notice that the monkeys seem to be aware of their surroundings, as their gaze seem to follow the movement in the lobby. \u003C\/bb-p\u003E\r\n\u003C\/bb-p\u003E\r\n\r\n\u003Cbb-media class=\u0022x-scope bb-media-0\u0022\u003E\r\n\u003Cimg src=\u0022https:\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/06f5856f0745ec999ab57efd0372f715\u0022\u003E\r\n\u003C\/bb-media\u003E\r\n\r\n\u003Cbb-p\u003EOnce the installation is approached, the monkeys come alive, and begin to playfully mimic the participant on the other side of the screen. As others approach the screen, the monkeys are released one-by-one from their positions and begin to imitate each person, learning their poses and movements. Through interaction, each person leaves their own imprint on the arrangement and poses of the monkeys once they have left the hotel.\u003C\/bb-p\u003E\r\n\r\n\u003Cbb-h2\u003EThe Process\u003C\/bb-h2\u003E\r\n\u003C!--\r\n\u003Cbb-media class=\u0022x-scope bb-media-0\u0022\u003E\r\n\u003Cimg src=\u0022https:\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/fdbd209aab0ae078e1c8b4bcf9e4fcf8\u0022\u003E\r\n\u003C\/bb-media\u003E\r\n--\u003E\r\n\u003Cbb-p\u003E\r\nWe worked iteratively with a team of 3D artists to bring the monkeys and their surrounding environment to life. From ideation to creation, we hand-crafted the look, feel, and behavior of the virtual world. Both the Victorian room and the monkey\u0027s that inhabit it were designed specifically for the the SLS hotel lobby. \r\n\u003C\/bb-p\u003E\r\n\u003C!--\r\n\u003Cbb-media class=\u0022x-scope bb-media-1\u0022\u003E\r\n\u003Cimg src=\u0022https:\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/c759335eb05d903386be5b68acf612f5\u0022\u003E\r\n\u003C\/bb-media\u003E\r\n--\u003E\r\n\u003Cbb-media class=\u0022x-scope bb-media-1\u0022\u003E\r\n\u003Cimg src=\u0022https:\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/20b5fbb906395191978eec1d4d6b5ce7\u0022\u003E\r\n\u003C!--\u003Cimg src=\u0022https:\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/748ce18cdf4cafd94b92cd222454b2a3\u0022\u003E--\u003E\r\n\u003C\/bb-media\u003E\r\n\r\n\u003Cbb-p\u003E\r\nThe monkey\u0027s were inspired by the spider monkey, the species that appears in the SLS logo. Their scale and features were adapted to be more human-like, allowing them to more easily mimic the people they interacted with in the hotel lobby.\r\n\u003C\/bb-p\u003E\r\n\u003C!--\r\n\u003Cbb-media class=\u0022x-scope bb-media-1\u0022\u003E\r\n\u003Cimg src=\u0022https:\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/6da67c1f5e087b2c4376711a5b8a049e\u0022\u003E\r\n\u003C\/bb-media\u003E\r\n--\u003E\r\n\u003Cbb-media caption=\u0022\u0022 class=\u0022x-scope bb-media-0\u0022\u003E\r\n\u003Cvideo src=\u0022https:\/\/cms.brangerbriz.com\/img\/assetsFile\/files\/c1153201abf2d8d371adfaf493223a1b\u0022 muted=\u0022\u0022 autoplay=\u0022\u0022 loop=\u0022\u0022\u003E\u003C\/video\u003E\r\n\u003Cdiv id=\u0022caption\u0022 class=\u0022style-scope bb-media\u0022 style=\u0022margin-left: 0px;\u0022\u003E\u003C\/div\u003E\r\n\u003C\/bb-media\u003E\r\n\r\n\u003C!-- This is an old process video. Not so professional IMHO.\r\n\u003Cbb-media\u003E\r\n\u003Ciframe src=\u0022https:\/\/player.vimeo.com\/video\/248483368\u0022 width=\u0022640\u0022 height=\u0022720\u0022 frameborder=\u00220\u0022 webkitallowfullscreen mozallowfullscreen allowfullscreen\u003E\u003C\/iframe\u003E\r\n\u003C\/bb-media\u003E--\u003E","id":15,"name":"Post Content"},{"value":"2016","id":20,"name":"year"},{"value":"","id":21,"name":"url"},{"value":"Concept Development, Interactive Software Development, Design, 3D","id":22,"name":"services"},{"value":"","id":23,"name":"recognition"},{"value":"","id":24,"name":"results"},{"value":"SLS Hotel","id":47,"name":"clients"}]},{"name":"Portfolio List","type":4,"id":66,"data":[{"value":"[\u0022interactive\u0022,\u0022experiential\u0022,\u0022installation\u0022,\u0022machine learning\u0022,\u0022play\u0022,\u0022museum\u0022]","id":176,"name":"Tags"},{"value":"\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/8dc9ec62ecc3988a2416a97bc53e3160","id":171,"name":"Social Media Thumbnail"},{"value":"\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/533eb5206a78432bbbfc4bf4c5117e6a","id":16,"name":"Header Image"},{"value":"interactive-mural-miami-childrens-museum","id":48,"name":"slug"},{"value":"1","id":9,"name":"Published"},{"value":"0","id":45,"name":"Feature on Home"},{"value":"","id":10,"name":"Created on"},{"value":"","id":12,"name":"Post Start"},{"value":"","id":13,"name":"Post End"},{"value":"Case Study","id":17,"name":"Post Type"},{"value":"Digital finger painting installation that uses machine learning to transform collaborative doodles into works of fine art. ","id":14,"name":"Summary"},{"value":"Interactive Mural","id":8,"name":"Post Title"},{"value":"Miami Children\u0027s Museum Installation","id":46,"name":"Post Sub Title"},{"value":"\u003Cbb-p\u003E\r\nThe Miami Children’s Museum approached us to create an interactive installation for their new exhibit All About Art. The exhibit focuses on teaching children about the elements of art, like color, form, line, shape, space, and texture, as well as expose visitors to broad movements and styles of art. Our team’s experience as artists ourselves informed the project we pitched and made us perfect candidates to win the work. We were tasked with creating an installation that was engaging and educational that offered the kids a chance to create artworks of their own.\r\n\u003C\/bb-p\u003E\r\n\r\n\u003Cbb-h2\u003EThe Experience\u003C\/bb-h2\u003E\r\n\u003Cbb-h3\u003EWhere Finger Painting and Machine Learning Intersect\u003C\/bb-h3\u003E\r\n\r\n\u003Cbb-media caption=\u0022\u0022 class=\u0022x-scope bb-media-0\u0022\u003E\r\n\u003Cvideo src=\u0022https:\/\/cms.brangerbriz.com\/img\/assetsFile\/files\/ae1de41224133da1e9c204931b02be9c\u0022 muted=\u0022\u0022 autoplay=\u0022\u0022 loop=\u0022\u0022\u003E\u003C\/video\u003E\r\n\u003Cdiv id=\u0022caption\u0022 class=\u0022style-scope bb-media\u0022 style=\u0022margin-left: 0px;\u0022\u003E\u003C\/div\u003E\r\n\u003C\/bb-media\u003E\r\n\r\n\u003Cbb-p\u003E\r\nWe wanted to create an experience that played to the strengths of children’s artistic tendencies. Finger painting is often the first artistic experience that children find themselves participating in, so we designed an installation that turns their simple doodles into detailed works of art in the style of famous painters and modern artists. The exhibit features two screens, the first is a large tabletop touchscreen where multiple children can draw together at the same time, collaborating to create an artwork. The second screen lies embedded in a gold frame propped up against an easel. The children can choose between three or four colors by touching the table with multiple fingers. One finger might be blue, two fingers green, three fingers brown, and so on. As the children draw on the tabletop, their simple doodle gets transformed into a work of fine art on the framed screen. Areas that children painted green may appear as grass on the finished screen, blue may become sky, and brown may become ground. \r\n\u003C\/bb-p\u003E\r\n\r\n\u003Cbb-p\u003E\r\nTo create this installation, we drew from the \u003Ca href=\u0022https:\/\/brangerbriz.com\/blog\/machine-learning-a-journey-towards-general-purpose-algorithms\u0022 target=\u0022_blank\u0022\u003Emachine learning experience\u003C\/a\u003E that our research and development lab has been gathering for the past year. The image transformation techniques we used have only been in development since 2016, and to the best of our knowledge, this is the first interactive art installation to use them.\r\n\u003C\/bb-p\u003E\r\n\r\n\u003Cbb-p\u003E\r\nIn addition to this work, we also created \u003Ca href=\u0022https:\/\/brangerbriz.com\/portfolio\/masterpiece-me-miami-childrens-museum\u0022 target=\u0022_blank\u0022\u003Eanother installation\u003C\/a\u003E in the same exhibit.\r\n\u003C\/bb-p\u003E\r\n\r\n\u003Cbb-p\u003E\r\nBranger_Briz would like to thank Alex J. Champandard and Dmitry Ulyanov for their open research in the domain of semantic style transfer. \r\n\u003C\/bb-p\u003E","id":15,"name":"Post Content"},{"value":"2017","id":20,"name":"year"},{"value":"","id":21,"name":"url"},{"value":"Concept Development, Design, Software Development, Installation","id":22,"name":"services"},{"value":"","id":23,"name":"recognition"},{"value":"","id":24,"name":"results"},{"value":"Miami Children\u0027s Museum","id":47,"name":"clients"}]},{"name":"Portfolio List","type":4,"id":33,"data":[{"value":"\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/84f88b7f248d2d1d45f7570a58214fc4","id":171,"name":"Social Media Thumbnail"},{"value":"\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/b36ecf6331925eeddfba0e812248d135","id":16,"name":"Header Image"},{"value":"zignum-spirit-animals","id":48,"name":"slug"},{"value":"Case Study","id":17,"name":"Post Type"},{"value":"Zignum Spirit Animals","id":8,"name":"Post Title"},{"value":"","id":46,"name":"Post Sub Title"},{"value":"2016","id":20,"name":"year"},{"value":"","id":21,"name":"url"},{"value":"concept development, design, fabrication, programing and installation","id":22,"name":"services"},{"value":"","id":23,"name":"recognition"},{"value":"","id":24,"name":"results"},{"value":"Zignum Mezcal (agency: Macias Advertising)","id":47,"name":"clients"},{"value":"1","id":9,"name":"Published"},{"value":"0","id":45,"name":"Feature on Home"},{"value":"06\/26\/2017","id":10,"name":"Created on"},{"value":"","id":12,"name":"Post Start"},{"value":"","id":13,"name":"Post End"},{"value":"Zignum Spirit Animals was a promotional platform created as a digital interactive installation using a Microsoft touchscreen app in combination with an iOS app.\r\n","id":14,"name":"Summary"},{"value":"\u003Cbb-p\u003E\r\n\u003Cbb-media fullwidth\u003E\u003Ciframe src=\u0022https:\/\/player.vimeo.com\/video\/203342771?color=ff0179\u0026title=0\u0026byline=0\u0026portrait=0\u0022 width=\u0022700\u0022 height=\u0022330\u0022 frameborder=\u00220\u0022 webkitallowfullscreen mozallowfullscreen allowfullscreen\u003E\u003C\/iframe\u003E\u003C\/bb-media\u003E\r\nZignum Spirit Animals is a promotional platform created as a digital interactive installation using a Microsoft touchscreen app in combination with an iOS app. Users are able to use the iOS app to enter personal information allowing them to determine their \u0026lsquo;spirit animal\u0026rsquo; according to the Oaxacan folk traditions (Zignum is a Oaxacan Mezcal liquor). The iOS app collects the data and sends it to a database online. The user is then able to \u0026ldquo;inhabit\u0026rdquo; their spirit animal on a large screen (and via large projection) and dance or cavort about through a Microsoft Kinect skeletal tracking system we designed and developed.\r\n\u003C\/bb-p\u003E\r\n\u003Cbb-media fullwidth\u003E\r\n\u003Cimg src=\u0022http:\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/b445c045cf538922bc39c2be41ce951e\u0022\u003E\r\n\u003C\/bb-media\u003E\r\n\u003Cbb-h3\u003EThe Concept\u003C\/bb-h3\u003E\r\n\u003Cbb-p\u003E\r\n\u003Cimg src=\u0022http:\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/edd4a9ec9552d0e03b7f73f944934a60\u0022 alt=\u0022Mesoamerican Astrology diagram on left, snail alebrije on right\u0022 width=\u0022400\u0022\u003E The concept combined ancient Mesoamerican Astrology with the relatively modern (begun in the 1930\u0027s) Mexican folkloric tradition of the \u003Ca href=\u0022https:\/\/en.wikipedia.org\/wiki\/Alebrije\u0022 target=\u0022_blank\u0022\u003EAlebrije\u003C\/a\u003E, and brought it all into the digital landscape.\r\n\r\n\r\n\u003C\/bb-p\u003E\r\n\u003Cbb-p\u003E\r\n\u003Cvideo width=\u0022200\u0022 height=\u0022332\u0022 autoplay=\u0022\u0022 loop=\u0022\u0022 style=\u0022float:left; left: -75px;margin-right: -25px;position: relative;\u0022\u003E\r\n\t\t\u003Csource src=\u0022http:\/\/cms.brangerbriz.com\/img\/assetsFile\/files\/d8a1259c5c69fed8edb695afdba9b17f\u0022 type=\u0022video\/mp4\u0022\u003E\r\n\t\t\tYour browser does not support the video tag.\r\n\t\u003C\/video\u003E\r\nThe astrological animal gods were reconceived as low polycount art, with a slightly more contemporary pattern and color scheme that very closely resembles the folkloric style.\r\n\r\n\u003C\/bb-p\u003E\r\n\r\n\u003Cbb-p\u003E\r\nAnd finally the models were rigged for use with kinect skeletal tracking. The end result was a mirror image of the participant\u0027s animal spirit looking back at them and mimicking their every move.\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E\r\n\u003C\/bb-p\u003E\r\n","id":15,"name":"Post Content"},{"value":"[\u0022interactive\u0022,\u0022experiential\u0022,\u0022app dev\u0022,\u0022installation\u0022,\u0022projection\u0022,\u00223D\u0022]","id":176,"name":"Tags"}]},{"name":"Portfolio List","type":4,"id":49,"data":[{"value":"[\u0022interactive\u0022,\u0022web site\u0022,\u0022webGL\u0022,\u0022web dev\u0022,\u0022threejs\u0022,\u0022digital literacy\u0022]","id":176,"name":"Tags"},{"value":"\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/ce08568d42377a71e9b845295d5b69e0","id":171,"name":"Social Media Thumbnail"},{"value":"\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/c80c38f0e39756fc20f00a55b441ad02","id":16,"name":"Header Image"},{"value":"threejs-playgnd","id":48,"name":"slug"},{"value":"Case Study","id":17,"name":"Post Type"},{"value":"Three.js _playGnd","id":8,"name":"Post Title"},{"value":"","id":46,"name":"Post Sub Title"},{"value":"2013","id":20,"name":"year"},{"value":"https:\/\/threejsplaygnd.brangerbriz.com\/","id":21,"name":"url"},{"value":"","id":22,"name":"services"},{"value":"Webby Awards official Nominee 2015, Gold W3 Award 2013, Silver W3 Award 2013","id":23,"name":"recognition"},{"value":" 190,000++ views, 4000++  contributions","id":24,"name":"results"},{"value":"","id":47,"name":"clients"},{"value":"1","id":9,"name":"Published"},{"value":"0","id":45,"name":"Feature on Home"},{"value":"07\/03\/2017","id":10,"name":"Created on"},{"value":"","id":12,"name":"Post Start"},{"value":"","id":13,"name":"Post End"},{"value":"A learning tool designed with experimental new media artists in mind and for anybody who learns more through playing and tinkering than by reading through loads of documentation and source code.\r\n","id":14,"name":"Summary"},{"value":"\u003Cbb-quote\u003E\r\n \t\t\t\tWhat started as an internal project for experimenting with webGL\/three.js turned into a public web app\r\n \t\t\t\u003C\/bb-quote\u003E\r\n \r\n \t\t\t\u003Cbb-p\u003E\r\n \t\t\t\tWhat started as an internal project for experimenting with webGL\/three.js turned into a public web app… well, not so much ‘app’ as ‘play ground’. The three.js _playGnd is exactly that, a space to play around with webGL\/three.js code; the latest in interactive and generative browser based 3D animations. More specifically, it’s a learning tool designed with experimental new media artists in mind and for anybody who learns more through playing and tinkering than by reading through loads of documentation and source code.\r\n \t\t\t\u003C\/bb-p\u003E\r\n \r\n \t\t\t\u003Cbb-p\u003E\r\n \t\t\t\tThe _playGnd was released in collaboration with the Creators Project who filmed a short doc (see below) and \u003Ca href=\u0022https:\/\/creators.vice.com\/en_us\/article\/nick-briz-webgl\u0022 target=“_blank”\u003Ewrote an article\u003C\/a\u003E featuring an initial group of artists who made work with the _playGnd before we officially released it to the public.\r\n \t\t\t\u003C\/bb-p\u003E\r\n \r\n \t\t\t\u003Ciframe width=\u0022560\u0022 height=\u0022315\u0022 src=\u0022https:\/\/www.youtube.com\/embed\/7yk1bWT8ulA\u0022 frameborder=\u00220\u0022 allowfullscreen\u003E\u003C\/iframe\u003E\r\n \r\n \t\t\t\u003Cbb-p\u003E\r\n \t\t\t\tThe _playGnd has three sections. First a \u003Ca href=\u0022http:\/\/threejsplayground.brangerbriz.net\/gui\/\u0022 target=“_blank”\u003EGraphical User Interface\u003C\/a\u003E for creating simple 3D shapes. Unlike most GUIs which obfuscate (or hide) the code behind the scenes, our GUI shows you the code behind the shapes you create with it. The code updates and changes in realtime as you play with the GUI so that you can start to get a sense for what the code looks like using a familiar interface.\r\n \t\t\t\u003C\/bb-p\u003E\r\n \r\n \t\t\t\u003Cbb-p\u003E\r\n \t\t\t\tNext you copy the code generated in the GUI into \u003Ca href=\u0022\/\/threejsplayground.brangerbriz.net\/editor\/editor.html\u0022 target=“_blank”\u003Ethe Editor\u003C\/a\u003E. Unlike traditional code editors, which only allow you to edit the code which you must later compile when finished to see the result, our Editor displays the result behind your code and it updates in real-time. This way you can play with your code, seeing how different changes affect your 3D scene in the moment and allow that to inform the direction your experimentation takes. The Editor also features snippets of code (small building blocks) you can copy+paste into your scene to get going quicker.\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E\r\n \t\t\t\u003C\/bb-p\u003E\r\n \r\n \t\t\t\u003C!-- NOTE: this slows down the page loading, so i\u0027m waiting for the page to load before loading this iframe\u0027s content --\u003E\r\n \t\t\t\u003C!-- ...Maybe there is a better solution for this? --\u003E\r\n \t\t\t\u003Ciframe noborder height=\u0022300\u0022 style=\u0022width:100%;padding:0\u0022 src=\u0022\/\/threejsplaygnd.brangerbriz.com\/editor\/#B\/pVVtb9s2EP6s\/Ipr9qFyq1BqsA6d4wRonTQpsGJBksLYp4GWzhZTSdRIKo4d+L\/vSFGynRcU3QS\/nI53z70f94IgGL06\/XN889flGeSmLE72LGuLQp45KhiVaDikOVcazfF+Y2YHH\/b9kTbLAls6mMpsCQ8tHUx5+n2uZFNlB6kspBrCLzP3HHmBkqu5qIaQdAx5h2pWyMUQcpFlWHn+ujUUbyyN4t63kbV5sud9SZWoDWiVHu\/H8VTxao5qqsSKpbKMCz7VsckV4q3+uy748rzK4lvPYqWo2K3ePyE7DuXk\/0CeosHUSPUyonc5EDMI4RX0CguczgsYbBg8y87RTHB6\/sdX1JrPMRwceeU7riDlJSoegU6xwggUVhkqVEcbiTlKqp9aRlByg0rwgijUeYcya6rUCFkBFbepwwFV0BfEak\/gGBaiyuSCiapCNRGZySO4eMS+QDHPTVfJzgsSqnABNxdXZ2fMxXDlT0J4gFqhRnWHp4oT1PxTM5shtYlRDcIaBo\/BGG+MHBfI1dj2E2HPeKHxiRiFcS1WGMLEutnDZDJtSqwMsx3DeF2T\/DgXRRb2SWOZLM8KtFLQJzloM7wTyiUqXVN9xB2O3WkI75MIJvFFBO\/ok9CzsdwCsFpqYfPMVoT1Pkl6A650O\/jXluPq7EVmFG8Ith6CBJMj+htZM5Z4+xYG\/dTRVNUk0cJ8KaldvhlRaFZInt3gvWkUhq8Zi01Lr2Itm5rd1vPXvbtB1zA7Lo2XhbBZOveHIVl3kUZw+Nvv7N1h5FJgv64sG7iu63bgqJfzT1yL9Ks\/DR90zjNqg6GX+Fxwc92yIvAbJLlvV4ht5Xpof9ZbdgjyiY3wafdve1azheL1Nal19E2fvSuskZsJ8WryYUdJuSPbaaGrN+x6sSn1PaFRhDmjxUHNRcP1xnUHHLQd8KzS8r8orX5CSUnDX3TvkL6Od\/nlBa3n\/Pux1nMOvqilU16gc2\/rdbn7agET9uuHXtPNkV2YoRPbFGXdzdH68crLaPVsbzyF\/zSozcdKlM7rz4pmN3RiTzbCM7nXogrhlPqMVXLhIkxYkhyCpbYn3gMUUn7\/aMKdQm6s9FupJcJuxft91At2Qfn17YNuI\/MymyuovT7bS9OR3X3\/Lw==\u0022\u003E\u003C\/iframe\u003E\r\n \r\n \t\t\t\u003Cbb-p\u003E\r\n \t\t\t\tThe last section is \u003Ca href=\u0022http:\/\/threejsplayground.brangerbriz.com\/archive\/\u0022 target=“_blank”\u003Ethe Archive\u003C\/a\u003E. After creating a sketch you have the option to add it to our Archive. There you can view sketches others have made, copy embeddable links to share your sketch on your blog or website (see example above) as well as remix the sketches others have made and contributed to the Archive. To us having the ability to view and remix the work of others is just as important to the learning process as a well designed GUI and Editor is. At the time of this writing the Archive has received over 4000 contributions from artists around the world.\r\n \t\t\t\u003C\/bb-p\u003E\r\n \r\n \t\t\t\u003Cbb-quote\u003E\r\n \t\t\t\tthe ability to view and remix the work of others is just as important to the learning process\r\n \t\t\t\u003C\/bb-quote\u003E\r\n \r\n \t\t\t\u003Cbb-p\u003E\r\n \t\t\t\tThree.js _playGnd is an open source project, the source code for which can be found on \u003Ca href=\u0022https:\/\/github.com\/nbriz\/threejs_playGnd\u0022 target=“_blank”\u003Eour github repo\u003C\/a\u003E. The _playGnd has been used by educators at various institutions to teach WebGL to art students. The _playGnd itself as well as a \u003Ca href=\u0022http:\/\/threejsplayground.brangerbriz.net\/nfo\/\u0022 target=“_blank”\u003Ethree part video tutorial\u003C\/a\u003E is available on the project website: \u003Ca href=\u0022http:\/\/threejsplayground.brangerbriz.com\/“ target=“_blank”\u003Ehttp:\/\/threejsplayground.brangerbriz.net\/\u003C\/a\u003E\r\n \t\t\t\u003C\/bb-p\u003E","id":15,"name":"Post Content"}]},{"name":"Portfolio List","type":4,"id":71,"data":[{"value":"[\u0022interactive\u0022,\u0022experiential\u0022,\u0022app dev\u0022,\u0022installation\u0022,\u0022digital literacy\u0022,\u0022open source\u0022]","id":176,"name":"Tags"},{"value":"\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/4fe4f173e51031dae66b46a9f466c3e8","id":171,"name":"Social Media Thumbnail"},{"value":"\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/3f48cb848627efe7e47a61fa9213aeb3","id":16,"name":"Header Image"},{"value":"webroutes","id":48,"name":"slug"},{"value":"1","id":9,"name":"Published"},{"value":"0","id":45,"name":"Feature on Home"},{"value":"","id":10,"name":"Created on"},{"value":"","id":12,"name":"Post Start"},{"value":"","id":13,"name":"Post End"},{"value":"Case Study","id":17,"name":"Post Type"},{"value":"WebRoutes is a critical artware project that provides visitors with a window into the Internet infrastructure and geopolitical network topology that is inherently invisible to them as they browse the web.","id":14,"name":"Summary"},{"value":"WebRoutes","id":8,"name":"Post Title"},{"value":"","id":46,"name":"Post Sub Title"},{"value":"\u003Cbb-p\u003E\r\nWebRoutes is a critical artware project that provides visitors with a window into the Internet infrastructure and geopolitical network topology that is inherently invisible to them as they browse the web. Viewing a website is much more than an exchange between you and that website. WebRoutes illustrates how every HTTP request can mean crossing country borders and interacting with dozens of companies who own and control portions of Internet infrastructure a webpage must use to get to your computer. By visualizing an augmented traceroute process, WebRoutes identifies the Autonomous Networks (AS), ISPs, Internet Exchange Point (IXP) crossings, and Submarine Cables that work together to ping-pong TCP\/IP packets back and forth from web browsers to servers.\r\n\u003C\/bb-p\u003E\r\n\r\n\r\n\u003Cbb-media fullwidth\u003E\r\n\u003Cimg src=\u0022http:\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/2a0129adf415a894eb736c0211293849\u0022\u003E\r\n\u003C\/bb-media\u003E\r\n\r\n\u003Cbb-p\u003E\r\nBy elongating a process that usually takes milliseconds, WebRoutes allows users to follow, analyze, and draw conclusions about the intricate, often counter-intuitive, paths their packets take on their journey through the Internet. For example, you might find it strange that in the example recording below a request is made for facebook.com in the US which takes a long detour over the Ireland, wonder \u003Ca href=\u0022https:\/\/www.independent.co.uk\/news\/business\/news\/how-does-facebook-avoid-paying-tax-and-what-will-the-changes-mean-a6912731.html\u0022 target=\u0022_blank\u0022\u003Ewhy that might be?\u003C\/a\u003E\r\n\u003C\/bb-p\u003E\r\n\r\n\u003Cbb-media\u003E\r\n\u003Ciframe src=\u0022https:\/\/player.vimeo.com\/video\/254960852?autoplay=1\u0022 width=\u0022640\u0022 height=\u0022480\u0022 frameborder=\u00220\u0022 webkitallowfullscreen mozallowfullscreen allowfullscreen\u003E\u003C\/iframe\u003E\r\n\u003C\/bb-media\u003E\r\n\r\n\u003Cbb-p\u003E\r\nWebRoutes was shown at the International Symposium of Mixed and Augmented Reality (ISMAR 2016) in Mérida, México as well as the Radical Networks Conference in New York City.\r\n\u003C\/bb-p\u003E\r\n\r\n\u003Cbb-media\u003E\r\n\u003Cimg src=\u0022https:\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/0b466e64bacc953531cbe8e18408e9fc\u0022\u003E\r\n\u003C\/bb-media\u003E","id":15,"name":"Post Content"},{"value":"2016","id":20,"name":"year"},{"value":"https:\/\/github.com\/brangerbriz\/webroutes","id":21,"name":"url"},{"value":"","id":22,"name":"services"},{"value":"","id":23,"name":"recognition"},{"value":"","id":24,"name":"results"},{"value":"","id":47,"name":"clients"}]},{"name":"Portfolio List","type":4,"id":52,"data":[{"value":"[\u0022interactive\u0022,\u0022experiential\u0022,\u0022app dev\u0022,\u0022installation\u0022,\u0022open source\u0022,\u0022museum\u0022]","id":176,"name":"Tags"},{"value":"\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/46b6ad365e05507b3459812e0188b17a","id":171,"name":"Social Media Thumbnail"},{"value":"\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/bda852f05ebbc45cef00e7a24be0ab72","id":16,"name":"Header Image"},{"value":"virtual-public-network","id":48,"name":"slug"},{"value":"Case Study","id":17,"name":"Post Type"},{"value":"Virtual Public.Network","id":8,"name":"Post Title"},{"value":"","id":46,"name":"Post Sub Title"},{"value":"2015","id":20,"name":"year"},{"value":"http:\/\/virtualpublic.network","id":21,"name":"url"},{"value":"Concept Development, Software Development, Installation, Artist Curation","id":22,"name":"services"},{"value":"","id":23,"name":"recognition"},{"value":"","id":24,"name":"results"},{"value":"Museum of Contemporary Art Chicago, Museums and the Web Conference","id":47,"name":"clients"},{"value":"1","id":9,"name":"Published"},{"value":"0","id":45,"name":"Feature on Home"},{"value":"","id":10,"name":"Created on"},{"value":"","id":12,"name":"Post Start"},{"value":"","id":13,"name":"Post End"},{"value":"In collaboration with the Museum of Contemporary Art Chicago for the Museums and the Web conference we developed custom software that allowed artists to stream their desktops to each other via a multi screen sharing app which simultaneously streamed their individual desktops into a physical installation on display at the conference.","id":14,"name":"Summary"},{"value":"\u003Cbb-quote credit=\u0022Vince Dziekan (The ABC’s of cultural curating)\u0022\u003EThis distributed artwork used custom software to bring artists from Chicago’s experimental new media community together for one night in a virtual desktop chat room to play, experiment, perform, and (screen)share.\u003C\/bb-quote\u003E\r\n\r\n\r\n\t\t\t\u003Cbb-h2\u003EThe Task\u003C\/bb-h2\u003E\r\n\r\n\t\t\t\u003Cbb-p\u003E\r\n\t\t\t\tThe Museum of Contemporary Art Chicago (MCA) commissioned us to produce an art installation for the Museums and the Web (MW) conference, a leading worldwide conference that examines the confluence of technology and museum practice, which attracts technologists and museum professionals from around the world. The MCA specifically invited us to conceive a project which would “show off the Chicago digital scene to (the) international visitors” attending the MW conference being held in Chicago that year. More specifically, they wanted a project that would not only exhibit works by the local artists involved in what has come to be known as the “Chicago dirty new media” scene, but also showcase this community’s particular style which, though diverse, consists of a “dirty”, critical, DIY approach to new technologies.\r\n\t\t\t\u003C\/bb-p\u003E\r\n\r\n\r\n\t\t\t\u003Cbb-h2\u003EThe Concept\u003C\/bb-h2\u003E\r\n\r\n\t\t\t\u003Cbb-p\u003E\r\n\t\t\t\tA common theme among these artists is their creative use of desktops. For new media artists generally, their desktop is akin to their studio. Artists\/curators have long highlighted this fact in online exhibitions from Alexi Shulgin’s \u003Ca href=\u0022http:\/\/rhizome.org\/artbase\/artwork\/1720\/?ref=search_title\u0022 target=\u0022_blank\u0022\u003EDesktop.Is\u003C\/a\u003E project (1997) to Adam Cruces’ \u003Ca href=\u0022http:\/\/rhizome.org\/artbase\/artwork\/53851\/?ref=search_title\u0022 target=\u0022_blank\u0022\u003EDesktop Views\u003C\/a\u003E (2012). The chicago artists often go further and perform with their desktops, opening and closing folders spastically and moving windows around like their dancing, what artist Jon Satrom refers to as “prepared desktops.” For this reason we proposed making custom software that would stream the various desktop feeds of participating artists to each other and into a collaborative “prepared desktop” installation a the conference.\r\n\t\t\t\u003C\/bb-p\u003E\r\n\r\n\t\t\t\u003Cbb-h2\u003EThe Result\u003C\/bb-h2\u003E\r\n\r\n\t\u003Cbb-media caption=\u0022setting up the installation at the Palmer House\u0022\u003E\r\n\t\t\t\t\u003Cvideo src=\u0022http:\/\/cms.brangerbriz.com\/img\/assetsFile\/files\/61e2a4fc049a1e3ccd175abbc25fad8d\u0022 muted autoplay loop\u003E\u003C\/video\u003E\r\n\t\t\t\u003C\/bb-media\u003E\r\n\r\n\t\t\t\u003Cbb-p\u003E\r\n\t\t\t\tVirtualPublic.Network (VP.N) was part custom screen-sharing software and part physical installation. The name was a play on “Virtual Private Network” technology used to privately connect remote computers together. Our “distributed artwork used custom software to bring artists from Chicago’s experimental new media community (many of which no longer physically reside locally) together for one night in a virtual desktop chat room to play, experiment, perform, and (screen)share. The resulting collaborative desktop performance existed simultaneously online across the artists’ networked computers as well as physically as a site-specific media installation using a collection of locally sourced CRT monitors” \u003Cbb-note info=\u0027From \u003Ca href=\u0022https:\/\/mw17.mwconf.org\/paper\/the-abcs-of-cultural-curating\/\u0022\u003EThe ABCs Of Cultural Curating\u003C\/a\u003E by Vince Dziekan, Monash University, Australia\u0027\u003E\u003C\/bb-note\u003E The physical installation, like the concept itself, took its aesthetic queues from the installations of the featured artists, which tend to use antiquated hardware in a messy patchwork of cables and miscellaneous gadgets. In fact the monitors used in the installation were sourced from a couple of the participating artists.\r\n\t\t\t\u003C\/bb-p\u003E\r\n\r\n\u003Cbb-media\u003E\u003Cimg src=\u0022http:\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/ee56dce93434cfca70bf7e5643ebbba0\u0022\u003E\u003C\/bb-media\u003E\r\n\r\n\t\t\t\u003Cbb-p\u003E\r\n\t\t\t\tThe custom screen sharing software \u003Cbb-note info=\u0027the \u003Ca href=\u0022https:\/\/github.com\/brangerbriz\/VirtualPublicNetwork\u0022\u003Esource code\u003C\/a\u003E is available on our github\u0027\u003E\u003C\/bb-note\u003E sent to over 40 participating artists allowed them to stream their desktops onto one of the monitors in the installation (via Raspberry Pi’s\u003Cbb-note info=\u0022The Raspberry Pi is a series of small\/cheap computers developed to promote basic computer science. They have also become the go-to installation computer for DIY digital artists\u0022\u003E\u003C\/bb-note\u003E) while at the same time allowing them to see the other artists currently streaming alongside with them. “These screen environments presented multi-modal forms of communication ranging from sound, text, image, and video. While highly personalized and idiosyncratic, in large part, a \u0027desktop aesthetic\u0027 of cascading frames, text editor windows, workspaces of software applications and video players floating above \u0027wallpaper\u0027 backgrounds served as a unifying visual vernacular. In certain cases, responsive actions were precipitated between the \u0027performing\u0027 artist and members of the audience assembled at the Palmer House in Chicago relayed via webcams and live chat protocols. The effect created from the media mix of proprietary software workspaces, media sharing and social media platforms, serving both live and recorded media, was that temporal and spatial boundaries had been eclipsed by a state of shared, consensual connectivity.”\u003Cbb-note info=\u0027From \u003Ca href=\u0022https:\/\/mw17.mwconf.org\/paper\/the-abcs-of-cultural-curating\/\u0022\u003EThe ABCs Of Cultural Curating\u003C\/a\u003E by Vince Dziekan, Monash University, Australia\u0027\u003E\u003C\/bb-note\u003E\r\n\t\t\t\u003C\/bb-p\u003E\r\n\r\n\u003Cbb-media caption=\u0022over 40 artists stream into the conference and collaborate with each other in a networked desktop performance throughout the evening\u0022\u003E\r\n\t\t\t\t\u003Cvideo src=\u0022http:\/\/cms.brangerbriz.com\/img\/assetsFile\/files\/319c37652621d4138a493bbbdca11d49\u0022 muted autoplay loop\u003E\u003C\/video\u003E\r\n\t\t\t\u003C\/bb-media\u003E\r\n\r\n\t\t\t\u003Cbb-p\u003E\r\n\t\t\t\tAll participating artists were credited in real-time during their respective performances as part of the physical installation, here’s the complete list of those who participated throughout the evening:\r\n\t\t\t\t\u003Ca href=\u0022http:\/\/tamaskemenczy.net\/\u0022 target=\u0022_blank\u0022\u003ETamas Kemenczy\u003C\/a\u003E,\r\n\t\t\t\t\u003Ca href=\u0022http:\/\/ryandunn.net\/\u0022 target=\u0022_blank\u0022\u003ERyan T Dunn\u003C\/a\u003E,\r\n\t\t\t\t\u003Ca href=\u0022http:\/\/www.theodoredarst.net\/\u0022 target=\u0022_blank\u0022\u003ETheodore Darst\u003C\/a\u003E,\r\n\t\t\t\t\u003Ca href=\u0022#\u0022 target=\u0022_blank\u0022\u003EAmanda Gutierrez\u003C\/a\u003E,\r\n\t\t\t\t\u003Ca href=\u0022http:\/\/robray.net\u0022 target=\u0022_blank\u0022\u003ERob Ray\u003C\/a\u003E,\r\n\t\t\t\t\u003Ca href=\u0022http:\/\/sarahrooney.net\/\u0022 target=\u0022_blank\u0022\u003ESarah Rooney\u003C\/a\u003E,\r\n\t\t\t\t\u003Ca href=\u0022https:\/\/vimeo.com\/monicapanzarino\u0022 target=\u0022_blank\u0022\u003EMonica Panzarino\u003C\/a\u003E\r\n\t\t\t\t\u003Ca href=\u0022http:\/\/salazarcaro.tumblr.com\/\u0022 target=\u0022_blank\u0022\u003EAlfredo Salazar-Caro\u003C\/a\u003E,\r\n\t\t\t\t\u003Ca href=\u0022http:\/\/violetsystems.tumblr.com\/\u0022 target=\u0022_blank\u0022\u003Eviolet systems\u003C\/a\u003E\r\n\t\t\t\t\u003Ca href=\u0022http:\/\/rosa-menkman.blogspot.nl\/\u0022 target=\u0022_blank\u0022\u003ERosa Menkman\u003C\/a\u003E,\r\n\t\t\t\t\u003Ca href=\u0022http:\/\/nickbriz.com\/\u0022 target=\u0022_blank\u0022\u003ENick Briz \u003C\/a\u003E\r\n\t\t\t\t\u003Ca href=\u0022http:\/\/hannahmchugh.com\/\u0022 target=\u0022_blank\u0022\u003EHannah J McHugh\u003C\/a\u003E,\r\n\t\t\t\t\u003Ca href=\u0022#\u0022 target=\u0022_blank\u0022\u003EGrayson Bagwell\u003C\/a\u003E,\r\n\t\t\t\t\u003Ca href=\u0022http:\/\/mark-beasley.com\/\u0022 target=\u0022_blank\u0022\u003EMark Beasley \u003C\/a\u003E\r\n\t\t\t\t\u003Ca href=\u0022#\u0022 target=\u0022_blank\u0022\u003EJamie Theophilos\u003C\/a\u003E,\r\n\t\t\t\t\u003Ca href=\u0022http:\/\/ignot.us\/\u0022 target=\u0022_blank\u0022\u003EPaul Hertz\u003C\/a\u003E,\r\n\t\t\t\t\u003Ca href=\u0022#\u0022 target=\u0022_blank\u0022\u003EAlex Halbert\u003C\/a\u003E,\r\n\t\t\t\t\u003Ca href=\u0022http:\/\/master-list2000.com\/abillmiller\/\u0022 target=\u0022_blank\u0022\u003EA Bill Miller\u003C\/a\u003E,\r\n\t\t\t\t\u003Ca href=\u0022http:\/\/jonchambersart.com\/\u0022 target=\u0022_blank\u0022\u003EJon Chambers\u003C\/a\u003E\r\n\t\t\t\t\u003Ca href=\u0022http:\/\/jeffkolar.us\u0022 target=\u0022_blank\u0022\u003EJeff Kolar\u003C\/a\u003E,\r\n\t\t\t\t\u003Ca href=\u0022http:\/\/kevinkevincarey.com\u0022 target=\u0022_blank\u0022\u003EKevin Carey\u003C\/a\u003E,\r\n\t\t\t\t\u003Ca href=\u0022http:\/\/machinemachine.net\/\u0022 target=\u0022_blank\u0022\u003EDaniel Rourke\u003C\/a\u003E,\r\n\t\t\t\t\u003Ca href=\u0022http:\/\/paulalalalalalalalalalalalalalalalalalalalalalalalalalalalalala.land\/\u0022 target=\u0022_blank\u0022\u003EPaula Nacif\u003C\/a\u003E,\r\n\t\t\t\t\u003Ca href=\u0022http:\/\/www.lalavgen.com\/\u0022 target=\u0022_blank\u0022\u003ELal Avgen\u003C\/a\u003E,\r\n\t\t\t\t\u003Ca href=\u0022http:\/\/benbakersmith.com\/\u0022 target=\u0022_blank\u0022\u003EBen Baker-Smith\u003C\/a\u003E,\r\n\t\t\t\t\u003Ca href=\u0022http:\/\/www.morganhigbyflowers.com\/\u0022 target=\u0022_blank\u0022\u003EMorgan higby-flowers\u003C\/a\u003E\r\n\t\t\t\t\u003Ca href=\u0022#\u0022 target=\u0022_blank\u0022\u003EDomenico Barra\u003C\/a\u003E,\r\n\t\t\t\t\u003Ca href=\u0022#\u0022 target=\u0022_blank\u0022\u003EAaron Zarzutzki\u003C\/a\u003E,\r\n\t\t\t\t\u003Ca href=\u0022http:\/\/emilyemily.org\/\u0022 target=\u0022_blank\u0022\u003EEmily Kuehn\u003C\/a\u003E,\r\n\t\t\t\t\u003Ca href=\u0022http:\/\/www.shawnemichaelainholloway.com\/\u0022 target=\u0022_blank\u0022\u003EShawné Michaelain Holloway\u003C\/a\u003E\r\n\t\t\t\t\u003Ca href=\u0022http:\/\/jsoliday.com\/\u0022 target=\u0022_blank\u0022\u003EJason Soliday\u003C\/a\u003E,\r\n\t\t\t\t\u003Ca href=\u0022http:\/\/systemsapproach.net\/\u0022 target=\u0022_blank\u0022\u003EjonCates\u003C\/a\u003E,\r\n\t\t\t\t\u003Ca href=\u0022http:\/\/jameshconnolly.com\/\u0022 target=\u0022_blank\u0022\u003EJames Connolly\u003C\/a\u003E,\r\n\t\t\t\t\u003Ca href=\u0022http:\/\/nickkegeyan.com\/\u0022 target=\u0022_blank\u0022\u003ENick Kegeyan\u003C\/a\u003E\r\n\t\t\t\t\u003Ca href=\u0022http:\/\/armpitrubber.net\/\u0022 target=\u0022_blank\u0022\u003EChristine Janokowicz\u003C\/a\u003E,\r\n\t\t\t\t\u003Ca href=\u0022http:\/\/www.lab404.com\/\u0022 target=\u0022_blank\u0022\u003ECurt Cloninger\u003C\/a\u003E,\r\n\t\t\t\t\u003Ca href=\u0022https:\/\/vimeo.com\/user2418626\u0022 target=\u0022_blank\u0022\u003EDavid Musgrave\u003C\/a\u003E\r\n\t\t\t\t\u003Ca href=\u0022http:\/\/lastdayonearth.info\/\u0022 target=\u0022_blank\u0022\u003EWill Robertson\u003C\/a\u003E,\r\n\t\t\t\t\u003Ca href=\u0022http:\/\/www.hellocatfood.com\/\u0022 target=\u0022_blank\u0022\u003EAntonio Roberts\u003C\/a\u003E,\r\n\t\t\t\t\u003Ca href=\u0022http:\/\/jonsatrom.com\/\u0022 target=\u0022_blank\u0022\u003Ejon.satrom\u003C\/a\u003E,\r\n\t\t\t\t\u003Ca href=\u0022http:\/\/melissabarron.net\/\u0022 target=\u0022_blank\u0022\u003EMelissa Barron\u003C\/a\u003E,\r\n\t\t\t\t\u003Ca href=\u0022http:\/\/jonesypop.com\/\u0022 target=\u0022_blank\u0022\u003ESamuel Harry Goldstein\u003C\/a\u003E,\r\n\t\t\t\t\u003Ca href=\u0022http:\/\/yolk.cc\/\u0022 target=\u0022_blank\u0022\u003EJoseph Chiocchi\u003C\/a\u003E,\r\n\t\t\t\t\u003Ca href=\u0022http:\/\/ilichnoise.net\u0022 target=\u0022_blank\u0022\u003EIllich Torres \u003C\/a\u003E\r\n\t\t\t\t\u003Ca href=\u0022#\u0022 target=\u0022_blank\u0022\u003EAlp Seyrekbasan\u003C\/a\u003E,\r\n\t\t\t\t\u003Ca href=\u0022http:\/\/andrewrosinski.com\/\u0022 target=\u0022_blank\u0022\u003EAndrew Rosinski\u003C\/a\u003E and \r\n\t\t\t\t\u003Ca href=\u0022http:\/\/noisecrush.com\/\u0022 target=\u0022_blank\u0022\u003ELisa Slodki\u003C\/a\u003E\r\n\t\t\t\u003C\/bb-p\u003E\r\n\r\n\r\n\t\t\t\u003Cbb-quote credit=\u0022Vince Dziekan (The ABC’s of cultural curating)\u0022\u003EThe experimental works of artists like Branger_Briz revive the participatory social concepts of their telecollaborative arts predecessors. Their practice (...) reflects upon the medial and social processes of our times by drawing upon various forms of mediated communications and mixed reality spaces linked to the Internet.\u003C\/bb-quote\u003E","id":15,"name":"Post Content"}]},{"name":"Portfolio List","type":4,"id":43,"data":[{"value":"\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/4853a6eb4106993c7c2a546775f1e382","id":171,"name":"Social Media Thumbnail"},{"value":"\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/a28eb89c3119a1c267ff13522703aedc","id":16,"name":"Header Image"},{"value":"charge-for-privacy","id":48,"name":"slug"},{"value":"Case Study","id":17,"name":"Post Type"},{"value":"A Charge for Privacy","id":8,"name":"Post Title"},{"value":"","id":46,"name":"Post Sub Title"},{"value":"2011-2013","id":20,"name":"year"},{"value":"","id":21,"name":"url"},{"value":"Concept Development, GUI Design, Fabrication, Programming and Installation","id":22,"name":"services"},{"value":"Gold Addy, 3 Gold Creativity International Awards, Charlie Award, Creativity-Online Editor\u0027s Pick,  Creator\u0027s Project, PSFK, Neuberger Museum of Art in Purchase, NY and at ISMAR in Munich.","id":23,"name":"recognition"},{"value":"","id":24,"name":"results"},{"value":"","id":47,"name":"clients"},{"value":"1","id":9,"name":"Published"},{"value":"0","id":45,"name":"Feature on Home"},{"value":"06\/26\/2017","id":10,"name":"Created on"},{"value":"","id":12,"name":"Post Start"},{"value":"","id":13,"name":"Post End"},{"value":"A conceptual art installation created to highlight the lack of attention paid to privacy policies and terms and conditions by most individuals.\r\n","id":14,"name":"Summary"},{"value":"\u003Cbb-p\u003E\u003Ciframe frameborder=\u00220\u0022 height=\u0022424\u0022 src=\u0022https:\/\/player.vimeo.com\/video\/34575655\u0022 width=\u0022640\u0022\u003E\u003C\/iframe\u003E\r\n\u003C\/bb-p\u003E\r\n\r\n\u003Cbb-p\u003EThe piece was originally an installation for Art Basel and is a reminder that nothing online is really “free.” We often forget (or might not even realize) that the online services we depend on for our most intimate and private exchanges (Facebook, Gmail, etc) are not exactly “free” nor are they exactly “private.” \r\n\u003C\/bb-p\u003E\r\n\u003Cbb-p\u003E\r\nEvery word you email to your family and every link you share with your friends is being archived, indexed and monetized, either in the form of targeted ads and\/or other data-mining ventures. Sometimes these institutions encroach a bit too much on our most private data and when those that notice make a stink about it they get accused of being miscreants or at best get an, “Ooops, we’re sorry we invaded your privacy like that.” Like it or not, this is the normative economic exchange for services online today, privacy is the currency of our digital ecology. \u003C\/bb-p\u003E\r\n\u003Cbb-quote credit=\u0022Creativity-Online\u0022\u003E\u0026ldquo;Charge but beware [...] reminds everyone nothing is \u0026lsquo;free\u0026rsquo;, especially not online\u0026hellip;\u0026rdquo;\u003C\/bb-quote\u003E\r\n\u003Cbb-p\u003E\r\nA Charge For Privacy attempts to recreate this relationship by offering a utility, essentially an iPhone charging station, at the cost of privacy. Basel goers are welcome to charge their cell phones at the station, but not without agreeing to the Terms of Use (written all along the sides of the station). When an iPhone is plugged in the station proceeds to download all the photos stored on the phone. These terms make clear the exchange, ” […] You (b) grant Branger_Briz an irrevocable, perpetual, non-exclusive, transferable, fully paid, worldwide license (with the right to sublicense) to use, copy, publish, stream, store, retain, publicly perform or display, transmit, scan, reformat, modify, edit, frame, translate, excerpt, adapt, create derivative works and distribute (through multiple tiers), any and all of the images retrieved.” The second the photos are downloaded, the station immediately projects them as a public digital-graffiti installation.\r\n\u003C\/bb-p\u003E\r\n\r\n\r\n\u003Cbb-quote credit=\u0022PSFK\u0022\u003E\u0026ldquo;\u0026hellip;there was one particular installation that has lingered in our memories for its relevance to one of the most equally contested and ignored topics in the digital conversation: privacy.\u0026rdquo;\u003C\/bb-quote\u003E \r\n\r\n\u003Cbb-p\u003E\r\n\u003Ca href=\u0022https:\/\/www.psfk.com\/2011\/12\/a-provocative-installation-highlights-our-lack-of-online-privacy.html\u0022 target=\u0022_blank\u0022\u003Esee PSFK article here\u003C\/a\u003E\r\n\u003C\/bb-p\u003E\r\n\u003Cbb-p\u003E\r\nThnx: Sushi Samba, Joanna Cisowska, Paloma M Vazquez, Macias Advertising, Miami Independent Thinkers and Alain “Haitian Hillbilly” Maximilien.\u003C\/bb-p\u003E\r\n\r\n","id":15,"name":"Post Content"},{"value":"[\u0022interactive\u0022,\u0022experiential\u0022,\u0022installation\u0022,\u0022privacy\u0022,\u0022digital literacy\u0022,\u0022projection\u0022,\u0022museum\u0022]","id":176,"name":"Tags"}]},{"name":"Portfolio List","type":4,"id":53,"data":[{"value":"[\u0022generative\u0022,\u0022app dev\u0022,\u0022machine learning\u0022]","id":176,"name":"Tags"},{"value":"\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/1eb3a17909c3b80358e47957006a8252","id":171,"name":"Social Media Thumbnail"},{"value":"\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/e80da5a35d6bb4699ca3b04459905e4b","id":16,"name":"Header Image"},{"value":"muse-ai-supercut","id":48,"name":"slug"},{"value":"Case Study","id":17,"name":"Post Type"},{"value":"Muse AI Supercuts","id":8,"name":"Post Title"},{"value":"","id":46,"name":"Post Sub Title"},{"value":"2017","id":20,"name":"year"},{"value":"http:\/\/ai.muse.mu\/","id":21,"name":"url"},{"value":"software development and data management","id":22,"name":"services"},{"value":"Regional Gold Addy Award","id":23,"name":"recognition"},{"value":"","id":24,"name":"results"},{"value":"Muse, Warner Music UK","id":47,"name":"clients"},{"value":"1","id":9,"name":"Published"},{"value":"1","id":45,"name":"Feature on Home"},{"value":"","id":10,"name":"Created on"},{"value":"","id":12,"name":"Post Start"},{"value":"","id":13,"name":"Post End"},{"value":"Custom software created for the band Muse which algorithmically generates supercut lyric videos featuring high profile individuals voicing the lyrics to their new single Dig Down.","id":14,"name":"Summary"},{"value":"\u003Cbb-quote credit=\u0022Jörg Breithut (Spiegel Online)\u0022\u003EIn their latest music video for the single \u0022Dig down\u0022 the British rock band Muse pays homage to remix culture on the Internet - and passes control to computers.\u003C\/bb-quote\u003E\r\n\r\n\t\t\t\u003Cbb-h2\u003EThe Task\u003C\/bb-h2\u003E\r\n\r\n\t\t\t\u003Cbb-p\u003E\r\n\t\t\t\tThe band Muse and their label Warner Music UK were interested in producing a series of algorithmically generated music videos to promote the band’s latest single Dig Down. Given the track’s political undertones they wanted custom software which would leverage contemporary AI (Machine Learning) technology to generate daily supercuts\u003Cbb-note info=\u0027a \u003Ca href=\u0022https:\/\/en.wikipedia.org\/wiki\/Supercut\u0022 target=\u0022_blank\u0022\u003Esupercut\u003C\/a\u003E is an Internet meme genre of quickly cut remix videos, similar to cutup\/montage works by earlier experimental filmmakers, see the essay \u003Ca href=\u0022http:\/\/www.movingimagesource.us\/articles\/compilation-nation-20110425\u0022\u003ECompliation Nation\u003C\/a\u003E by Tom McCormack for a great overview\u0027\u003E\u003C\/bb-note\u003E where each word in the song would be voiced by a person of note.\u003Cbr\u003E\u003Cbr\u003E\r\nThis aesthetic has been achieved previously using manual editing processes but only recently has technology advanced to the point that we\u0027re able to create this programmatically. The video series was released as a daily video for a month. To manually generate these videos daily with topical subject matter would have been impossible just a few short years ago.\r\n\t\t\t\u003C\/bb-p\u003E\r\n\r\n\r\n\t\t\t\u003Cbb-h2\u003EThe Challenge\u003C\/bb-h2\u003E\r\n\r\n\t\t\t\u003Cbb-p\u003E\r\n\t\t\t\tThe project’s timeline was incredibly tight given the scope, which meant we had to be particularly resourceful. Rather than collecting data to train AI models from scratch, we would need to leverage pre-trained models and, though we specialize in producing custom code, we knew we would have to be strategic about leveraging pre-existing open-source tools for various parts of the project. We designed a software pipeline that would not only be capable of producing the supercuts on schedule but also be modular and flexible enough to accommodate quick changes and the unanticipated challenges that often arise with heavy data-driven projects like this one.\r\n\t\t\t\u003C\/bb-p\u003E\r\n\r\n\t\t\t\u003Cbb-h2\u003EThe Solution\u003C\/bb-h2\u003E\r\n\u003Cbb-p\u003E\r\n\u003Ciframe src=\u0022https:\/\/player.vimeo.com\/video\/223993913?color=ff0179\u0026title=0\u0026byline=0\u0026portrait=0\u0022 width=\u0022640\u0022 height=\u0022360\u0022 frameborder=\u00220\u0022 webkitallowfullscreen mozallowfullscreen allowfullscreen\u003E\u003C\/iframe\u003E\r\n\u003C\/bb-p\u003E\r\n\r\n\r\n\t\t\t\u003Cbb-p\u003E\r\n\t\t\t\tWith projects like this where so much of the final aesthetic would be determined by chance (in this case, the quality of random videos uploaded to the Internet) it’s hard to tell what the final look, sound and feel is going to be until you do it. Our first drafts made clear some of the challenges we would have to address, from developing special tools to efficiently vet the data being fed into the system to meticulously tweaking the algorithm such that it cut clips together which both matched the original rhythm of the song while allowing any given clip the proper time to playthrough.\r\n\t\t\t\u003C\/bb-p\u003E\r\n\t\t\t\u003Cbb-media fullwidth\u003E\r\n\t\t\t\t\u003Cvideo src=\u0022http:\/\/cms.brangerbriz.com\/img\/assetsFile\/files\/5b5994f7ca37993ebb188f04a54d7261\u0022 muted autoplay loop\u003E\u003C\/video\u003E\r\n\t\t\t\u003C\/bb-media\u003E\r\n\r\n\r\n\t\t\t\u003Cbb-p\u003E\r\n\t\t\t\tThe resulting software pipeline was a testament to the strength of open-source technologies and the state of machine learning. It consisted of a custom JavaScript application which uses the \u003Ca href=\u0022https:\/\/developers.google.com\/youtube\/v3\/\u0022 target=\u0022_blank\u0022\u003EYouTube Data API\u003C\/a\u003E and \u003Ca href=\u0022https:\/\/rg3.github.io\/youtube-dl\/\u0022 target=\u0022_blank\u0022\u003Eyoutube-dl\u003C\/a\u003E to source and download footage respectively. Next, \u003Ca href=\u0022https:\/\/github.com\/antiboredom\/videogrep\u0022 target=\u0022_blank\u0022\u003Evideogrep\u003C\/a\u003E and \u003Ca href=\u0022https:\/\/cmusphinx.github.io\/\u0022 target=\u0022_blank\u0022\u003ECMU Sphinx\u003C\/a\u003E are used to transcribe and cut individual word clips. Custom python code and \u003Ca href=\u0022https:\/\/ffmpeg.org\/\u0022 target=\u0022_blank\u0022\u003Effmpeg\u003C\/a\u003E then process the final supercuts, and a series of custom \u003Ca href=\u0022https:\/\/nodejs.org\/en\/\u0022 target=\u0022_blank\u0022\u003Enode.js\u003C\/a\u003E utilities helped to address various challenges along the way. The final command-line tool could generate seemingly infinite variations of the supercut from nearly a million word clips sourced from thousands of hours of footage.\r\n\t\t\t\u003C\/bb-p\u003E\r\n\t\t\t\u003Cbb-media\u003E\r\n\t\t\t\t\u003Cimg src=\u0022http:\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/9bbeb6e4e22c61aa8294cd23f8978f63\u0022\u003E\r\n\t\t\t\u003C\/bb-media\u003E\r\n  \u003Cbb-p\u003E\r\nA few Media mentions:\u003Cbr\u003E\r\n\u003Ca href=\u0022http:\/\/www.nme.com\/news\/music\/muse-dig-down-ai-lyric-video-2099927\u0022 target=\u0022_blank\u0022\u003ENME\u003C\/a\u003E, \r\n\u003Ca href=\u0022http:\/\/www.digitalspy.com\/music\/news\/a832678\/muse-releasing-video-for-dig-down-every-day-for-one-month-using-ai\/\u0022 target=\u0022_blank\u0022\u003EDigitalSpy\u003C\/a\u003E, \r\n\r\n\u003Ca href=\u0022https:\/\/www.engadget.com\/2017\/07\/06\/muse-bizarre-music-video-ai-found-footage\/\u0022 target=\u0022_blank\u0022\u003EEngadget\u003C\/a\u003E\r\n\r\n\r\n\r\n\r\n\u003C\/bb-p\u003E","id":15,"name":"Post Content"}]},{"name":"Portfolio List","type":4,"id":54,"data":[{"value":"[\u0022interactive\u0022,\u0022experiential\u0022,\u0022webGL\u0022,\u0022app dev\u0022,\u0022installation\u0022,\u0022privacy\u0022,\u0022digital literacy\u0022,\u0022projection\u0022,\u0022open source\u0022]","id":176,"name":"Tags"},{"value":"\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/44cb295e6aeefb7d060c195711d348e4","id":171,"name":"Social Media Thumbnail"},{"value":"\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/acbd21d64cfb9cdc56b51d9edb111aa4","id":16,"name":"Header Image"},{"value":"probe-kit","id":48,"name":"slug"},{"value":"Case Study","id":17,"name":"Post Type"},{"value":"Probe Kit","id":8,"name":"Post Title"},{"value":"","id":46,"name":"Post Sub Title"},{"value":"2015","id":20,"name":"year"},{"value":"http:\/\/probekit.brangerbriz.com\/","id":21,"name":"url"},{"value":"","id":22,"name":"services"},{"value":"","id":23,"name":"recognition"},{"value":"exhibited at  the eMerge Americas Conference in Miami Beach, the International Symposium on Mixed and Augmented Reality in Fukuoka, Japan and the Radical Networks conference in New York City","id":24,"name":"results"},{"value":"","id":47,"name":"clients"},{"value":"1","id":9,"name":"Published"},{"value":"0","id":45,"name":"Feature on Home"},{"value":"","id":10,"name":"Created on"},{"value":"","id":12,"name":"Post Start"},{"value":"","id":13,"name":"Post End"},{"value":"Probe Kit is software developed to illustrate how simple it is to collect personal network data and how much can be inferred from that data. Sarcastically pitched as an “amateur data collector kit”, Probe Kit turns your wifi card into a net that catches data fluttering out of the wireless devices of the people around you. \r\n","id":14,"name":"Summary"},{"value":"\u003Cbb-div\u003E\r\n\t\t\t\t\u003Cbr\u003E\u003Cbr\u003E\r\n\t\t\t\t\u003Ciframe src=\u0022https:\/\/player.vimeo.com\/video\/131566939\u0022 width=\u0022640\u0022 height=\u0022360\u0022 frameborder=\u00220\u0022 webkitallowfullscreen mozallowfullscreen allowfullscreen\u003E\u003C\/iframe\u003E\r\n\t\t\t\u003C\/bb-div\u003E\r\n\r\n\t\t\t\u003Cbb-h2\u003EThe Concept\u003C\/bb-h2\u003E\r\n\r\n\t\t\t\u003Cbb-p\u003E\r\n\t\t\t\tThe oil that drives the digital systems of our time is personal data, despite this fact many of us don’t really understand what this data is, how it’s collected\/exchanged and how it’s turned into wealth. data security is a low priority for much of the popular software and hardware we use today, for this reason it’s very easy for institutions (large and small) with the right tools to collect and leverage much of your personal information. We set out to demonstrate this by collecting and focusing on one type of network data: probe requests. These  are small messages your wireless devices emit into the air to connect to known WiFi networks. By collecting and algorithmically organizing this data and then cross referencing with other data we can create a profile (visualized as a butterfly) of the devices around you which includes all the networks a person has connected to and an interactive map for where these networks are (ie. where this person lives, works and plays) simply by listening to the data around us with generic wifi cards.\r\n\t\t\t\u003C\/bb-p\u003E\r\n\r\n\t\t\t\u003Cbb-quote credit=\u0022Brady Dale (The Observer)\u0022\u003EIn order to generate interest in the topic, the team built an eye-catching user interface, where each mobile device that the system “catches” is turned into a virtual butterfly.\u003C\/bb-quote\u003E\r\n\r\n\t\t\t\u003Cbb-h2\u003EThe Result\u003C\/bb-h2\u003E\r\n\r\n\t\t\t\u003Cbb-p\u003E\r\n\t\t\t\tProbe Kit debuted at the eMerge Americas Conference, as an activist “artware” installation aimed at illustrating how simple it is to collect personal network data and how much can be inferred from that data. Sarcastically pitched as an “amateur data collector kit”, Probe Kit was presented in three different forms: an app which turns your computer\u0027s wifi card into a “net” that catches the fluttering probe requests (data packets) emitted from the wireless devices of the people around you, an installation which collected and visualized all the personal data being collected throughout the duration of the conference, and a workshop where participants are given copies of the app and taken on an urban \u0022data safari\u0022 where we collect this data together and discuss the implications.\r\n\t\t\t\u003C\/bb-p\u003E\r\n\r\n\t\t\t\u003Cbb-h3\u003Ethe app\u003C\/bb-h3\u003E\r\n\r\n\t\t\t\u003Cbb-p\u003E\r\n\t\t\t\tThe Probe Kit app uses your computer\u0027s WiFi card to listen and collect all the probe request emitted by other phones and computers around you. In this initial device collection phase the app uses the MAC address of the captured devices (it\u0027s unique identifier) and WiFi network list size to generate a unique butterfly which represents that device. Every time a new device is captured a butterfly appears and flaps momentarily. If a butterfly continues flapping this means that this device is still around you and sending out probes (maybe someone sitting next to you?)\r\n\t\t\t\u003C\/bb-p\u003E\r\n\r\n\t\t\t\u003Cbb-media\u003E\r\n\t\t\t\t\u003Cimg src=\u0022http:\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/3065f52779c28114f3ca664aede8eb75\u0022 alt=\u0022probe kit app screenshot\u0022\u003E\r\n\t\t\t\u003C\/bb-media\u003E\r\n\r\n\t\t\t\u003Cbb-p\u003E\r\n\t\t\t\tWhen you click on one of these butterflies (devices) an information panel displays the actual MAC address of this device, the vendor\/manufacturer of the device (this can be inferred from the MAC address), when you last caught a probe from this device as well as the full list of WiFi networks this device has connected to in the past.\r\n\t\t\t\u003C\/bb-p\u003E\r\n\r\n\t\t\t\u003Cbb-media\u003E\r\n\t\t\t\t\u003Cimg src=\u0022http:\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/ae7644a812ef5313ce5e2b84df59f028\u0022 alt=\u0022probe kit app screenshot\u0022\u003E\r\n\t\t\t\u003C\/bb-media\u003E\r\n\r\n\t\t\t\u003Cbb-p\u003E\r\n\t\t\t\tFrom there you can view the \u0022migration patterns\u0022 of this butterfly on an interactive map. By cross referencing the list of associated WiFi networks with a dataset of geotagged\u003Cbb-note info=\u0027creating a data set of geo-tagged WiFi access points is known as \u003Ca href=\u0022https:\/\/en.wikipedia.org\/wiki\/Wardriving\u0022 target=\u0022_blank\u0022\u003Ewar driving\u003C\/a\u003E\u0027\u003E\u003C\/bb-note\u003E wireless router beacon frames we can visualize where this device has been, or more specifically where this person has previously connected to a WiFi network.\r\n\t\t\t\u003C\/bb-p\u003E\r\n\r\n\t\t\t\u003Cbb-media\u003E\r\n\t\t\t\t\u003Cimg src=\u0022http:\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/bc98744c87c43bc69e3ef798bd7585fd\u0022 alt=\u0022probe kit app screenshot\u0022\u003E\r\n\t\t\t\u003C\/bb-media\u003E\r\n\r\n\t\t\t\u003Cbb-h3\u003Ethe installation\u003C\/bb-h3\u003E\r\n\r\n\t\t\t\u003Cbb-p\u003E\r\n\t\t\t\tThe Probe Kit installation debuted at the eMerge Americas Conference in Miami Beach and will be included at the International Symposium on Mixed and Augmented Reality in Fukuoka, Japan and later at the Radical Networks conference in New York City. A computer with a 9 dbi omni WiFi antenna collects probes from devices in the area while simultaneously spawning a butterfly per device in a projected “habitat” visualization. This installation view displays all the butterflies (devices) in a 3D space and scans for new devices and details their network list, map and related metadata.\r\n\t\t\t\u003C\/bb-p\u003E\r\n\r\n\t\t\t\u003Cbb-media caption\u003E\r\n\t\t\t\t\u003Cimg src=\u0022http:\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/c45ca24fa4b41ddc72cd2f4705dbf72b\u0022 alt=\u0022Over 5000 devices were collected at eMerge in Miami and displayed in this way.\u0022\u003E\r\n\t\t\t\u003C\/bb-media\u003E\u003Cbr\u003E\u003Cbr\u003E\r\n\r\n\t\t\t\u003Cbb-media caption\u003E\r\n\t\t\t\t\u003Cimg src=\u0022http:\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/d5bce1ef168b01922c4c408965142e0a\u0022 alt=\u0022installation \u0027habitat\u0027 screenshot \u0022\u003E\r\n\t\t\t\u003C\/bb-media\u003E\u003Cbr\u003E\u003Cbr\u003E\r\n\r\n\t\t\t\u003Cbb-media caption\u003E\r\n\t\t\t\t\u003Cimg src=\u0022http:\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/82ffe8023c22ba2917450811ec078def\u0022 alt=\u0022an unsuspecting device captured in the moment\u0022\u003E\r\n\t\t\t\u003C\/bb-media\u003E\r\n\r\n\t\t\t\u003Cbb-h3\u003Ethe workshop\u003C\/bb-h3\u003E\r\n\r\n\t\t\t\u003Cbb-p\u003E\r\n\t\t\t\tThe “Network Data Safari” is a performative workshop where participants are given a copy of the Probe Kit app as well as “field guides” which explain how the app works. Participants take their laptops out into wild urban landscapes to capture probing devices and create their own network data collection. Together we analyze how it\u0027s possible to collect this kind of personal data and discuss the implications of being able to do so. At the end of the safari participants are encouraged to bring their laptops back to the installation to “release” their collection into the installation’s “habitat”, amassing an even larger data set.\r\n\t\t\t\u003C\/bb-p\u003E\r\n\r\n\t\t\t\u003Cbb-media caption\u003E\r\n\t\t\t\t\u003Cimg src=\u0022http:\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/db6d82398f45c786ec29c247af3a6d6a\u0022 alt=\u0022the data safari field guide\u0022\u003E\r\n\t\t\t\u003C\/bb-media\u003E\u003Cbr\u003E\u003Cbr\u003E\r\n\r\n\t\t\t\u003Cbb-media\u003E\r\n\t\t\t\t\u003Cimg src=\u0022http:\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/fab8e00ce8865951563d423875e3bb75\u0022 alt=\u0022probe kit in the wild\u0022\u003E\r\n\t\t\t\u003C\/bb-media\u003E","id":15,"name":"Post Content"}]},{"name":"Portfolio List","type":4,"id":62,"data":[{"value":"[\u0022interactive\u0022,\u0022experiential\u0022,\u0022app dev\u0022,\u0022installation\u0022,\u0022play\u0022,\u0022game\u0022,\u0022museum\u0022]","id":176,"name":"Tags"},{"value":"\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/b58e10e122e51e9f4f04964852afab2e","id":171,"name":"Social Media Thumbnail"},{"value":"\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/ba0ee2ee4c3ce5484e2c0992eda68fa3","id":16,"name":"Header Image"},{"value":"miami-childrens-museum-my-recipe","id":48,"name":"slug"},{"value":"1","id":9,"name":"Published"},{"value":"0","id":45,"name":"Feature on Home"},{"value":"","id":10,"name":"Created on"},{"value":"","id":12,"name":"Post Start"},{"value":"","id":13,"name":"Post End"},{"value":"Case Study","id":17,"name":"Post Type"},{"value":"An interactive installation created for the Miami Children\u0027s Museum to educate children as to the food groups through immersive play.\r\n","id":14,"name":"Summary"},{"value":"My Recipe","id":8,"name":"Post Title"},{"value":"Miami Children\u0027s Museum Installation","id":46,"name":"Post Sub Title"},{"value":"\u003Cbb-p\u003EIn a time when children have access to video games literally at their fingertips at any moment, we believe that in order to compete for a child’s attention, the Miami Children’s Museum had to take advantage of its ability to provide a child with an immersive play experience.\u003C\/bb-p\u003E\r\n\r\n\r\n\u003Cbb-p\u003E\r\nProviding the child with an opportunity to use their imaginations to transport them into different scenarios and storylines will provide an exponential degree of engagement as opposed to being presented with arbitrary educational video games.\u003C\/bb-p\u003E\r\n\r\n\r\n\u003Cbb-h2\u003EThe Concept\u003C\/bb-h2\u003E\r\n\u003Cbb-p\u003EThe child plays a line cook at a restaurant. The game starts when an order ticket slides onto the ticket holder on the large screen. The ticket contains a recipe consisting of the ingredients the child will have to use to prepare the meal. The child “grabs” the ingredients from the screen and drop them on to his\/her preparation board. He or she chops up the food and scoops it into the pan on the stove, stirs\r\nthe ingredients in the pan, and rings the table bell when the order is ready.\r\n\r\nAt which time, the meal appears prepared on the order window, and a few\r\nmoments later is whisked away by the waiter. The game restarts with the next order ticket\/\r\nrecipe appearing on the ticket holder.\r\n\u003C\/bb-p\u003E\r\n\u003Cbb-media\u003E\r\n\u003Ciframe src=\u0022https:\/\/player.vimeo.com\/video\/251189019?autoplay=1\u0026loop=1\u0026color=ff0179\u0026title=0\u0026byline=0\u0026portrait=0\u0022 width=\u0022600\u0022 height=\u0022335\u0022 frameborder=\u00220\u0022 webkitallowfullscreen mozallowfullscreen allowfullscreen\u003E\u003C\/iframe\u003E\r\n\u003C\/bb-media\u003E\r\n\u003Cbb-h2\u003ELearning\u003C\/bb-h2\u003E\r\n\u003Cbb-p\u003E\r\nAs the child picks the elements of the recipe, the item is scratched off of the recipe and the corresponding food group of the selected item is highlighted on a My Plate color coordinated meter located on the preparation board screen.\r\nThis not only informs the child that a correct ingredient was selected but also lets them know what food group it belongs to.\r\nWhen the meal is fully prepared, the My Plate meter serves as a reminder of the food groups that went into the prepared recipe.\r\n\u003C\/bb-p\u003E\r\n\u003Cbb-media fullwidth\u003E\u003Cimg src=\u0022http:\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/7ae3ed06af862959f492cf100d5e9159\u0022\u003E\r\n\u003C\/bb-media\u003E\r\n\u003Cbb-h2\u003EGame Mechanics\u003C\/bb-h2\u003E\r\n\u003Cbb-h3\u003Etouch\u003C\/bb-h3\u003E\r\n\u003Cbb-p\u003E\r\nThe cutting board is a touch screen. The ingredients on the cutting board\r\nare “cut” by the swipe of a finger on the screen, over the food item.\r\nAfter the food is chopped it can be swiped into the pan with a swipe of a\r\nfinger starting over the chopped food and ending on or near the pan.\r\nThe child will be prompted to interact with the screen by motion tutorials\r\nbuilt into the game play. When the child decides their meal is ready they\r\nring a bell in the corner of their preparation board.\u003C\/bb-p\u003E\r\n\u003Cbb-h3\u003Egesture\u003C\/bb-h3\u003E\r\n\u003Cbb-p\u003E\r\nThe “grabbing” of ingredients from the order window and\r\nplacement on the preparation board is done using hand\r\ngestures.\r\nWhen the child waves their hand in front of them (reaching out to grab an\r\ningredient on the shelf) and a transparent-hand-icon appears on the screen\r\n(following their hand motions) when they hover over an ingredient and\r\nmake a grabbing gesture, the icon switches to a grab-icon and the\r\ningredient disappears from the shelve and appears on your prep board.\r\n\u003C\/bb-p\u003E\r\n\u003Cbb-media\u003E\r\n\u003Cimg src=\u0022http:\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/d97b24242d9014077910c85a2b33ac64\u0022\u003E\r\n\u003C\/bb-media\u003E","id":15,"name":"Post Content"},{"value":"2016","id":20,"name":"year"},{"value":"","id":21,"name":"url"},{"value":"Concept Development, Design, Software Development, Installation","id":22,"name":"services"},{"value":"","id":23,"name":"recognition"},{"value":"","id":24,"name":"results"},{"value":"Miami Children\u0027s Museum","id":47,"name":"clients"}]},{"name":"Portfolio List","type":4,"id":56,"data":[{"value":"[\u0022interactive\u0022,\u0022experiential\u0022,\u0022social media\u0022,\u0022installation\u0022]","id":176,"name":"Tags"},{"value":"\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/c4d6f5a2f20230d8631ca0151d117c65","id":171,"name":"Social Media Thumbnail"},{"value":"\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/1203526c0f185b081bd39de27a463dae","id":16,"name":"Header Image"},{"value":"goya-food-and-wine","id":48,"name":"slug"},{"value":"1","id":9,"name":"Published"},{"value":"0","id":45,"name":"Feature on Home"},{"value":"","id":10,"name":"Created on"},{"value":"","id":12,"name":"Post Start"},{"value":"","id":13,"name":"Post End"},{"value":"Standard","id":17,"name":"Post Type"},{"value":"Goya\u0027s interactive installation at the Food Network South Beach Wine \u0026 Food Festival","id":14,"name":"Summary"},{"value":"Goya Across America","id":8,"name":"Post Title"},{"value":"SOBE Wine and Food Festival","id":46,"name":"Post Sub Title"},{"value":"\u003Cbb-p\u003EInteractive installation we developed for Goya\u0027s booth at the Food Network South Beach Wine \u0026 Food Festival. Keeping with the Goya Across America concept we allowed festival goers to participate in different scenes involving the cultures that make up America and its flavors as they are reinvented with Goya products. Users were prompted (mad libs style) to make different facial expressions and lend their faces to different scenes.\u003C\/bb-p\u003E\r\n\r\n\u003Cbb-media fullwidth\u003E\u003Ciframe src=\u0022https:\/\/player.vimeo.com\/video\/62720855?color=ff0179\u0026title=0\u0026byline=0\u0026portrait=0\u0022 width=\u0022700\u0022 height=\u0022330\u0022 frameborder=\u00220\u0022 webkitallowfullscreen mozallowfullscreen allowfullscreen\u003E\u003C\/iframe\u003E\u003C\/bb-media\u003E\r\n","id":15,"name":"Post Content"},{"value":"2013-2016","id":20,"name":"year"},{"value":"","id":21,"name":"url"},{"value":" concept development, design, programing and installation","id":22,"name":"services"},{"value":"","id":23,"name":"recognition"},{"value":"","id":24,"name":"results"},{"value":"Goya","id":47,"name":"clients"}]},{"name":"Portfolio List","type":4,"id":57,"data":[{"value":"[\u0022interactive\u0022,\u0022web site\u0022,\u0022mobile\u0022,\u0022web dev\u0022,\u0022app dev\u0022,\u0022social media\u0022,\u00223D\u0022,\u0022maintenance\u0022,\u0022play\u0022,\u0022game\u0022]","id":176,"name":"Tags"},{"value":"\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/536451174953440babf90b34544c980b","id":171,"name":"Social Media Thumbnail"},{"value":"","id":16,"name":"Header Image"},{"value":"tampico-pinata-bash","id":48,"name":"slug"},{"value":"1","id":9,"name":"Published"},{"value":"0","id":45,"name":"Feature on Home"},{"value":"","id":10,"name":"Created on"},{"value":"","id":12,"name":"Post Start"},{"value":"","id":13,"name":"Post End"},{"value":"Standard","id":17,"name":"Post Type"},{"value":"3D pi\u0026ntilde;ata bashing sweepstakes game for hispanic youth developed for both online and at field marketing efforts ","id":14,"name":"Summary"},{"value":"Tampico Piñata Bash","id":8,"name":"Post Title"},{"value":"","id":46,"name":"Post Sub Title"},{"value":"\u003Cbb-p\u003E\r\nTampico Piñata Bash promotion invited facebook users to customize their own 3D piñatas complete with a hidden message to be shared with a friend. The friend receives the piñata, bashes it open and sees the hidden message from the sender. Both participants are entered into the Tampico sweepstakes for a chance to win prizes throughout the summer. \u003C\/bb-p\u003E\r\n\u003Cbb-p\u003E\r\nThe experience was developed as a desktop facebook app as well as an ipad app for Tampico  field marketing efforts.\r\n\u003C\/bb-p\u003E\r\n\u003Cbb-media fullwidth\u003E\u003Ciframe src=\u0022https:\/\/player.vimeo.com\/video\/68853410?color=ff0179\u0026title=0\u0026byline=0\u0026portrait=0\u0022 width=\u0022700\u0022 height=\u0022330\u0022 frameborder=\u00220\u0022 webkitallowfullscreen mozallowfullscreen allowfullscreen\u003E\u003C\/iframe\u003E\u003C\/bb-media\u003E","id":15,"name":"Post Content"},{"value":"2012","id":20,"name":"year"},{"value":"","id":21,"name":"url"},{"value":"Facebook App Dev, iOS Dev,Design\/UX consultation, Maintenance","id":22,"name":"services"},{"value":"","id":23,"name":"recognition"},{"value":"","id":24,"name":"results"},{"value":"Tampico","id":47,"name":"clients"}]},{"name":"Portfolio List","type":4,"id":58,"data":[{"value":"[\u0022interactive\u0022,\u0022experiential\u0022,\u0022installation\u0022]","id":176,"name":"Tags"},{"value":"\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/9a99d0cffb4b44c61533a78ecf33487c","id":171,"name":"Social Media Thumbnail"},{"value":"","id":16,"name":"Header Image"},{"value":"verizon-metlife-stadium","id":48,"name":"slug"},{"value":"1","id":9,"name":"Published"},{"value":"0","id":45,"name":"Feature on Home"},{"value":"","id":10,"name":"Created on"},{"value":"","id":12,"name":"Post Start"},{"value":"","id":13,"name":"Post End"},{"value":"Standard","id":17,"name":"Post Type"},{"value":"Interactive touch-based installation for the New Meadowlands Stadium","id":14,"name":"Summary"},{"value":"Verizon Metlife Stadium","id":8,"name":"Post Title"},{"value":"Interactive Installation","id":46,"name":"Post Sub Title"},{"value":"\u003Cbb-p\u003E\r\nTogether with Lava Studio and South Carolina based agency, Erwin-Penland, we developed an interactive touch-based installation for the New Meadowlands Stadium. We were approached with the task of pushing the limits of the I-Wall system.\u003C\/bb-p\u003E\r\n\u003Cbb-p\u003E\r\nUsers bring characters to life by sliding a 42\u0022 touch screen monitor across a mural of 5 cheering New York fans. Both Giants and Jets fans are able to interact with a mix of Verizon product information and interactive entertainment including game highlights (for either team depending on the game schedule).\r\n\u003C\/bb-p\u003E\r\n\u003Cbb-media fullwidth\u003E\u003Ciframe src=\u0022https:\/\/player.vimeo.com\/video\/26698806?color=ff0179\u0026title=0\u0026byline=0\u0026portrait=0\u0022 width=\u0022700\u0022 height=\u0022330\u0022 frameborder=\u00220\u0022 webkitallowfullscreen mozallowfullscreen allowfullscreen\u003E\u003C\/iframe\u003E\u003C\/bb-media\u003E","id":15,"name":"Post Content"},{"value":"2010","id":20,"name":"year"},{"value":"","id":21,"name":"url"},{"value":"Custom development","id":22,"name":"services"},{"value":"Gold Addy 2011 \u003Cbr\u003ECharlie Award 2011 (Best of “Out of Home”)","id":23,"name":"recognition"},{"value":"","id":24,"name":"results"},{"value":"Verizon","id":47,"name":"clients"}]},{"name":"Portfolio List","type":4,"id":59,"data":[{"value":"[\u0022interactive\u0022,\u0022web site\u0022,\u0022experiential\u0022,\u0022webGL\u0022,\u0022web dev\u0022,\u0022threejs\u0022,\u0022installation\u0022,\u0022privacy\u0022,\u0022digital literacy\u0022,\u0022projection\u0022,\u00223D\u0022,\u0022play\u0022]","id":176,"name":"Tags"},{"value":"\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/9eccee9da66ec9afdd04d97144ea6003","id":171,"name":"Social Media Thumbnail"},{"value":"","id":16,"name":"Header Image"},{"value":"digitaltrailspace-artslant-art-basel","id":48,"name":"slug"},{"value":"1","id":9,"name":"Published"},{"value":"0","id":45,"name":"Feature on Home"},{"value":"","id":10,"name":"Created on"},{"value":"","id":12,"name":"Post Start"},{"value":"","id":13,"name":"Post End"},{"value":"Case Study","id":17,"name":"Post Type"},{"value":"ArtSlant Street participatory digital\/physical launch campaign during Art Basel Miami.","id":14,"name":"Summary"},{"value":"Digital Trail Space","id":8,"name":"Post Title"},{"value":"ArtSlant guerilla digital campaign","id":46,"name":"Post Sub Title"},{"value":"\u003Ciframe src=\u0022https:\/\/player.vimeo.com\/video\/98666869?color=ff0179\u0026title=0\u0026byline=0\u0026portrait=0\u0022 width=\u0022600\u0022 height=\u0022338\u0022 frameborder=\u00220\u0022 webkitallowfullscreen mozallowfullscreen allowfullscreen\u003E\u003C\/iframe\u003E\r\n\u003Cbb-p\u003E\r\nFor two weeks leading up to Miami Art Basel, digitaltrailspace.com ( an interactive 3D voxel-graffiti drawing tool ) collected “anonymous” submissions from participants around the world, with the prompt: \u003C\/bb-p\u003E\r\n\u003Cbb-quote\u003E\r\n\u0022Be part of a digital street art show during Art Basel Miami Beach. say\/draw whatever you want! your piece will be automatically added to the collection and projected all over the streets of Miami, culminating on the facade of Aqua Art Miami on Saturday Dec 7th\u0022 \r\n\u003C\/bb-quote\u003E\r\n\u003Cbb-p\u003E\r\npieces were collected \u0026\u0026 projected, anonymity was implied, but never promised. after submitting a piece it would be credited to the participants IP Address ( their “digital handle” ), and s\/he would be followed across the web through targeted ads which read: \r\n\u003C\/bb-p\u003E\r\n\u003Cbb-quote\u003E\r\n\u0022hope you don’t mind we followed you here, your digital handle leaves a trail… thnx for your contribution.” \r\n\u003C\/bb-quote\u003E\r\n\u003Cbb-p\u003E\r\nDespite what we might think when we surf the web, we are never truly anonymous online. Even when we’re logged out of social media and email, all our activities are being tracked and associations are being made between them by parties we are completely unaware of. For street artists, it’s often important to hide one’s identity behind handles in order to share activist or countercultural messages without fear of repercussion. The Internet has evolved from being simply a tool we use to an environment we live in—where we talk with friends, where we get our news, where we shop, where we work, where we have sex, where we handle our finances, where we keep our medical records, where we watch movies and listen to music. \r\n\u003C\/bb-p\u003E\r\n\u003Cbb-p\u003E\r\nAs street artists and activists migrate their activities into the cloud, the protection granted by anonymity is compromised, as is everyone’s privacy online… whether we realize it or not. This piece hopes to make sure we do realize it. \r\n\u003C\/bb-p\u003E\r\n","id":15,"name":"Post Content"},{"value":"2013","id":20,"name":"year"},{"value":"http:\/\/digitaltrailspace.com","id":21,"name":"url"},{"value":"","id":22,"name":"services"},{"value":"","id":23,"name":"recognition"},{"value":"","id":24,"name":"results"},{"value":"ArtSlant","id":47,"name":"clients"}]},{"name":"Portfolio List","type":4,"id":78,"data":[{"value":"[\u0022interactive\u0022,\u0022webGL\u0022,\u0022installation\u0022,\u0022digital literacy\u0022,\u00223D\u0022,\u0022open source\u0022,\u0022cms\u0022,\u0022blockchain\u0022,\u0022bitcoin\u0022]","id":176,"name":"Tags"},{"value":"\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/d705d33de7c69df007c30b22381cd5c8","id":171,"name":"Social Media Thumbnail"},{"value":"\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/bdc29c5678b2ea9eedc8f31b91b11d01","id":16,"name":"Header Image"},{"value":"messages-from-the-mines","id":48,"name":"slug"},{"value":"1","id":9,"name":"Published"},{"value":"0","id":45,"name":"Feature on Home"},{"value":"04\/25\/2018","id":10,"name":"Created on"},{"value":"04\/25\/2018","id":12,"name":"Post Start"},{"value":"","id":13,"name":"Post End"},{"value":"Case Study","id":17,"name":"Post Type"},{"value":"Messages from the Mines is an interactive art installation that excavates and archives custom messages embedded in the Bitcoin blockchain.","id":14,"name":"Summary"},{"value":"Messages from the Mines","id":8,"name":"Post Title"},{"value":"Explore hidden messages in the Bitcoin Blockchain","id":46,"name":"Post Sub Title"},{"value":"\u003Cbb-p\u003E\r\n\u003Ciframe src=\u0022https:\/\/player.vimeo.com\/video\/266535124?color=ff0179\u0026title=0\u0026byline=0\u0026portrait=0\u0022 webkitallowfullscreen=\u0022\u0022 mozallowfullscreen=\u0022\u0022 allowfullscreen=\u0022\u0022 width=\u0022640\u0022 height=\u0022360\u0022 frameborder=\u00220\u0022\u003E\u003C\/iframe\u003E\r\n\r\nMessages from the Mines is an interactive art installation that excavates and archives custom messages embedded in the Bitcoin blockchain. The distributed Bitcoin ledger contains hidden love messages, cryptic poems, ASCII art, signatures, eulogies and more. These messages are a creative misuse of the Bitcoin transaction protocol, a form of digital graffiti, unique—though overlooked—cultural artifacts forever embedded in one of the most contemporary digital technologies.\r\n\u003C\/bb-p\u003E\r\n\r\n\u003Cbb-quote credit=\u0022Daniel Oberhaus (Motherboard)\u0022\u003EFlorida design agency Branger_Briz released an interactive art project called Messages from the Mines that explores the Bitcoin blockchain and reveals the artworks and messages hidden among the code. \u003C\/bb-quote\u003E\r\n\r\n\u003Cbb-p\u003E\u003Ca href=\u0022https:\/\/motherboard.vice.com\/en_us\/article\/mbxwkn\/bitcoin-blockchain-art-message-from-the-mines\u0022 target=\u0022_blank\u0022\u003Eread full motherboard article here\u003C\/a\u003E\u003C\/bb-p\u003E\r\n\r\n\u003Cbb-p\u003E\r\nOur project looks at the Bitcoin blockchain not from the traditional perspective of investors, traders, or programmers, but rather from a cultural perspective. We\u0027ve built a system for extracting, archiving, researching, interpreting and annotating the messages left behind and document the evolution of this creative re-purposing of the blockchain. We approached this task not only as artists but also as anthropologists conducting contemporary media archeology; we seek an anthropological understanding of this phenomenon. Who are leaving these messages? What are their motivations and sentiments? What forms of anonymous communication occur on the ledger?\r\n\u003C\/bb-p\u003E\r\n\r\n\u003Cbb-h2\u003EThe Conference\u003C\/bb-h2\u003E\r\n\r\n\u003Cbb-p\u003E\r\n\u003Cimg src=\u0022https:\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/5090ed5707f206fcc24d21c02a24b71a\u0022 \u003E\r\nThe \u003Ca href=\u0022http:\/\/www.emergeamericas.com\/about-us\/\u0022 target=\u0022_blank\u0022\u003EeMerge Americas\u003C\/a\u003E 2018 conference commissioned Branger_Briz to make an engaging interactive experience on the theme of blockchain technologies. For two days in April, we operated a live Bitcoin node at the conference hall. This machine acted as a peer on the Bitcoin network, relaying transactions to a global network of peer computers all over the world. This allowed us to maintained a full copy of the Bitcoin ledger for conference attendees to explore hidden messages and real-time Bitcoin transactions.\r\n\u003C\/bb-p\u003E\r\n\r\n\u003Cbb-h2\u003EThe Archive\u003C\/bb-h2\u003E\r\n\r\n\u003Cbb-media\u003E\r\n\u003Cimg src=\u0022https:\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/aa5c29eedc2adf67ef8987b13885c0cf\u0022\u003E\r\n\u003C\/bb-media\u003E\r\n\r\n\u003Cbb-p\u003E\r\nWe wrote \u003Ca href=\u0022https:\/\/github.com\/brangerbriz\/messages-from-the-mines\u0022 target=\u0022_blank\u0022\u003Ecustom software\u003C\/a\u003E that parses the entire history of Bitcoin transactions extracting any text-based messages engraved in their contents. We identified ~11,000 of the 520,000+ blocks at the time that contained some sort of intentionally embedded text data. From there, we created a tool to review these messages, tagging and categorizing them into common themes and recurring message types we identified. We searched the net to try and better understand some of the most cryptic or interesting messages, adding annotations, notes, and comments to the messages as we researched. We\u0027ve amassed a large dataset including messages written in over 50 different languages.\r\n\u003C\/bb-p\u003E\r\n\r\n\u003Cbb-media\u003E\r\n\u003Cimg src=\u0022http:\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/671908bbb827e6d665cba67a06b43711\u0022\u003E\r\n\u003C\/bb-media\u003E\r\n\r\n\u003Cbb-p\u003E\r\nOur dataset and software are both open source and we hope that researchers, cultural anthropologists, and curious netizens will find our work useful. We hope to launch a publicly web version of the archive online soon. Until then, if you are interested in accessing the data for research please get in touch: us@brangerbriz.com\r\n\u003C\/bb-p\u003E\r\n\r\n\u003Cbb-p\u003EWe\u0027d like to offer special thanks to Ken Shirriff for his \u003Ca href=\u0022http:\/\/www.righto.com\/2014\/02\/ascii-bernanke-wikileaks-photographs.html\u0022 target=\u0022_blank\u0022\u003E2014 blog post\u003C\/a\u003E that inspired us to create it, Antoine Le Calvez who authored the \u003Ca href=\u0022https:\/\/github.com\/alecalve\/python-bitcoin-blockchain-parser\u0022 target=\u0022_blank\u0022\u003Eopen source python blockchain parser\u003C\/a\u003E we used (and contributed to!), and the entire Bitcoin development community who built the Bitcoin software we so heavily relied on.\u003C\/bb-p\u003E\r\n\r\n\u003Cbb-quote credit=\u0022infobae.com\u0022\u003E El anhelo de ser conocido, y de ser recordado para la eternidad, es un deseo muy humano y fue interesante ver estas motivaciones aparecer a través de mensajes escritos en diferentes idiomas a lo largo de los nueve años de existencia de la blockchain. \u003C\/bb-quote\u003E\r\n\r\n\u003Cbb-p\u003E\u003Ca href=\u0022https:\/\/www.infobae.com\/cripto247\/bitcoin\/2018\/06\/13\/hechizos-arte-y-poemas-de-amor-el-graffiti-digital-en-el-codigo-de-bitcoin\/\u0022 target=\u0022_blank\u0022\u003Eread full infobae article here\u003C\/a\u003E\u003C\/bb-p\u003E\r\n\r\n","id":15,"name":"Post Content"},{"value":"2018","id":20,"name":"year"},{"value":"https:\/\/messagesfromthemines.brangerbriz.com","id":21,"name":"url"},{"value":"Concept Development, Design, Software Development","id":22,"name":"services"},{"value":"","id":23,"name":"recognition"},{"value":"","id":24,"name":"results"},{"value":"eMerge Americas","id":47,"name":"clients"}]},{"name":"Portfolio List","type":4,"id":80,"data":[{"value":"[\u0022generative\u0022,\u0022interactive\u0022,\u0022mobile\u0022,\u0022webGL\u0022,\u0022threejs\u0022,\u0022installation\u0022,\u0022privacy\u0022,\u0022digital literacy\u0022,\u00223D\u0022,\u0022open source\u0022,\u0022play\u0022]","id":176,"name":"Tags"},{"value":"\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/c73abc4c64a502b140c16d190876e390","id":171,"name":"Social Media Thumbnail"},{"value":"\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/f6cf32628a92e7afb9e60bfc5ce642a8","id":16,"name":"Header Image"},{"value":"wifi-data-safari","id":48,"name":"slug"},{"value":"1","id":9,"name":"Published"},{"value":"0","id":45,"name":"Feature on Home"},{"value":"","id":10,"name":"Created on"},{"value":"","id":12,"name":"Post Start"},{"value":"","id":13,"name":"Post End"},{"value":"Case Study","id":17,"name":"Post Type"},{"value":"Explore the wireless world around you with an interactive installation, web app, and digital literacy workshop.","id":14,"name":"Summary"},{"value":"WiFi Data Safari","id":8,"name":"Post Title"},{"value":"","id":46,"name":"Post Sub Title"},{"value":"\u003Cbb-h2\u003EThe Installation\u003C\/bb-h2\u003E\r\n\r\n\u003Ciframe src=\u0022https:\/\/player.vimeo.com\/video\/269679739?color=ff0179\u0026title=0\u0026byline=0\u0026portrait=0\u0026autoplay=1\u0026loop=1\u0022 webkitallowfullscreen=\u0022\u0022 mozallowfullscreen=\u0022\u0022 allowfullscreen=\u0022\u0022 width=\u0022640\u0022 height=\u0022360\u0022 frameborder=\u00220\u0022 style=\u0022width:100%;max-width:100%;\u0022\u003E\u003C\/iframe\u003E\r\n\r\n\u003Cbb-p\u003E\r\nWiFi Data Safari is a critical software art project that aims to educate the public about the wireless network data that constantly surrounds them. We developed software that captures WiFi data from passersby devices that are silently exposing personal information about their owner’s previously connected WiFi networks and the physical locations where they may work, live, and play. Through a metaphor of butterfly collection, this data is presented as a wireless habitat, where nearby WiFi devices appear as unique butterflies with \u0022migration patterns\u0022 derived from publicly accessible geotagged WiFi access point (wardriving) data. Flowers in the scene represent nearby WiFi networks and clouds represent network traffic made from devices connected to the \u0022WiFi Data Safari\u0022 access point created by the project.\r\n\u003C\/bb-p\u003E\r\n\r\n\u003Cbb-p\u003E\r\nThis project is a revamp of an earlier project we created in 2015 called \u003Ca href=\u0022https:\/\/brangerbriz.com\/portfolio\/probe-kit\u0022 target=\u0022_blank\u0022\u003EProbe Kit\u003C\/a\u003E. This version features a new 3D scene, a robust software rewrite, an interactive web application served by an ad-hoc wireless network, and a new workshop to accompany it.\r\n\u003C\/bb-p\u003E\r\n\r\n\u003Cbb-h2\u003EThe Web App\u003C\/bb-h2\u003E\r\n\r\n\u003Cbb-p\u003E\r\n\tAlongside the 3D installation, WiFi Data Safari launches a web app that nearby viewers can access on an ad-hoc WiFi network. This app allows viewers to explore the data from the 3D habitat view on their own phones, and in the process, learn more about the wireless landscape surrounding them. \r\n\u003C\/bb-p\u003E\r\n\r\n\u003Cbb-media\u003E\r\n\t\u003Cimg src=\u0022https:\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/8aae2b2f4f417aa2d2353789303761d7\u0022\/\u003E\r\n\u003C\/bb-media\u003E\r\n\r\n\u003Cbb-h2\u003EThe Workshop\u003C\/bb-h2\u003E\r\n\r\n\u003Cbb-media\u003E\r\n\t\u003Cimg src=\u0022https:\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/47becbd8016a5fed5a559ef03c1b5ab6\u0022\/\u003E\r\n\u003C\/bb-media\u003E\r\n\r\n\u003Cbb-p\u003E\r\n\tThe WiFi Data Safari artwork is accompanied with a participatory workshop\/studio visit where we lead a small group on an outdoor walking tour exploring the nearby WiFi traffic. During this Data Safari, the group experiences their urban landscape through the perspective of probing WiFi devices, beaconing access points, and invisible network traffic. Throughout the workshop we discuss the WiFi activity we find in the wild, the ways this data can be used by companies and governments to track device owners, and privacy concerns surrounding WiFi. The goal of the workshop is to help people \u0022see\u0022 the WiFi activity around them and have discussions about the ways that WiFi data leaked from phones, tablets, and computers brings certain privacy\/security concerns.\r\n\u003C\/bb-p\u003E\r\n\r\n\u003Cbb-media\u003E\r\n\t\u003Cimg src=\u0022https:\/\/cms.brangerbriz.com\/img\/assetsFile\/images\/22a73d5967ad4628b37b6da7096529f3\u0022\/\u003E\r\n\u003C\/bb-media\u003E\r\n\r\n\u003Cbb-p\u003E\r\n\tWe\u0027ve conducted this participatory Data Safari at the \u003Ca href=\u0022http:\/\/cmato.org\/strings-data-and-the-self\u0022 target=\u0022_blank\u0022\u003ECalifornia Museum of Art Thousand Oaks\u003C\/a\u003E as well as at the Lafayette Electronic Arts Festival in Colorado. If you are interested in learning more, we\u0027ve written two blog posts on the subject as well; \u003Ca href=\u0022https:\/\/brangerbriz.com\/blog\/exploring-our-surrounding-wifi-landscape\u0022 target=\u0022_blank\u0022\u003Eone that describes the workshop experience\u003C\/a\u003E and the \u003Ca href=\u0022https:\/\/brangerbriz.com\/blog\/notes-from-our-wifi-data-safari\u0022 target=\u0022_blank\u0022\u003Eother that outlines the technical details\u003C\/a\u003E covered by the project.\r\n\u003C\/bb-p\u003E\r\n\r\n\u003Cbb-p\u003E\r\n\tWiFi Data Safari is an open source project and you can download, modify, remix, and share the \u003Ca href=\u0022https:\/\/github.com\/brangerbriz\/wifi-data-safari\u0022 target=\u0022_blank\u0022\u003Esource code on GitHub\u003C\/a\u003E.\r\n\u003C\/bb-p\u003E","id":15,"name":"Post Content"},{"value":"2018","id":20,"name":"year"},{"value":"","id":21,"name":"url"},{"value":"Concept Development, Design, Software Development, Installation","id":22,"name":"services"},{"value":"Shown at the California Museum of Art Thousand Oaks and the Lafayette Electronic Arts Festival in Colorado","id":23,"name":"recognition"},{"value":"","id":24,"name":"results"},{"value":"","id":47,"name":"clients"}]}]}],"success":true}
